; ModuleID = './[inter]src--enquiry.o.i'
source_filename = "./[inter]src--enquiry.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.cmdinfo = type { i8*, i8, i32, i32*, i8**, void (%struct.cmdinfo*, i8*)*, i32, i8*, i32 (i8**)* }
%struct.dpkg_version = type { i32, i8*, i8* }
%struct.varbuf = type { i64, i64, i8* }
%struct.relationinfo = type { i8*, i32, i32, i32, i32, i32, i32, i8 }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.2, i32 }
%struct.anon.2 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }

!91 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fsys_namenode_flags", file: !92, line: 61, size: 32, align: 32, elements: !93)
!92 = !DIFile(filename: "../lib/dpkg/fsys.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!93 = !{!94, !95, !96, !97, !98, !99, !100, !101, !102, !103}
!94 = !DIEnumerator(name: "FNNF_NEW_CONFF", value: 1)
!95 = !DIEnumerator(name: "FNNF_NEW_INARCHIVE", value: 2)
!96 = !DIEnumerator(name: "FNNF_OLD_CONFF", value: 4)
!97 = !DIEnumerator(name: "FNNF_OBS_CONFF", value: 8)
!98 = !DIEnumerator(name: "FNNF_ELIDE_OTHER_LISTS", value: 16)
!99 = !DIEnumerator(name: "FNNF_NO_ATOMIC_OVERWRITE", value: 32)
!100 = !DIEnumerator(name: "FNNF_PLACED_ON_DISK", value: 64)
!101 = !DIEnumerator(name: "FNNF_DEFERRED_FSYNC", value: 128)
!102 = !DIEnumerator(name: "FNNF_DEFERRED_RENAME", value: 256)
!103 = !DIEnumerator(name: "FNNF_FILTERED", value: 512)
!104 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "modstatdb_rw", file: !4, line: 263, size: 32, align: 32, elements: !105)
!105 = !{!106, !107, !108, !109, !110, !111, !112, !113}
!106 = !DIEnumerator(name: "msdbrw_readonly", value: 0)
!107 = !DIEnumerator(name: "msdbrw_needsuperuserlockonly", value: 1)
!108 = !DIEnumerator(name: "msdbrw_writeifposs", value: 2)
!109 = !DIEnumerator(name: "msdbrw_write", value: 3)
!110 = !DIEnumerator(name: "msdbrw_needsuperuser", value: 4)
!111 = !DIEnumerator(name: "msdbrw_available_readonly", value: 256)
!112 = !DIEnumerator(name: "msdbrw_available_write", value: 512)
!113 = !DIEnumerator(name: "msdbrw_available_mask", value: 65280)
!114 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_name_arch_when", file: !4, line: 396, size: 32, align: 32, elements: !115)
!115 = !{!116, !117, !118, !119}
!116 = !DIEnumerator(name: "pnaw_never", value: 0)
!117 = !DIEnumerator(name: "pnaw_nonambig", value: 1)
!118 = !DIEnumerator(name: "pnaw_foreign", value: 2)
!119 = !DIEnumerator(name: "pnaw_always", value: 3)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "which_pkgbin", file: !74, line: 340, size: 32, align: 32, elements: !121)
!121 = !{!122, !123, !124}
!122 = !DIEnumerator(name: "wpb_installed", value: 0)
!123 = !DIEnumerator(name: "wpb_available", value: 1)
!124 = !DIEnumerator(name: "wpb_by_istobe", value: 2)
!125 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_msg_type", file: !126, line: 36, size: 32, align: 32, elements: !127)
!126 = !DIFile(filename: "../lib/dpkg/error.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!127 = !{!128, !129, !130}
!128 = !DIEnumerator(name: "DPKG_MSG_NONE", value: 0)
!129 = !DIEnumerator(name: "DPKG_MSG_WARN", value: 1)
!130 = !DIEnumerator(name: "DPKG_MSG_ERROR", value: 2)
!131 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "debugflags", file: !132, line: 41, size: 32, align: 32, elements: !133)
!132 = !DIFile(filename: "../lib/dpkg/debug.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!133 = !{!134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146}
!134 = !DIEnumerator(name: "dbg_general", value: 1)
!135 = !DIEnumerator(name: "dbg_scripts", value: 2)
!136 = !DIEnumerator(name: "dbg_eachfile", value: 8)
!137 = !DIEnumerator(name: "dbg_eachfiledetail", value: 64)
!138 = !DIEnumerator(name: "dbg_conff", value: 16)
!139 = !DIEnumerator(name: "dbg_conffdetail", value: 128)
!140 = !DIEnumerator(name: "dbg_depcon", value: 32)
!141 = !DIEnumerator(name: "dbg_depcondetail", value: 256)
!142 = !DIEnumerator(name: "dbg_veryverbose", value: 512)
!143 = !DIEnumerator(name: "dbg_stupidlyverbose", value: 1024)
!144 = !DIEnumerator(name: "dbg_triggers", value: 4096)
!145 = !DIEnumerator(name: "dbg_triggersdetail", value: 8192)
!146 = !DIEnumerator(name: "dbg_triggersstupid", value: 16384)
!147 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "versiondisplayepochwhen", file: !4, line: 388, size: 32, align: 32, elements: !148)
!148 = !{!149, !150, !151}
!149 = !DIEnumerator(name: "vdew_never", value: 0)
!150 = !DIEnumerator(name: "vdew_nonambig", value: 1)
!151 = !DIEnumerator(name: "vdew_always", value: 2)
!152 = !{!153, !157, !158, !15}
!153 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !154, size: 64, align: 64)
!154 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !155, size: 64, align: 64)
!155 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !156)
!156 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!157 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!158 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!159 = !{!160, !178, !195}
!160 = distinct !DIGlobalVariable(name: "vb", scope: !161, file: !162, line: 459, type: !168, isLocal: true, isDefinition: true, variable: %struct.varbuf* @predeppackage.vb)
!161 = distinct !DISubprogram(name: "predeppackage", scope: !162, file: !162, line: 457, type: !163, isLocal: false, isDefinition: true, scopeLine: 458, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !167)
!162 = !DIFile(filename: "enquiry.c", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!163 = !DISubroutineType(types: !164)
!164 = !{!158, !165}
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !154)
!167 = !{}
!168 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !169, line: 55, size: 192, align: 64, elements: !170)
!169 = !DIFile(filename: "../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!170 = !{!171, !175, !176}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !168, file: !169, line: 56, baseType: !172, size: 64, align: 64)
!172 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !173, line: 216, baseType: !174)
!173 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!174 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !168, file: !169, line: 56, baseType: !172, size: 64, align: 64, offset: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !168, file: !169, line: 57, baseType: !177, size: 64, align: 64, offset: 128)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !156, size: 64, align: 64)
!178 = distinct !DIGlobalVariable(name: "relationinfos", scope: !179, file: !162, line: 676, type: !180, isLocal: true, isDefinition: true, variable: [18 x %struct.relationinfo]* @cmpversions.relationinfos)
!179 = distinct !DISubprogram(name: "cmpversions", scope: !162, file: !162, line: 666, type: !163, isLocal: false, isDefinition: true, scopeLine: 667, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !167)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 5760, align: 64, elements: !193)
!181 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !182)
!182 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "relationinfo", scope: !179, file: !162, line: 668, size: 320, align: 64, elements: !183)
!183 = !{!184, !185, !186, !187, !188, !189, !190, !191}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !182, file: !162, line: 669, baseType: !154, size: 64, align: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "if_lesser", scope: !182, file: !162, line: 671, baseType: !158, size: 32, align: 32, offset: 64)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "if_equal", scope: !182, file: !162, line: 671, baseType: !158, size: 32, align: 32, offset: 96)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "if_greater", scope: !182, file: !162, line: 671, baseType: !158, size: 32, align: 32, offset: 128)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "if_none_a", scope: !182, file: !162, line: 672, baseType: !158, size: 32, align: 32, offset: 160)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "if_none_both", scope: !182, file: !162, line: 672, baseType: !158, size: 32, align: 32, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "if_none_b", scope: !182, file: !162, line: 672, baseType: !158, size: 32, align: 32, offset: 224)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !182, file: !162, line: 673, baseType: !192, size: 8, align: 8, offset: 256)
!192 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!193 = !{!194}
!194 = !DISubrange(count: 18)
!195 = distinct !DIGlobalVariable(name: "audit_problems", scope: !0, file: !162, line: 89, type: !196, isLocal: true, isDefinition: true, variable: <{ { i1 (%struct.pkginfo*, %struct.audit_problem*)*, { i32, [4 x i8] }, i8* }, { i1 (%struct.pkginfo*, %struct.audit_problem*)*, { i32, [4 x i8] }, i8* }, { i1 (%struct.pkginfo*, %struct.audit_problem*)*, { i32, [4 x i8] }, i8* }, { i1 (%struct.pkginfo*, %struct.audit_problem*)*, { i32, [4 x i8] }, i8* }, { i1 (%struct.pkginfo*, %struct.audit_problem*)*, { i32, [4 x i8] }, i8* }, { i1 (%struct.pkginfo*, %struct.audit_problem*)*, { i32, [4 x i8] }, i8* }, %struct.audit_problem, %struct.audit_problem, { i1 (%struct.pkginfo*, %struct.audit_problem*)*, { i32, [4 x i8] }, i8* }, { i1 (%struct.pkginfo*, %struct.audit_problem*)*, { i32, [4 x i8] }, i8* }, { i1 (%struct.pkginfo*, %struct.audit_problem*)*, { i32, [4 x i8] }, i8* }, %struct.audit_problem }>* @audit_problems)
!196 = !DICompositeType(tag: DW_TAG_array_type, baseType: !197, size: 2304, align: 64, elements: !420)
!197 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !198)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "audit_problem", file: !162, line: 50, size: 192, align: 64, elements: !199)
!199 = !{!200, !414, !419}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "check", scope: !198, file: !162, line: 51, baseType: !201, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !202, size: 64, align: 64)
!202 = !DISubroutineType(types: !203)
!203 = !{!192, !204, !413}
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !206)
!206 = !{!207, !254, !255, !256, !257, !258, !259, !260, !261, !262, !292, !293, !309, !318, !334, !335, !341, !407, !411, !412}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !205, file: !4, line: 196, baseType: !208, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !209, size: 64, align: 64)
!209 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !210)
!210 = !{!211, !212, !213, !214, !253}
!211 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !209, file: !4, line: 243, baseType: !208, size: 64, align: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !209, file: !4, line: 244, baseType: !154, size: 64, align: 64, offset: 64)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !209, file: !4, line: 245, baseType: !205, size: 3072, align: 64, offset: 128)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !209, file: !4, line: 249, baseType: !215, size: 128, align: 64, offset: 3200)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !209, file: !4, line: 246, size: 128, align: 64, elements: !216)
!216 = !{!217, !252}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !215, file: !4, line: 247, baseType: !218, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !219, size: 64, align: 64)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !220)
!220 = !{!221, !229, !230, !231, !232, !233, !242, !249, !250, !251}
!221 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !219, file: !4, line: 64, baseType: !222, size: 64, align: 64)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !223, size: 64, align: 64)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !224)
!224 = !{!225, !226, !227, !228}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !223, file: !4, line: 57, baseType: !204, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !223, file: !4, line: 58, baseType: !222, size: 64, align: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !223, file: !4, line: 59, baseType: !218, size: 64, align: 64, offset: 128)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !223, file: !4, line: 60, baseType: !3, size: 32, align: 32, offset: 192)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !219, file: !4, line: 65, baseType: !208, size: 64, align: 64, offset: 64)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !219, file: !4, line: 66, baseType: !218, size: 64, align: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !219, file: !4, line: 66, baseType: !218, size: 64, align: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !219, file: !4, line: 66, baseType: !218, size: 64, align: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !219, file: !4, line: 67, baseType: !234, size: 64, align: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !235, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !236)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !16, line: 48, size: 192, align: 64, elements: !237)
!237 = !{!238, !240, !241}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !236, file: !16, line: 49, baseType: !239, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64, align: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !236, file: !16, line: 50, baseType: !154, size: 64, align: 64, offset: 64)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !236, file: !16, line: 51, baseType: !15, size: 32, align: 32, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !219, file: !4, line: 68, baseType: !243, size: 192, align: 64, offset: 384)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !27, line: 42, size: 192, align: 64, elements: !244)
!244 = !{!245, !247, !248}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !243, file: !27, line: 44, baseType: !246, size: 32, align: 32)
!246 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !243, file: !27, line: 46, baseType: !154, size: 64, align: 64, offset: 64)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !243, file: !27, line: 48, baseType: !154, size: 64, align: 64, offset: 128)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !219, file: !4, line: 69, baseType: !26, size: 32, align: 32, offset: 576)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !219, file: !4, line: 70, baseType: !192, size: 8, align: 8, offset: 608)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !219, file: !4, line: 71, baseType: !192, size: 8, align: 8, offset: 616)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !215, file: !4, line: 248, baseType: !218, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !209, file: !4, line: 250, baseType: !158, size: 32, align: 32, offset: 3328)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !205, file: !4, line: 197, baseType: !204, size: 64, align: 64, offset: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !205, file: !4, line: 199, baseType: !35, size: 32, align: 32, offset: 128)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !205, file: !4, line: 201, baseType: !43, size: 32, align: 32, offset: 160)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !205, file: !4, line: 202, baseType: !47, size: 32, align: 32, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !205, file: !4, line: 203, baseType: !57, size: 32, align: 32, offset: 224)
!259 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !205, file: !4, line: 204, baseType: !154, size: 64, align: 64, offset: 256)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !205, file: !4, line: 205, baseType: !154, size: 64, align: 64, offset: 320)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !205, file: !4, line: 206, baseType: !243, size: 192, align: 64, offset: 384)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !205, file: !4, line: 207, baseType: !263, size: 960, align: 64, offset: 576)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !264)
!264 = !{!265, !266, !267, !268, !269, !270, !271, !272, !273, !274, !275, !276, !277, !285}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !263, file: !4, line: 108, baseType: !222, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !263, file: !4, line: 110, baseType: !192, size: 8, align: 8, offset: 64)
!267 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !263, file: !4, line: 111, baseType: !67, size: 32, align: 32, offset: 96)
!268 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !263, file: !4, line: 112, baseType: !234, size: 64, align: 64, offset: 128)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !263, file: !4, line: 115, baseType: !154, size: 64, align: 64, offset: 192)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !263, file: !4, line: 116, baseType: !154, size: 64, align: 64, offset: 256)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !263, file: !4, line: 117, baseType: !154, size: 64, align: 64, offset: 320)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !263, file: !4, line: 118, baseType: !154, size: 64, align: 64, offset: 384)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !263, file: !4, line: 119, baseType: !154, size: 64, align: 64, offset: 448)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !263, file: !4, line: 120, baseType: !154, size: 64, align: 64, offset: 512)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !263, file: !4, line: 121, baseType: !154, size: 64, align: 64, offset: 576)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !263, file: !4, line: 122, baseType: !243, size: 192, align: 64, offset: 640)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !263, file: !4, line: 123, baseType: !278, size: 64, align: 64, offset: 832)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !280)
!280 = !{!281, !282, !283, !284}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !279, file: !4, line: 81, baseType: !278, size: 64, align: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !279, file: !4, line: 82, baseType: !154, size: 64, align: 64, offset: 64)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !279, file: !4, line: 83, baseType: !154, size: 64, align: 64, offset: 128)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !279, file: !4, line: 84, baseType: !192, size: 8, align: 8, offset: 192)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !263, file: !4, line: 124, baseType: !286, size: 64, align: 64, offset: 896)
!286 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !287, size: 64, align: 64)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !288)
!288 = !{!289, !290, !291}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !287, file: !4, line: 75, baseType: !286, size: 64, align: 64)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !287, file: !4, line: 76, baseType: !154, size: 64, align: 64, offset: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !287, file: !4, line: 77, baseType: !154, size: 64, align: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !205, file: !4, line: 208, baseType: !263, size: 960, align: 64, offset: 1536)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !205, file: !4, line: 209, baseType: !294, size: 64, align: 64, offset: 2496)
!294 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !295, size: 64, align: 64)
!295 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !74, line: 53, size: 256, align: 64, elements: !296)
!296 = !{!297, !298, !299, !300, !301, !302}
!297 = !DIDerivedType(tag: DW_TAG_member, name: "istobe", scope: !295, file: !74, line: 54, baseType: !73, size: 32, align: 32)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !295, file: !74, line: 57, baseType: !81, size: 32, align: 32, offset: 32)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "enqueued", scope: !295, file: !74, line: 59, baseType: !192, size: 8, align: 8, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "replacingfilesandsaid", scope: !295, file: !74, line: 61, baseType: !158, size: 32, align: 32, offset: 96)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "cmdline_seen", scope: !295, file: !74, line: 62, baseType: !158, size: 32, align: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "trigprocdeferred", scope: !295, file: !74, line: 65, baseType: !303, size: 64, align: 64, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !304, size: 64, align: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !305, line: 34, size: 128, align: 64, elements: !306)
!305 = !DIFile(filename: "../lib/dpkg/pkg-list.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !304, file: !305, line: 35, baseType: !303, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !304, file: !305, line: 36, baseType: !204, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !205, file: !4, line: 211, baseType: !310, size: 64, align: 64, offset: 2560)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !312)
!312 = !{!313, !314, !315, !316, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !311, file: !4, line: 88, baseType: !310, size: 64, align: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !311, file: !4, line: 89, baseType: !154, size: 64, align: 64, offset: 64)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !311, file: !4, line: 90, baseType: !154, size: 64, align: 64, offset: 128)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !311, file: !4, line: 91, baseType: !154, size: 64, align: 64, offset: 192)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !311, file: !4, line: 92, baseType: !154, size: 64, align: 64, offset: 256)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !205, file: !4, line: 216, baseType: !319, size: 128, align: 64, offset: 2624)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !205, file: !4, line: 213, size: 128, align: 64, elements: !320)
!320 = !{!321, !333}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !319, file: !4, line: 215, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !324)
!324 = !{!325, !326, !327, !328}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !323, file: !4, line: 143, baseType: !204, size: 64, align: 64)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !323, file: !4, line: 143, baseType: !204, size: 64, align: 64, offset: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !323, file: !4, line: 144, baseType: !322, size: 64, align: 64, offset: 128)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !323, file: !4, line: 147, baseType: !329, size: 128, align: 64, offset: 192)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !323, file: !4, line: 145, size: 128, align: 64, elements: !330)
!330 = !{!331, !332}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !329, file: !4, line: 146, baseType: !322, size: 64, align: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !329, file: !4, line: 146, baseType: !322, size: 64, align: 64, offset: 64)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !319, file: !4, line: 215, baseType: !322, size: 64, align: 64, offset: 64)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !205, file: !4, line: 219, baseType: !322, size: 64, align: 64, offset: 2752)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !205, file: !4, line: 220, baseType: !336, size: 64, align: 64, offset: 2816)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !337, size: 64, align: 64)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !338)
!338 = !{!339, !340}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !337, file: !4, line: 135, baseType: !336, size: 64, align: 64)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !337, file: !4, line: 136, baseType: !154, size: 64, align: 64, offset: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !205, file: !4, line: 231, baseType: !342, size: 64, align: 64, offset: 2880)
!342 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !343, size: 64, align: 64)
!343 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !92, line: 122, size: 128, align: 64, elements: !344)
!344 = !{!345, !346}
!345 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !343, file: !92, line: 123, baseType: !342, size: 64, align: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "namenode", scope: !343, file: !92, line: 124, baseType: !347, size: 64, align: 64, offset: 64)
!347 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !348, size: 64, align: 64)
!348 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode", file: !92, line: 90, size: 640, align: 64, elements: !349)
!349 = !{!350, !351, !352, !353, !361, !379, !394, !395, !396, !397}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !348, file: !92, line: 91, baseType: !347, size: 64, align: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !348, file: !92, line: 92, baseType: !154, size: 64, align: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "packages", scope: !348, file: !92, line: 93, baseType: !303, size: 64, align: 64, offset: 128)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "divert", scope: !348, file: !92, line: 94, baseType: !354, size: 64, align: 64, offset: 192)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_diversion", file: !92, line: 151, size: 256, align: 64, elements: !356)
!356 = !{!357, !358, !359, !360}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "useinstead", scope: !355, file: !92, line: 152, baseType: !347, size: 64, align: 64)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "camefrom", scope: !355, file: !92, line: 153, baseType: !347, size: 64, align: 64, offset: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "pkgset", scope: !355, file: !92, line: 154, baseType: !208, size: 64, align: 64, offset: 128)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !355, file: !92, line: 157, baseType: !354, size: 64, align: 64, offset: 192)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "statoverride", scope: !348, file: !92, line: 101, baseType: !362, size: 64, align: 64, offset: 256)
!362 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !363, size: 64, align: 64)
!363 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !364, line: 40, size: 256, align: 64, elements: !365)
!364 = !DIFile(filename: "../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!365 = !{!366, !371, !374, !377, !378}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !363, file: !364, line: 41, baseType: !367, size: 32, align: 32)
!367 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !368, line: 80, baseType: !369)
!368 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !370, line: 125, baseType: !246)
!370 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!371 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !363, file: !364, line: 42, baseType: !372, size: 32, align: 32, offset: 32)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !368, line: 65, baseType: !373)
!373 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !370, line: 126, baseType: !246)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !363, file: !364, line: 43, baseType: !375, size: 32, align: 32, offset: 64)
!375 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !368, line: 70, baseType: !376)
!376 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !370, line: 129, baseType: !246)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !363, file: !364, line: 47, baseType: !177, size: 64, align: 64, offset: 128)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !363, file: !364, line: 48, baseType: !177, size: 64, align: 64, offset: 192)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "trig_interested", scope: !348, file: !92, line: 103, baseType: !380, size: 64, align: 64, offset: 320)
!380 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !381, size: 64, align: 64)
!381 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigfileint", file: !87, line: 54, size: 448, align: 64, elements: !382)
!382 = !{!383, !384, !386, !387, !388, !389}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !381, file: !87, line: 55, baseType: !204, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "pkgbin", scope: !381, file: !87, line: 56, baseType: !385, size: 64, align: 64, offset: 64)
!385 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "fnn", scope: !381, file: !87, line: 57, baseType: !347, size: 64, align: 64, offset: 128)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !381, file: !87, line: 58, baseType: !86, size: 32, align: 32, offset: 192)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "samefile_next", scope: !381, file: !87, line: 59, baseType: !380, size: 64, align: 64, offset: 256)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "inoverall", scope: !381, file: !87, line: 62, baseType: !390, size: 128, align: 64, offset: 320)
!390 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !381, file: !87, line: 60, size: 128, align: 64, elements: !391)
!391 = !{!392, !393}
!392 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !390, file: !87, line: 61, baseType: !380, size: 64, align: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !390, file: !87, line: 61, baseType: !380, size: 64, align: 64, offset: 64)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !348, file: !92, line: 111, baseType: !91, size: 32, align: 32, offset: 384)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "oldhash", scope: !348, file: !92, line: 114, baseType: !154, size: 64, align: 64, offset: 448)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "newhash", scope: !348, file: !92, line: 117, baseType: !154, size: 64, align: 64, offset: 512)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "file_ondisk_id", scope: !348, file: !92, line: 119, baseType: !398, size: 64, align: 64, offset: 576)
!398 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !399, size: 64, align: 64)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_ondisk_id", file: !92, line: 85, size: 128, align: 64, elements: !400)
!400 = !{!401, !404}
!401 = !DIDerivedType(tag: DW_TAG_member, name: "id_dev", scope: !399, file: !92, line: 86, baseType: !402, size: 64, align: 64)
!402 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !368, line: 60, baseType: !403)
!403 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !370, line: 124, baseType: !174)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "id_ino", scope: !399, file: !92, line: 87, baseType: !405, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !368, line: 48, baseType: !406)
!406 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !370, line: 127, baseType: !174)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !205, file: !4, line: 232, baseType: !408, size: 64, align: 64, offset: 2944)
!408 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !368, line: 86, baseType: !409)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !370, line: 131, baseType: !410)
!410 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !205, file: !4, line: 233, baseType: !192, size: 8, align: 8, offset: 3008)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !205, file: !4, line: 236, baseType: !192, size: 8, align: 8, offset: 3016)
!413 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !198, file: !162, line: 55, baseType: !415, size: 64, align: 64, offset: 64)
!415 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !198, file: !162, line: 52, size: 64, align: 64, elements: !416)
!416 = !{!417, !418}
!417 = !DIDerivedType(tag: DW_TAG_member, name: "number", scope: !415, file: !162, line: 53, baseType: !158, size: 32, align: 32)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "string", scope: !415, file: !162, line: 54, baseType: !154, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "explanation", scope: !198, file: !162, line: 56, baseType: !154, size: 64, align: 64, offset: 128)
!420 = !{!421}
!421 = !DISubrange(count: 12)
!422 = !{i32 2, !"Dwarf Version", i32 4}
!423 = !{i32 2, !"Debug Info Version", i32 3}
!424 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!425 = distinct !DISubprogram(name: "audit", scope: !162, file: !162, line: 191, type: !163, isLocal: false, isDefinition: true, scopeLine: 192, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !167)
!426 = !DILocalVariable(name: "argv", arg: 1, scope: !425, file: !162, line: 191, type: !165)
!427 = !DIExpression()
!428 = !DILocation(line: 191, column: 26, scope: !425)
!429 = !DILocalVariable(name: "problem", scope: !425, file: !162, line: 193, type: !413)
!430 = !DILocation(line: 193, column: 31, scope: !425)
!431 = !DILocalVariable(name: "array", scope: !425, file: !162, line: 194, type: !432)
!432 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_array", file: !433, line: 38, size: 128, align: 64, elements: !434)
!433 = !DIFile(filename: "../lib/dpkg/pkg-array.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!434 = !{!435, !436}
!435 = !DIDerivedType(tag: DW_TAG_member, name: "n_pkgs", scope: !432, file: !433, line: 39, baseType: !158, size: 32, align: 32)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "pkgs", scope: !432, file: !433, line: 40, baseType: !437, size: 64, align: 64, offset: 64)
!437 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64, align: 64)
!438 = !DILocation(line: 194, column: 20, scope: !425)
!439 = !DILocalVariable(name: "head_running", scope: !425, file: !162, line: 195, type: !192)
!440 = !DILocation(line: 195, column: 7, scope: !425)
!441 = !DILocalVariable(name: "i", scope: !425, file: !162, line: 196, type: !158)
!442 = !DILocation(line: 196, column: 7, scope: !425)
!443 = !DILocation(line: 198, column: 3, scope: !425)
!444 = !DILocation(line: 200, column: 9, scope: !445)
!445 = distinct !DILexicalBlock(scope: !425, file: !162, line: 200, column: 7)
!446 = !DILocation(line: 200, column: 8, scope: !445)
!447 = !DILocation(line: 200, column: 7, scope: !425)
!448 = !DILocation(line: 201, column: 5, scope: !445)
!449 = !DILocation(line: 203, column: 72, scope: !445)
!450 = !DILocation(line: 203, column: 5, scope: !445)
!451 = !DILocation(line: 205, column: 3, scope: !425)
!452 = !DILocation(line: 207, column: 16, scope: !453)
!453 = distinct !DILexicalBlock(scope: !425, file: !162, line: 207, column: 3)
!454 = !DILocation(line: 207, column: 8, scope: !453)
!455 = !DILocation(line: 207, column: 34, scope: !456)
!456 = !DILexicalBlockFile(scope: !457, file: !162, discriminator: 1)
!457 = distinct !DILexicalBlock(scope: !453, file: !162, line: 207, column: 3)
!458 = !DILocation(line: 207, column: 43, scope: !456)
!459 = !DILocation(line: 207, column: 3, scope: !456)
!460 = !DILocalVariable(name: "head", scope: !461, file: !162, line: 208, type: !192)
!461 = distinct !DILexicalBlock(scope: !457, file: !162, line: 207, column: 61)
!462 = !DILocation(line: 208, column: 9, scope: !461)
!463 = !DILocation(line: 210, column: 12, scope: !464)
!464 = distinct !DILexicalBlock(scope: !461, file: !162, line: 210, column: 5)
!465 = !DILocation(line: 210, column: 10, scope: !464)
!466 = !DILocation(line: 210, column: 17, scope: !467)
!467 = !DILexicalBlockFile(scope: !468, file: !162, discriminator: 1)
!468 = distinct !DILexicalBlock(scope: !464, file: !162, line: 210, column: 5)
!469 = !DILocation(line: 210, column: 27, scope: !467)
!470 = !DILocation(line: 210, column: 19, scope: !467)
!471 = !DILocation(line: 210, column: 5, scope: !467)
!472 = !DILocalVariable(name: "pkg", scope: !473, file: !162, line: 211, type: !204)
!473 = distinct !DILexicalBlock(scope: !468, file: !162, line: 210, column: 40)
!474 = !DILocation(line: 211, column: 23, scope: !473)
!475 = !DILocation(line: 211, column: 40, scope: !473)
!476 = !DILocation(line: 211, column: 29, scope: !473)
!477 = !DILocation(line: 211, column: 35, scope: !473)
!478 = !DILocation(line: 213, column: 12, scope: !479)
!479 = distinct !DILexicalBlock(scope: !473, file: !162, line: 213, column: 11)
!480 = !DILocation(line: 213, column: 21, scope: !479)
!481 = !DILocation(line: 213, column: 27, scope: !479)
!482 = !DILocation(line: 213, column: 32, scope: !479)
!483 = !DILocation(line: 213, column: 11, scope: !473)
!484 = !DILocation(line: 214, column: 9, scope: !479)
!485 = !DILocation(line: 215, column: 12, scope: !486)
!486 = distinct !DILexicalBlock(scope: !473, file: !162, line: 215, column: 11)
!487 = !DILocation(line: 215, column: 11, scope: !473)
!488 = !DILocation(line: 216, column: 13, scope: !489)
!489 = distinct !DILexicalBlock(scope: !490, file: !162, line: 216, column: 13)
!490 = distinct !DILexicalBlock(scope: !486, file: !162, line: 215, column: 26)
!491 = !DILocation(line: 216, column: 13, scope: !490)
!492 = !DILocation(line: 217, column: 16, scope: !489)
!493 = !DILocation(line: 217, column: 11, scope: !494)
!494 = !DILexicalBlockFile(scope: !489, file: !162, discriminator: 1)
!495 = !DILocation(line: 217, column: 11, scope: !489)
!496 = !DILocation(line: 220, column: 22, scope: !490)
!497 = !DILocation(line: 221, column: 7, scope: !490)
!498 = !DILocation(line: 222, column: 12, scope: !499)
!499 = distinct !DILexicalBlock(scope: !473, file: !162, line: 222, column: 11)
!500 = !DILocation(line: 222, column: 11, scope: !473)
!501 = !DILocation(line: 223, column: 23, scope: !502)
!502 = distinct !DILexicalBlock(scope: !499, file: !162, line: 222, column: 18)
!503 = !DILocation(line: 223, column: 32, scope: !502)
!504 = !DILocation(line: 223, column: 15, scope: !502)
!505 = !DILocation(line: 223, column: 45, scope: !502)
!506 = !DILocation(line: 223, column: 9, scope: !507)
!507 = !DILexicalBlockFile(scope: !502, file: !162, discriminator: 1)
!508 = !DILocation(line: 224, column: 14, scope: !502)
!509 = !DILocation(line: 225, column: 7, scope: !502)
!510 = !DILocation(line: 226, column: 23, scope: !473)
!511 = !DILocation(line: 226, column: 7, scope: !473)
!512 = !DILocation(line: 227, column: 5, scope: !473)
!513 = !DILocation(line: 210, column: 36, scope: !514)
!514 = !DILexicalBlockFile(scope: !468, file: !162, discriminator: 2)
!515 = !DILocation(line: 210, column: 5, scope: !514)
!516 = distinct !{!516, !517}
!517 = !DILocation(line: 210, column: 5, scope: !461)
!518 = !DILocation(line: 229, column: 9, scope: !519)
!519 = distinct !DILexicalBlock(scope: !461, file: !162, line: 229, column: 9)
!520 = !DILocation(line: 229, column: 9, scope: !461)
!521 = !DILocation(line: 229, column: 15, scope: !522)
!522 = !DILexicalBlockFile(scope: !519, file: !162, discriminator: 1)
!523 = !DILocation(line: 230, column: 3, scope: !461)
!524 = !DILocation(line: 207, column: 57, scope: !525)
!525 = !DILexicalBlockFile(scope: !457, file: !162, discriminator: 2)
!526 = !DILocation(line: 207, column: 3, scope: !525)
!527 = distinct !{!527, !528}
!528 = !DILocation(line: 207, column: 3, scope: !425)
!529 = !DILocation(line: 232, column: 3, scope: !425)
!530 = !DILocation(line: 234, column: 11, scope: !425)
!531 = !DILocation(line: 234, column: 19, scope: !425)
!532 = !DILocation(line: 234, column: 3, scope: !533)
!533 = !DILexicalBlockFile(scope: !425, file: !162, discriminator: 1)
!534 = !DILocation(line: 236, column: 3, scope: !425)
!535 = distinct !DISubprogram(name: "pkg_array_mapper", scope: !162, file: !162, line: 179, type: !536, isLocal: true, isDefinition: true, scopeLine: 180, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !167)
!536 = !DISubroutineType(types: !537)
!537 = !{!204, !154}
!538 = !DILocalVariable(name: "name", arg: 1, scope: !535, file: !162, line: 179, type: !154)
!539 = !DILocation(line: 179, column: 30, scope: !535)
!540 = !DILocalVariable(name: "pkg", scope: !535, file: !162, line: 181, type: !204)
!541 = !DILocation(line: 181, column: 19, scope: !535)
!542 = !DILocation(line: 183, column: 36, scope: !535)
!543 = !DILocation(line: 183, column: 47, scope: !535)
!544 = !DILocation(line: 183, column: 9, scope: !535)
!545 = !DILocation(line: 183, column: 7, scope: !535)
!546 = !DILocation(line: 184, column: 7, scope: !547)
!547 = distinct !DILexicalBlock(scope: !535, file: !162, line: 184, column: 7)
!548 = !DILocation(line: 184, column: 12, scope: !547)
!549 = !DILocation(line: 184, column: 19, scope: !547)
!550 = !DILocation(line: 184, column: 7, scope: !535)
!551 = !DILocation(line: 185, column: 12, scope: !547)
!552 = !DILocation(line: 185, column: 63, scope: !547)
!553 = !DILocation(line: 185, column: 54, scope: !554)
!554 = !DILexicalBlockFile(scope: !547, file: !162, discriminator: 1)
!555 = !DILocation(line: 185, column: 5, scope: !556)
!556 = !DILexicalBlockFile(scope: !547, file: !162, discriminator: 2)
!557 = !DILocation(line: 185, column: 5, scope: !547)
!558 = !DILocation(line: 187, column: 10, scope: !535)
!559 = !DILocation(line: 187, column: 3, scope: !535)
!560 = distinct !DISubprogram(name: "describebriefly", scope: !162, file: !162, line: 164, type: !561, isLocal: true, isDefinition: true, scopeLine: 164, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !167)
!561 = !DISubroutineType(types: !562)
!562 = !{null, !204}
!563 = !DILocalVariable(name: "pkg", arg: 1, scope: !560, file: !162, line: 164, type: !204)
!564 = !DILocation(line: 164, column: 45, scope: !560)
!565 = !DILocalVariable(name: "maxl", scope: !560, file: !162, line: 165, type: !158)
!566 = !DILocation(line: 165, column: 7, scope: !560)
!567 = !DILocalVariable(name: "l", scope: !560, file: !162, line: 165, type: !158)
!568 = !DILocation(line: 165, column: 13, scope: !560)
!569 = !DILocalVariable(name: "pdesc", scope: !560, file: !162, line: 166, type: !154)
!570 = !DILocation(line: 166, column: 15, scope: !560)
!571 = !DILocation(line: 168, column: 7, scope: !560)
!572 = !DILocation(line: 169, column: 13, scope: !560)
!573 = !DILocation(line: 169, column: 18, scope: !560)
!574 = !DILocation(line: 169, column: 23, scope: !560)
!575 = !DILocation(line: 169, column: 6, scope: !560)
!576 = !DILocation(line: 169, column: 4, scope: !560)
!577 = !DILocation(line: 170, column: 7, scope: !578)
!578 = distinct !DILexicalBlock(scope: !560, file: !162, line: 170, column: 7)
!579 = !DILocation(line: 170, column: 8, scope: !578)
!580 = !DILocation(line: 170, column: 7, scope: !560)
!581 = !DILocation(line: 170, column: 22, scope: !582)
!582 = !DILexicalBlockFile(scope: !578, file: !162, discriminator: 1)
!583 = !DILocation(line: 170, column: 23, scope: !582)
!584 = !DILocation(line: 170, column: 18, scope: !582)
!585 = !DILocation(line: 170, column: 13, scope: !582)
!586 = !DILocation(line: 172, column: 27, scope: !560)
!587 = !DILocation(line: 172, column: 33, scope: !560)
!588 = !DILocation(line: 172, column: 38, scope: !560)
!589 = !DILocation(line: 172, column: 11, scope: !560)
!590 = !DILocation(line: 172, column: 9, scope: !560)
!591 = !DILocation(line: 173, column: 9, scope: !560)
!592 = !DILocation(line: 173, column: 15, scope: !560)
!593 = !DILocation(line: 173, column: 12, scope: !560)
!594 = !DILocation(line: 173, column: 8, scope: !560)
!595 = !DILocation(line: 173, column: 24, scope: !596)
!596 = !DILexicalBlockFile(scope: !560, file: !162, discriminator: 1)
!597 = !DILocation(line: 173, column: 8, scope: !596)
!598 = !DILocation(line: 173, column: 30, scope: !599)
!599 = !DILexicalBlockFile(scope: !560, file: !162, discriminator: 2)
!600 = !DILocation(line: 173, column: 8, scope: !599)
!601 = !DILocation(line: 173, column: 8, scope: !602)
!602 = !DILexicalBlockFile(scope: !560, file: !162, discriminator: 3)
!603 = !DILocation(line: 173, column: 5, scope: !602)
!604 = !DILocation(line: 175, column: 36, scope: !560)
!605 = !DILocation(line: 175, column: 27, scope: !560)
!606 = !DILocation(line: 175, column: 57, scope: !560)
!607 = !DILocation(line: 175, column: 60, scope: !560)
!608 = !DILocation(line: 175, column: 3, scope: !596)
!609 = !DILocation(line: 176, column: 1, scope: !560)
!610 = distinct !DISubprogram(name: "unpackchk", scope: !162, file: !162, line: 272, type: !163, isLocal: false, isDefinition: true, scopeLine: 273, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !167)
!611 = !DILocalVariable(name: "argv", arg: 1, scope: !610, file: !162, line: 272, type: !165)
!612 = !DILocation(line: 272, column: 30, scope: !610)
!613 = !DILocalVariable(name: "totalcount", scope: !610, file: !162, line: 274, type: !158)
!614 = !DILocation(line: 274, column: 7, scope: !610)
!615 = !DILocalVariable(name: "sects", scope: !610, file: !162, line: 274, type: !158)
!616 = !DILocation(line: 274, column: 19, scope: !610)
!617 = !DILocalVariable(name: "sectionentries", scope: !610, file: !162, line: 275, type: !618)
!618 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !619, size: 64, align: 64)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sectionentry", file: !162, line: 239, size: 192, align: 64, elements: !620)
!620 = !{!621, !622, !623}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !619, file: !162, line: 240, baseType: !618, size: 64, align: 64)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !619, file: !162, line: 241, baseType: !154, size: 64, align: 64, offset: 64)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "count", scope: !619, file: !162, line: 242, baseType: !158, size: 32, align: 32, offset: 128)
!624 = !DILocation(line: 275, column: 24, scope: !610)
!625 = !DILocalVariable(name: "se", scope: !610, file: !162, line: 275, type: !618)
!626 = !DILocation(line: 275, column: 41, scope: !610)
!627 = !DILocalVariable(name: "sep", scope: !610, file: !162, line: 275, type: !628)
!628 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !618, size: 64, align: 64)
!629 = !DILocation(line: 275, column: 47, scope: !610)
!630 = !DILocalVariable(name: "iter", scope: !610, file: !162, line: 276, type: !631)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64, align: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_hash_iter", file: !4, line: 314, flags: DIFlagFwdDecl)
!633 = !DILocation(line: 276, column: 25, scope: !610)
!634 = !DILocalVariable(name: "pkg", scope: !610, file: !162, line: 277, type: !204)
!635 = !DILocation(line: 277, column: 19, scope: !610)
!636 = !DILocalVariable(name: "thissect", scope: !610, file: !162, line: 278, type: !154)
!637 = !DILocation(line: 278, column: 15, scope: !610)
!638 = !DILocalVariable(name: "buf", scope: !610, file: !162, line: 279, type: !639)
!639 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 160, align: 8, elements: !640)
!640 = !{!641}
!641 = !DISubrange(count: 20)
!642 = !DILocation(line: 279, column: 8, scope: !610)
!643 = !DILocalVariable(name: "width", scope: !610, file: !162, line: 280, type: !158)
!644 = !DILocation(line: 280, column: 7, scope: !610)
!645 = !DILocation(line: 282, column: 8, scope: !646)
!646 = distinct !DILexicalBlock(scope: !610, file: !162, line: 282, column: 7)
!647 = !DILocation(line: 282, column: 7, scope: !646)
!648 = !DILocation(line: 282, column: 7, scope: !610)
!649 = !DILocation(line: 283, column: 14, scope: !646)
!650 = !DILocation(line: 283, column: 50, scope: !646)
!651 = !DILocation(line: 283, column: 61, scope: !646)
!652 = !DILocation(line: 283, column: 5, scope: !653)
!653 = !DILexicalBlockFile(scope: !646, file: !162, discriminator: 1)
!654 = !DILocation(line: 283, column: 5, scope: !646)
!655 = !DILocation(line: 285, column: 3, scope: !610)
!656 = !DILocation(line: 287, column: 13, scope: !610)
!657 = !DILocation(line: 288, column: 18, scope: !610)
!658 = !DILocation(line: 289, column: 8, scope: !610)
!659 = !DILocation(line: 290, column: 10, scope: !610)
!660 = !DILocation(line: 290, column: 8, scope: !610)
!661 = !DILocation(line: 291, column: 3, scope: !610)
!662 = !DILocation(line: 291, column: 40, scope: !663)
!663 = !DILexicalBlockFile(scope: !610, file: !162, discriminator: 1)
!664 = !DILocation(line: 291, column: 17, scope: !663)
!665 = !DILocation(line: 291, column: 15, scope: !663)
!666 = !DILocation(line: 291, column: 3, scope: !663)
!667 = !DILocation(line: 292, column: 26, scope: !668)
!668 = distinct !DILexicalBlock(scope: !669, file: !162, line: 292, column: 9)
!669 = distinct !DILexicalBlock(scope: !610, file: !162, line: 291, column: 48)
!670 = !DILocation(line: 292, column: 10, scope: !668)
!671 = !DILocation(line: 292, column: 9, scope: !669)
!672 = !DILocation(line: 292, column: 43, scope: !673)
!673 = !DILexicalBlockFile(scope: !668, file: !162, discriminator: 1)
!674 = distinct !{!674, !661}
!675 = !DILocation(line: 293, column: 14, scope: !676)
!676 = distinct !DILexicalBlock(scope: !669, file: !162, line: 293, column: 5)
!677 = !DILocation(line: 293, column: 12, scope: !676)
!678 = !DILocation(line: 293, column: 10, scope: !676)
!679 = !DILocation(line: 293, column: 30, scope: !680)
!680 = !DILexicalBlockFile(scope: !681, file: !162, discriminator: 1)
!681 = distinct !DILexicalBlock(scope: !676, file: !162, line: 293, column: 5)
!682 = !DILocation(line: 293, column: 33, scope: !680)
!683 = !DILocation(line: 293, column: 47, scope: !684)
!684 = !DILexicalBlockFile(scope: !681, file: !162, discriminator: 2)
!685 = !DILocation(line: 293, column: 56, scope: !684)
!686 = !DILocation(line: 293, column: 60, scope: !684)
!687 = !DILocation(line: 293, column: 36, scope: !684)
!688 = !DILocation(line: 293, column: 33, scope: !684)
!689 = !DILocation(line: 293, column: 5, scope: !690)
!690 = !DILexicalBlockFile(scope: !676, file: !162, discriminator: 3)
!691 = !DILocation(line: 293, column: 5, scope: !692)
!692 = !DILexicalBlockFile(scope: !676, file: !162, discriminator: 4)
!693 = !DILocation(line: 293, column: 71, scope: !694)
!694 = !DILexicalBlockFile(scope: !681, file: !162, discriminator: 5)
!695 = !DILocation(line: 293, column: 75, scope: !694)
!696 = !DILocation(line: 293, column: 69, scope: !694)
!697 = !DILocation(line: 293, column: 5, scope: !694)
!698 = distinct !{!698, !699}
!699 = !DILocation(line: 293, column: 5, scope: !669)
!700 = !DILocation(line: 294, column: 10, scope: !701)
!701 = distinct !DILexicalBlock(scope: !669, file: !162, line: 294, column: 9)
!702 = !DILocation(line: 294, column: 9, scope: !669)
!703 = !DILocation(line: 295, column: 12, scope: !704)
!704 = distinct !DILexicalBlock(scope: !701, file: !162, line: 294, column: 14)
!705 = !DILocation(line: 295, column: 10, scope: !704)
!706 = !DILocation(line: 296, column: 15, scope: !707)
!707 = distinct !DILexicalBlock(scope: !704, file: !162, line: 296, column: 7)
!708 = !DILocation(line: 296, column: 12, scope: !707)
!709 = !DILocation(line: 297, column: 13, scope: !710)
!710 = distinct !DILexicalBlock(scope: !707, file: !162, line: 296, column: 7)
!711 = !DILocation(line: 297, column: 12, scope: !710)
!712 = !DILocation(line: 297, column: 17, scope: !710)
!713 = !DILocation(line: 297, column: 31, scope: !714)
!714 = !DILexicalBlockFile(scope: !710, file: !162, discriminator: 1)
!715 = !DILocation(line: 297, column: 42, scope: !714)
!716 = !DILocation(line: 297, column: 41, scope: !714)
!717 = !DILocation(line: 297, column: 48, scope: !714)
!718 = !DILocation(line: 297, column: 20, scope: !714)
!719 = !DILocation(line: 297, column: 54, scope: !714)
!720 = !DILocation(line: 296, column: 7, scope: !721)
!721 = !DILexicalBlockFile(scope: !707, file: !162, discriminator: 1)
!722 = !DILocation(line: 296, column: 7, scope: !723)
!723 = !DILexicalBlockFile(scope: !707, file: !162, discriminator: 2)
!724 = !DILocation(line: 298, column: 20, scope: !710)
!725 = !DILocation(line: 298, column: 19, scope: !710)
!726 = !DILocation(line: 298, column: 26, scope: !710)
!727 = !DILocation(line: 298, column: 15, scope: !710)
!728 = !DILocation(line: 296, column: 7, scope: !729)
!729 = !DILexicalBlockFile(scope: !710, file: !162, discriminator: 3)
!730 = distinct !{!730, !731}
!731 = !DILocation(line: 296, column: 7, scope: !704)
!732 = !DILocation(line: 299, column: 17, scope: !704)
!733 = !DILocation(line: 299, column: 7, scope: !704)
!734 = !DILocation(line: 299, column: 11, scope: !704)
!735 = !DILocation(line: 299, column: 15, scope: !704)
!736 = !DILocation(line: 300, column: 7, scope: !704)
!737 = !DILocation(line: 300, column: 11, scope: !704)
!738 = !DILocation(line: 300, column: 16, scope: !704)
!739 = !DILocation(line: 301, column: 18, scope: !704)
!740 = !DILocation(line: 301, column: 17, scope: !704)
!741 = !DILocation(line: 301, column: 7, scope: !704)
!742 = !DILocation(line: 301, column: 11, scope: !704)
!743 = !DILocation(line: 301, column: 15, scope: !704)
!744 = !DILocation(line: 302, column: 13, scope: !704)
!745 = !DILocation(line: 302, column: 8, scope: !704)
!746 = !DILocation(line: 302, column: 11, scope: !704)
!747 = !DILocation(line: 303, column: 12, scope: !704)
!748 = !DILocation(line: 304, column: 5, scope: !704)
!749 = !DILocation(line: 305, column: 5, scope: !669)
!750 = !DILocation(line: 305, column: 9, scope: !669)
!751 = !DILocation(line: 305, column: 14, scope: !669)
!752 = !DILocation(line: 305, column: 28, scope: !669)
!753 = !DILocation(line: 291, column: 3, scope: !754)
!754 = !DILexicalBlockFile(scope: !610, file: !162, discriminator: 2)
!755 = !DILocation(line: 307, column: 22, scope: !610)
!756 = !DILocation(line: 307, column: 3, scope: !610)
!757 = !DILocation(line: 309, column: 7, scope: !758)
!758 = distinct !DILexicalBlock(scope: !610, file: !162, line: 309, column: 7)
!759 = !DILocation(line: 309, column: 18, scope: !758)
!760 = !DILocation(line: 309, column: 7, scope: !610)
!761 = !DILocation(line: 310, column: 5, scope: !758)
!762 = !DILocation(line: 312, column: 7, scope: !763)
!763 = distinct !DILexicalBlock(scope: !610, file: !162, line: 312, column: 7)
!764 = !DILocation(line: 312, column: 18, scope: !763)
!765 = !DILocation(line: 312, column: 7, scope: !610)
!766 = !DILocation(line: 313, column: 12, scope: !767)
!767 = distinct !DILexicalBlock(scope: !763, file: !162, line: 312, column: 25)
!768 = !DILocation(line: 313, column: 10, scope: !767)
!769 = !DILocation(line: 314, column: 5, scope: !767)
!770 = !DILocation(line: 314, column: 42, scope: !771)
!771 = !DILexicalBlockFile(scope: !767, file: !162, discriminator: 1)
!772 = !DILocation(line: 314, column: 19, scope: !771)
!773 = !DILocation(line: 314, column: 17, scope: !771)
!774 = !DILocation(line: 314, column: 5, scope: !771)
!775 = !DILocation(line: 315, column: 28, scope: !776)
!776 = distinct !DILexicalBlock(scope: !777, file: !162, line: 315, column: 11)
!777 = distinct !DILexicalBlock(scope: !767, file: !162, line: 314, column: 50)
!778 = !DILocation(line: 315, column: 12, scope: !776)
!779 = !DILocation(line: 315, column: 11, scope: !777)
!780 = !DILocation(line: 316, column: 9, scope: !776)
!781 = distinct !{!781, !769}
!782 = !DILocation(line: 317, column: 23, scope: !777)
!783 = !DILocation(line: 317, column: 7, scope: !777)
!784 = !DILocation(line: 314, column: 5, scope: !785)
!785 = !DILexicalBlockFile(scope: !767, file: !162, discriminator: 2)
!786 = !DILocation(line: 319, column: 24, scope: !767)
!787 = !DILocation(line: 319, column: 5, scope: !767)
!788 = !DILocation(line: 320, column: 3, scope: !767)
!789 = !DILocation(line: 320, column: 14, scope: !790)
!790 = !DILexicalBlockFile(scope: !791, file: !162, discriminator: 1)
!791 = distinct !DILexicalBlock(scope: !763, file: !162, line: 320, column: 14)
!792 = !DILocation(line: 320, column: 20, scope: !790)
!793 = !DILocation(line: 321, column: 14, scope: !794)
!794 = distinct !DILexicalBlock(scope: !795, file: !162, line: 321, column: 5)
!795 = distinct !DILexicalBlock(scope: !791, file: !162, line: 320, column: 27)
!796 = !DILocation(line: 321, column: 12, scope: !794)
!797 = !DILocation(line: 321, column: 10, scope: !794)
!798 = !DILocation(line: 321, column: 30, scope: !799)
!799 = !DILexicalBlockFile(scope: !800, file: !162, discriminator: 1)
!800 = distinct !DILexicalBlock(scope: !794, file: !162, line: 321, column: 5)
!801 = !DILocation(line: 321, column: 5, scope: !799)
!802 = !DILocation(line: 322, column: 15, scope: !803)
!803 = distinct !DILexicalBlock(scope: !800, file: !162, line: 321, column: 48)
!804 = !DILocation(line: 322, column: 24, scope: !803)
!805 = !DILocation(line: 322, column: 28, scope: !803)
!806 = !DILocation(line: 322, column: 7, scope: !803)
!807 = !DILocation(line: 323, column: 14, scope: !803)
!808 = !DILocation(line: 323, column: 37, scope: !803)
!809 = !DILocation(line: 323, column: 41, scope: !803)
!810 = !DILocation(line: 323, column: 47, scope: !803)
!811 = !DILocation(line: 323, column: 51, scope: !803)
!812 = !DILocation(line: 323, column: 7, scope: !813)
!813 = !DILexicalBlockFile(scope: !803, file: !162, discriminator: 1)
!814 = !DILocation(line: 324, column: 24, scope: !803)
!815 = !DILocation(line: 324, column: 28, scope: !803)
!816 = !DILocation(line: 324, column: 17, scope: !803)
!817 = !DILocation(line: 324, column: 16, scope: !803)
!818 = !DILocation(line: 324, column: 41, scope: !803)
!819 = !DILocation(line: 324, column: 34, scope: !813)
!820 = !DILocation(line: 324, column: 33, scope: !803)
!821 = !DILocation(line: 324, column: 14, scope: !803)
!822 = !DILocation(line: 324, column: 12, scope: !803)
!823 = !DILocation(line: 325, column: 7, scope: !803)
!824 = !DILocation(line: 325, column: 14, scope: !813)
!825 = !DILocation(line: 325, column: 20, scope: !813)
!826 = !DILocation(line: 325, column: 7, scope: !813)
!827 = !DILocation(line: 325, column: 28, scope: !828)
!828 = !DILexicalBlockFile(scope: !829, file: !162, discriminator: 2)
!829 = distinct !DILexicalBlock(scope: !803, file: !162, line: 325, column: 26)
!830 = !DILocation(line: 325, column: 47, scope: !828)
!831 = !DILocation(line: 325, column: 7, scope: !828)
!832 = distinct !{!832, !823}
!833 = !DILocation(line: 326, column: 14, scope: !803)
!834 = !DILocation(line: 326, column: 12, scope: !803)
!835 = !DILocation(line: 327, column: 7, scope: !803)
!836 = !DILocation(line: 327, column: 44, scope: !813)
!837 = !DILocation(line: 327, column: 21, scope: !813)
!838 = !DILocation(line: 327, column: 19, scope: !813)
!839 = !DILocation(line: 327, column: 7, scope: !813)
!840 = !DILocalVariable(name: "pkgname", scope: !841, file: !162, line: 328, type: !154)
!841 = distinct !DILexicalBlock(scope: !803, file: !162, line: 327, column: 52)
!842 = !DILocation(line: 328, column: 21, scope: !841)
!843 = !DILocation(line: 330, column: 30, scope: !844)
!844 = distinct !DILexicalBlock(scope: !841, file: !162, line: 330, column: 13)
!845 = !DILocation(line: 330, column: 14, scope: !844)
!846 = !DILocation(line: 330, column: 13, scope: !841)
!847 = !DILocation(line: 330, column: 46, scope: !848)
!848 = !DILexicalBlockFile(scope: !844, file: !162, discriminator: 1)
!849 = distinct !{!849, !835}
!850 = !DILocation(line: 331, column: 24, scope: !851)
!851 = distinct !DILexicalBlock(scope: !841, file: !162, line: 331, column: 13)
!852 = !DILocation(line: 331, column: 33, scope: !851)
!853 = !DILocation(line: 331, column: 37, scope: !851)
!854 = !DILocation(line: 331, column: 13, scope: !851)
!855 = !DILocation(line: 331, column: 13, scope: !841)
!856 = !DILocation(line: 331, column: 44, scope: !857)
!857 = !DILexicalBlockFile(scope: !851, file: !162, discriminator: 1)
!858 = !DILocation(line: 332, column: 28, scope: !841)
!859 = !DILocation(line: 332, column: 19, scope: !841)
!860 = !DILocation(line: 332, column: 17, scope: !841)
!861 = !DILocation(line: 333, column: 25, scope: !841)
!862 = !DILocation(line: 333, column: 18, scope: !841)
!863 = !DILocation(line: 333, column: 15, scope: !841)
!864 = !DILocation(line: 334, column: 14, scope: !841)
!865 = !DILocation(line: 335, column: 13, scope: !866)
!866 = distinct !DILexicalBlock(scope: !841, file: !162, line: 335, column: 13)
!867 = !DILocation(line: 335, column: 19, scope: !866)
!868 = !DILocation(line: 335, column: 13, scope: !841)
!869 = !DILocation(line: 335, column: 26, scope: !870)
!870 = !DILexicalBlockFile(scope: !871, file: !162, discriminator: 1)
!871 = distinct !DILexicalBlock(scope: !866, file: !162, line: 335, column: 24)
!872 = !DILocation(line: 335, column: 42, scope: !870)
!873 = !DILocation(line: 336, column: 23, scope: !841)
!874 = !DILocation(line: 336, column: 9, scope: !841)
!875 = !DILocation(line: 327, column: 7, scope: !876)
!876 = !DILexicalBlockFile(scope: !803, file: !162, discriminator: 2)
!877 = !DILocation(line: 338, column: 26, scope: !803)
!878 = !DILocation(line: 338, column: 7, scope: !803)
!879 = !DILocation(line: 339, column: 7, scope: !803)
!880 = !DILocation(line: 340, column: 5, scope: !803)
!881 = !DILocation(line: 321, column: 38, scope: !882)
!882 = !DILexicalBlockFile(scope: !800, file: !162, discriminator: 2)
!883 = !DILocation(line: 321, column: 42, scope: !882)
!884 = !DILocation(line: 321, column: 36, scope: !882)
!885 = !DILocation(line: 321, column: 5, scope: !882)
!886 = distinct !{!886, !887}
!887 = !DILocation(line: 321, column: 5, scope: !795)
!888 = !DILocation(line: 341, column: 3, scope: !795)
!889 = !DILocation(line: 342, column: 111, scope: !890)
!890 = distinct !DILexicalBlock(scope: !791, file: !162, line: 341, column: 10)
!891 = !DILocation(line: 342, column: 12, scope: !890)
!892 = !DILocation(line: 344, column: 12, scope: !890)
!893 = !DILocation(line: 342, column: 5, scope: !894)
!894 = !DILexicalBlockFile(scope: !890, file: !162, discriminator: 1)
!895 = !DILocation(line: 345, column: 10, scope: !890)
!896 = !DILocation(line: 346, column: 14, scope: !897)
!897 = distinct !DILexicalBlock(scope: !890, file: !162, line: 346, column: 5)
!898 = !DILocation(line: 346, column: 12, scope: !897)
!899 = !DILocation(line: 346, column: 10, scope: !897)
!900 = !DILocation(line: 346, column: 30, scope: !901)
!901 = !DILexicalBlockFile(scope: !902, file: !162, discriminator: 1)
!902 = distinct !DILexicalBlock(scope: !897, file: !162, line: 346, column: 5)
!903 = !DILocation(line: 346, column: 5, scope: !901)
!904 = !DILocation(line: 347, column: 15, scope: !905)
!905 = distinct !DILexicalBlock(scope: !902, file: !162, line: 346, column: 48)
!906 = !DILocation(line: 347, column: 24, scope: !905)
!907 = !DILocation(line: 347, column: 28, scope: !905)
!908 = !DILocation(line: 347, column: 7, scope: !905)
!909 = !DILocation(line: 348, column: 28, scope: !905)
!910 = !DILocation(line: 348, column: 32, scope: !905)
!911 = !DILocation(line: 348, column: 21, scope: !905)
!912 = !DILocation(line: 348, column: 19, scope: !905)
!913 = !DILocation(line: 348, column: 47, scope: !905)
!914 = !DILocation(line: 348, column: 40, scope: !915)
!915 = !DILexicalBlockFile(scope: !905, file: !162, discriminator: 1)
!916 = !DILocation(line: 348, column: 38, scope: !905)
!917 = !DILocation(line: 348, column: 13, scope: !905)
!918 = !DILocation(line: 349, column: 11, scope: !919)
!919 = distinct !DILexicalBlock(scope: !905, file: !162, line: 349, column: 11)
!920 = !DILocation(line: 349, column: 17, scope: !919)
!921 = !DILocation(line: 349, column: 11, scope: !905)
!922 = !DILocation(line: 349, column: 24, scope: !923)
!923 = !DILexicalBlockFile(scope: !924, file: !162, discriminator: 1)
!924 = distinct !DILexicalBlock(scope: !919, file: !162, line: 349, column: 22)
!925 = !DILocation(line: 349, column: 58, scope: !923)
!926 = !DILocation(line: 349, column: 62, scope: !923)
!927 = !DILocation(line: 349, column: 51, scope: !928)
!928 = !DILexicalBlockFile(scope: !923, file: !162, discriminator: 2)
!929 = !DILocation(line: 349, column: 49, scope: !923)
!930 = !DILocation(line: 349, column: 77, scope: !923)
!931 = !DILocation(line: 349, column: 70, scope: !932)
!932 = !DILexicalBlockFile(scope: !923, file: !162, discriminator: 3)
!933 = !DILocation(line: 349, column: 68, scope: !923)
!934 = !DILocation(line: 349, column: 46, scope: !923)
!935 = !DILocation(line: 349, column: 44, scope: !923)
!936 = !DILocation(line: 349, column: 83, scope: !923)
!937 = !DILocation(line: 350, column: 27, scope: !905)
!938 = !DILocation(line: 350, column: 31, scope: !905)
!939 = !DILocation(line: 350, column: 36, scope: !905)
!940 = !DILocation(line: 350, column: 40, scope: !905)
!941 = !DILocation(line: 350, column: 7, scope: !905)
!942 = !DILocation(line: 351, column: 5, scope: !905)
!943 = !DILocation(line: 346, column: 38, scope: !944)
!944 = !DILexicalBlockFile(scope: !902, file: !162, discriminator: 2)
!945 = !DILocation(line: 346, column: 42, scope: !944)
!946 = !DILocation(line: 346, column: 36, scope: !944)
!947 = !DILocation(line: 346, column: 5, scope: !944)
!948 = distinct !{!948, !949}
!949 = !DILocation(line: 346, column: 5, scope: !890)
!950 = !DILocation(line: 352, column: 5, scope: !890)
!951 = !DILocation(line: 355, column: 11, scope: !610)
!952 = !DILocation(line: 355, column: 19, scope: !610)
!953 = !DILocation(line: 355, column: 3, scope: !663)
!954 = !DILocation(line: 357, column: 3, scope: !610)
!955 = !DILocation(line: 358, column: 1, scope: !610)
!956 = distinct !DISubprogram(name: "yettobeunpacked", scope: !162, file: !162, line: 246, type: !957, isLocal: true, isDefinition: true, scopeLine: 247, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !167)
!957 = !DISubroutineType(types: !958)
!958 = !{!192, !204, !153}
!959 = !DILocalVariable(name: "pkg", arg: 1, scope: !956, file: !162, line: 246, type: !204)
!960 = !DILocation(line: 246, column: 33, scope: !956)
!961 = !DILocalVariable(name: "thissect", arg: 2, scope: !956, file: !162, line: 246, type: !153)
!962 = !DILocation(line: 246, column: 51, scope: !956)
!963 = !DILocation(line: 248, column: 7, scope: !964)
!964 = distinct !DILexicalBlock(scope: !956, file: !162, line: 248, column: 7)
!965 = !DILocation(line: 248, column: 12, scope: !964)
!966 = !DILocation(line: 248, column: 17, scope: !964)
!967 = !DILocation(line: 248, column: 7, scope: !956)
!968 = !DILocation(line: 249, column: 5, scope: !964)
!969 = !DILocation(line: 251, column: 11, scope: !956)
!970 = !DILocation(line: 251, column: 16, scope: !956)
!971 = !DILocation(line: 251, column: 3, scope: !956)
!972 = !DILocation(line: 257, column: 5, scope: !973)
!973 = distinct !DILexicalBlock(scope: !956, file: !162, line: 251, column: 24)
!974 = !DILocation(line: 261, column: 9, scope: !975)
!975 = distinct !DILexicalBlock(scope: !973, file: !162, line: 261, column: 9)
!976 = !DILocation(line: 261, column: 9, scope: !973)
!977 = !DILocation(line: 262, column: 30, scope: !975)
!978 = !DILocation(line: 262, column: 35, scope: !975)
!979 = !DILocation(line: 262, column: 19, scope: !975)
!980 = !DILocation(line: 262, column: 46, scope: !981)
!981 = !DILexicalBlockFile(scope: !975, file: !162, discriminator: 1)
!982 = !DILocation(line: 262, column: 51, scope: !981)
!983 = !DILocation(line: 262, column: 19, scope: !981)
!984 = !DILocation(line: 263, column: 45, scope: !975)
!985 = !DILocation(line: 262, column: 19, scope: !986)
!986 = !DILexicalBlockFile(scope: !975, file: !162, discriminator: 2)
!987 = !DILocation(line: 262, column: 19, scope: !988)
!988 = !DILexicalBlockFile(scope: !975, file: !162, discriminator: 3)
!989 = !DILocation(line: 262, column: 8, scope: !988)
!990 = !DILocation(line: 262, column: 17, scope: !988)
!991 = !DILocation(line: 262, column: 7, scope: !988)
!992 = !DILocation(line: 264, column: 5, scope: !973)
!993 = !DILocation(line: 266, column: 77, scope: !973)
!994 = !DILocation(line: 266, column: 82, scope: !973)
!995 = !DILocation(line: 266, column: 5, scope: !973)
!996 = !DILocation(line: 269, column: 1, scope: !956)
!997 = distinct !DISubprogram(name: "assertpredep", scope: !162, file: !162, line: 395, type: !163, isLocal: false, isDefinition: true, scopeLine: 396, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !167)
!998 = !DILocalVariable(name: "argv", arg: 1, scope: !997, file: !162, line: 395, type: !165)
!999 = !DILocation(line: 395, column: 33, scope: !997)
!1000 = !DILocalVariable(name: "version", scope: !997, file: !162, line: 397, type: !243)
!1001 = !DILocation(line: 397, column: 23, scope: !997)
!1002 = !DILocation(line: 399, column: 33, scope: !997)
!1003 = !DILocation(line: 399, column: 49, scope: !997)
!1004 = !DILocation(line: 399, column: 10, scope: !1005)
!1005 = !DILexicalBlockFile(scope: !997, file: !162, discriminator: 1)
!1006 = !DILocation(line: 399, column: 3, scope: !997)
!1007 = distinct !DISubprogram(name: "assert_version_support", scope: !162, file: !162, line: 361, type: !1008, isLocal: true, isDefinition: true, scopeLine: 364, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !167)
!1008 = !DISubroutineType(types: !1009)
!1009 = !{!158, !165, !1010, !154}
!1010 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !243, size: 64, align: 64)
!1011 = !DILocalVariable(name: "argv", arg: 1, scope: !1007, file: !162, line: 361, type: !165)
!1012 = !DILocation(line: 361, column: 43, scope: !1007)
!1013 = !DILocalVariable(name: "version", arg: 2, scope: !1007, file: !162, line: 362, type: !1010)
!1014 = !DILocation(line: 362, column: 45, scope: !1007)
!1015 = !DILocalVariable(name: "feature_name", arg: 3, scope: !1007, file: !162, line: 363, type: !154)
!1016 = !DILocation(line: 363, column: 36, scope: !1007)
!1017 = !DILocalVariable(name: "pkg", scope: !1007, file: !162, line: 365, type: !204)
!1018 = !DILocation(line: 365, column: 19, scope: !1007)
!1019 = !DILocation(line: 367, column: 8, scope: !1020)
!1020 = distinct !DILexicalBlock(scope: !1007, file: !162, line: 367, column: 7)
!1021 = !DILocation(line: 367, column: 7, scope: !1020)
!1022 = !DILocation(line: 367, column: 7, scope: !1007)
!1023 = !DILocation(line: 368, column: 14, scope: !1020)
!1024 = !DILocation(line: 368, column: 50, scope: !1020)
!1025 = !DILocation(line: 368, column: 61, scope: !1020)
!1026 = !DILocation(line: 368, column: 5, scope: !1027)
!1027 = !DILexicalBlockFile(scope: !1020, file: !162, discriminator: 1)
!1028 = !DILocation(line: 368, column: 5, scope: !1020)
!1029 = !DILocation(line: 370, column: 3, scope: !1007)
!1030 = !DILocation(line: 372, column: 9, scope: !1007)
!1031 = !DILocation(line: 372, column: 7, scope: !1007)
!1032 = !DILocation(line: 373, column: 11, scope: !1007)
!1033 = !DILocation(line: 373, column: 16, scope: !1007)
!1034 = !DILocation(line: 373, column: 3, scope: !1007)
!1035 = !DILocation(line: 376, column: 5, scope: !1036)
!1036 = distinct !DILexicalBlock(scope: !1007, file: !162, line: 373, column: 24)
!1037 = !DILocation(line: 381, column: 30, scope: !1038)
!1038 = distinct !DILexicalBlock(scope: !1036, file: !162, line: 381, column: 9)
!1039 = !DILocation(line: 381, column: 35, scope: !1038)
!1040 = !DILocation(line: 381, column: 68, scope: !1038)
!1041 = !DILocation(line: 381, column: 9, scope: !1038)
!1042 = !DILocation(line: 381, column: 9, scope: !1036)
!1043 = !DILocation(line: 382, column: 7, scope: !1038)
!1044 = !DILocation(line: 383, column: 12, scope: !1036)
!1045 = !DILocation(line: 385, column: 12, scope: !1036)
!1046 = !DILocation(line: 383, column: 5, scope: !1047)
!1047 = !DILexicalBlockFile(scope: !1036, file: !162, discriminator: 1)
!1048 = !DILocation(line: 386, column: 5, scope: !1036)
!1049 = !DILocation(line: 388, column: 12, scope: !1036)
!1050 = !DILocation(line: 389, column: 12, scope: !1036)
!1051 = !DILocation(line: 388, column: 5, scope: !1047)
!1052 = !DILocation(line: 390, column: 5, scope: !1036)
!1053 = !DILocation(line: 392, column: 1, scope: !1007)
!1054 = distinct !DISubprogram(name: "assertepoch", scope: !162, file: !162, line: 403, type: !163, isLocal: false, isDefinition: true, scopeLine: 404, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !167)
!1055 = !DILocalVariable(name: "argv", arg: 1, scope: !1054, file: !162, line: 403, type: !165)
!1056 = !DILocation(line: 403, column: 32, scope: !1054)
!1057 = !DILocalVariable(name: "version", scope: !1054, file: !162, line: 405, type: !243)
!1058 = !DILocation(line: 405, column: 23, scope: !1054)
!1059 = !DILocation(line: 407, column: 33, scope: !1054)
!1060 = !DILocation(line: 407, column: 49, scope: !1054)
!1061 = !DILocation(line: 407, column: 10, scope: !1062)
!1062 = !DILexicalBlockFile(scope: !1054, file: !162, discriminator: 1)
!1063 = !DILocation(line: 407, column: 3, scope: !1054)
!1064 = distinct !DISubprogram(name: "assertlongfilenames", scope: !162, file: !162, line: 411, type: !163, isLocal: false, isDefinition: true, scopeLine: 412, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !167)
!1065 = !DILocalVariable(name: "argv", arg: 1, scope: !1064, file: !162, line: 411, type: !165)
!1066 = !DILocation(line: 411, column: 40, scope: !1064)
!1067 = !DILocalVariable(name: "version", scope: !1064, file: !162, line: 413, type: !243)
!1068 = !DILocation(line: 413, column: 23, scope: !1064)
!1069 = !DILocation(line: 415, column: 33, scope: !1064)
!1070 = !DILocation(line: 415, column: 49, scope: !1064)
!1071 = !DILocation(line: 415, column: 10, scope: !1072)
!1072 = !DILexicalBlockFile(scope: !1064, file: !162, discriminator: 1)
!1073 = !DILocation(line: 415, column: 3, scope: !1064)
!1074 = distinct !DISubprogram(name: "assertmulticonrep", scope: !162, file: !162, line: 419, type: !163, isLocal: false, isDefinition: true, scopeLine: 420, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !167)
!1075 = !DILocalVariable(name: "argv", arg: 1, scope: !1074, file: !162, line: 419, type: !165)
!1076 = !DILocation(line: 419, column: 38, scope: !1074)
!1077 = !DILocalVariable(name: "version", scope: !1074, file: !162, line: 421, type: !243)
!1078 = !DILocation(line: 421, column: 23, scope: !1074)
!1079 = !DILocation(line: 423, column: 33, scope: !1074)
!1080 = !DILocation(line: 424, column: 33, scope: !1074)
!1081 = !DILocation(line: 423, column: 10, scope: !1074)
!1082 = !DILocation(line: 423, column: 3, scope: !1074)
!1083 = distinct !DISubprogram(name: "assertmultiarch", scope: !162, file: !162, line: 428, type: !163, isLocal: false, isDefinition: true, scopeLine: 429, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !167)
!1084 = !DILocalVariable(name: "argv", arg: 1, scope: !1083, file: !162, line: 428, type: !165)
!1085 = !DILocation(line: 428, column: 36, scope: !1083)
!1086 = !DILocalVariable(name: "version", scope: !1083, file: !162, line: 430, type: !243)
!1087 = !DILocation(line: 430, column: 23, scope: !1083)
!1088 = !DILocation(line: 432, column: 33, scope: !1083)
!1089 = !DILocation(line: 432, column: 49, scope: !1083)
!1090 = !DILocation(line: 432, column: 10, scope: !1091)
!1091 = !DILexicalBlockFile(scope: !1083, file: !162, discriminator: 1)
!1092 = !DILocation(line: 432, column: 3, scope: !1083)
!1093 = distinct !DISubprogram(name: "assertverprovides", scope: !162, file: !162, line: 436, type: !163, isLocal: false, isDefinition: true, scopeLine: 437, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !167)
!1094 = !DILocalVariable(name: "argv", arg: 1, scope: !1093, file: !162, line: 436, type: !165)
!1095 = !DILocation(line: 436, column: 38, scope: !1093)
!1096 = !DILocalVariable(name: "version", scope: !1093, file: !162, line: 438, type: !243)
!1097 = !DILocation(line: 438, column: 23, scope: !1093)
!1098 = !DILocation(line: 440, column: 33, scope: !1093)
!1099 = !DILocation(line: 440, column: 49, scope: !1093)
!1100 = !DILocation(line: 440, column: 10, scope: !1101)
!1101 = !DILexicalBlockFile(scope: !1093, file: !162, discriminator: 1)
!1102 = !DILocation(line: 440, column: 3, scope: !1093)
!1103 = !DILocalVariable(name: "argv", arg: 1, scope: !161, file: !162, line: 457, type: !165)
!1104 = !DILocation(line: 457, column: 34, scope: !161)
!1105 = !DILocalVariable(name: "iter", scope: !161, file: !162, line: 461, type: !631)
!1106 = !DILocation(line: 461, column: 25, scope: !161)
!1107 = !DILocalVariable(name: "pkg", scope: !161, file: !162, line: 462, type: !204)
!1108 = !DILocation(line: 462, column: 19, scope: !161)
!1109 = !DILocalVariable(name: "startpkg", scope: !161, file: !162, line: 462, type: !204)
!1110 = !DILocation(line: 462, column: 31, scope: !161)
!1111 = !DILocalVariable(name: "trypkg", scope: !161, file: !162, line: 462, type: !204)
!1112 = !DILocation(line: 462, column: 42, scope: !161)
!1113 = !DILocalVariable(name: "dep", scope: !161, file: !162, line: 463, type: !222)
!1114 = !DILocation(line: 463, column: 22, scope: !161)
!1115 = !DILocalVariable(name: "possi", scope: !161, file: !162, line: 464, type: !218)
!1116 = !DILocation(line: 464, column: 20, scope: !161)
!1117 = !DILocalVariable(name: "provider", scope: !161, file: !162, line: 464, type: !218)
!1118 = !DILocation(line: 464, column: 28, scope: !161)
!1119 = !DILocation(line: 466, column: 8, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !161, file: !162, line: 466, column: 7)
!1121 = !DILocation(line: 466, column: 7, scope: !1120)
!1122 = !DILocation(line: 466, column: 7, scope: !161)
!1123 = !DILocation(line: 467, column: 14, scope: !1120)
!1124 = !DILocation(line: 467, column: 50, scope: !1120)
!1125 = !DILocation(line: 467, column: 61, scope: !1120)
!1126 = !DILocation(line: 467, column: 5, scope: !1127)
!1127 = !DILexicalBlockFile(scope: !1120, file: !162, discriminator: 1)
!1128 = !DILocation(line: 467, column: 5, scope: !1120)
!1129 = !DILocation(line: 469, column: 3, scope: !161)
!1130 = !DILocation(line: 471, column: 3, scope: !161)
!1131 = !DILocation(line: 473, column: 7, scope: !161)
!1132 = !DILocation(line: 474, column: 10, scope: !161)
!1133 = !DILocation(line: 474, column: 8, scope: !161)
!1134 = !DILocation(line: 475, column: 3, scope: !161)
!1135 = !DILocation(line: 475, column: 11, scope: !1136)
!1136 = !DILexicalBlockFile(scope: !161, file: !162, discriminator: 1)
!1137 = !DILocation(line: 475, column: 15, scope: !1136)
!1138 = !DILocation(line: 475, column: 48, scope: !1139)
!1139 = !DILexicalBlockFile(scope: !161, file: !162, discriminator: 2)
!1140 = !DILocation(line: 475, column: 25, scope: !1139)
!1141 = !DILocation(line: 475, column: 23, scope: !1139)
!1142 = !DILocation(line: 475, column: 15, scope: !1139)
!1143 = !DILocation(line: 475, column: 3, scope: !1144)
!1144 = !DILexicalBlockFile(scope: !161, file: !162, discriminator: 3)
!1145 = !DILocation(line: 477, column: 9, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1147, file: !162, line: 477, column: 9)
!1147 = distinct !DILexicalBlock(scope: !161, file: !162, line: 475, column: 56)
!1148 = !DILocation(line: 477, column: 14, scope: !1146)
!1149 = !DILocation(line: 477, column: 19, scope: !1146)
!1150 = !DILocation(line: 477, column: 9, scope: !1147)
!1151 = !DILocation(line: 478, column: 7, scope: !1146)
!1152 = distinct !{!1152, !1134}
!1153 = !DILocation(line: 480, column: 10, scope: !1154)
!1154 = distinct !DILexicalBlock(scope: !1147, file: !162, line: 480, column: 9)
!1155 = !DILocation(line: 480, column: 15, scope: !1154)
!1156 = !DILocation(line: 480, column: 9, scope: !1147)
!1157 = !DILocation(line: 481, column: 7, scope: !1154)
!1158 = !DILocation(line: 482, column: 5, scope: !1147)
!1159 = !DILocation(line: 482, column: 10, scope: !1147)
!1160 = !DILocation(line: 482, column: 22, scope: !1147)
!1161 = !DILocation(line: 482, column: 29, scope: !1147)
!1162 = !DILocation(line: 483, column: 15, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1147, file: !162, line: 483, column: 5)
!1164 = !DILocation(line: 483, column: 20, scope: !1163)
!1165 = !DILocation(line: 483, column: 30, scope: !1163)
!1166 = !DILocation(line: 483, column: 13, scope: !1163)
!1167 = !DILocation(line: 483, column: 10, scope: !1163)
!1168 = !DILocation(line: 483, column: 39, scope: !1169)
!1169 = !DILexicalBlockFile(scope: !1170, file: !162, discriminator: 1)
!1170 = distinct !DILexicalBlock(scope: !1163, file: !162, line: 483, column: 5)
!1171 = !DILocation(line: 483, column: 5, scope: !1169)
!1172 = !DILocation(line: 484, column: 11, scope: !1173)
!1173 = distinct !DILexicalBlock(scope: !1174, file: !162, line: 484, column: 11)
!1174 = distinct !DILexicalBlock(scope: !1170, file: !162, line: 483, column: 60)
!1175 = !DILocation(line: 484, column: 16, scope: !1173)
!1176 = !DILocation(line: 484, column: 21, scope: !1173)
!1177 = !DILocation(line: 484, column: 11, scope: !1174)
!1178 = !DILocation(line: 484, column: 40, scope: !1179)
!1179 = !DILexicalBlockFile(scope: !1173, file: !162, discriminator: 1)
!1180 = !DILocation(line: 485, column: 19, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1174, file: !162, line: 485, column: 11)
!1182 = !DILocation(line: 485, column: 11, scope: !1181)
!1183 = !DILocation(line: 485, column: 11, scope: !1174)
!1184 = !DILocation(line: 486, column: 9, scope: !1181)
!1185 = !DILocation(line: 488, column: 7, scope: !1174)
!1186 = !DILocation(line: 483, column: 49, scope: !1187)
!1187 = !DILexicalBlockFile(scope: !1170, file: !162, discriminator: 2)
!1188 = !DILocation(line: 483, column: 54, scope: !1187)
!1189 = !DILocation(line: 483, column: 47, scope: !1187)
!1190 = !DILocation(line: 483, column: 5, scope: !1187)
!1191 = distinct !{!1191, !1192}
!1192 = !DILocation(line: 483, column: 5, scope: !1147)
!1193 = !DILocation(line: 490, column: 5, scope: !1147)
!1194 = !DILocation(line: 490, column: 10, scope: !1147)
!1195 = !DILocation(line: 490, column: 22, scope: !1147)
!1196 = !DILocation(line: 490, column: 29, scope: !1147)
!1197 = !DILocation(line: 475, column: 3, scope: !1198)
!1198 = !DILexicalBlockFile(scope: !161, file: !162, discriminator: 4)
!1199 = !DILocation(line: 493, column: 22, scope: !161)
!1200 = !DILocation(line: 493, column: 3, scope: !161)
!1201 = !DILocation(line: 495, column: 8, scope: !1202)
!1202 = distinct !DILexicalBlock(scope: !161, file: !162, line: 495, column: 7)
!1203 = !DILocation(line: 495, column: 7, scope: !161)
!1204 = !DILocation(line: 496, column: 5, scope: !1202)
!1205 = !DILocation(line: 497, column: 7, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !161, file: !162, line: 497, column: 7)
!1207 = !DILocation(line: 497, column: 11, scope: !1206)
!1208 = !DILocation(line: 497, column: 7, scope: !161)
!1209 = !DILocation(line: 498, column: 5, scope: !1206)
!1210 = !DILocation(line: 500, column: 13, scope: !161)
!1211 = !DILocation(line: 500, column: 11, scope: !161)
!1212 = !DILocation(line: 501, column: 3, scope: !161)
!1213 = !DILocation(line: 501, column: 8, scope: !161)
!1214 = !DILocation(line: 501, column: 20, scope: !161)
!1215 = !DILocation(line: 501, column: 27, scope: !161)
!1216 = !DILocation(line: 506, column: 3, scope: !161)
!1217 = distinct !{!1217, !1216}
!1218 = !DILocation(line: 508, column: 18, scope: !1219)
!1219 = distinct !DILexicalBlock(scope: !1220, file: !162, line: 508, column: 5)
!1220 = distinct !DILexicalBlock(scope: !161, file: !162, line: 506, column: 6)
!1221 = !DILocation(line: 508, column: 23, scope: !1219)
!1222 = !DILocation(line: 508, column: 16, scope: !1219)
!1223 = !DILocation(line: 508, column: 33, scope: !1219)
!1224 = !DILocation(line: 508, column: 10, scope: !1219)
!1225 = !DILocation(line: 509, column: 11, scope: !1226)
!1226 = distinct !DILexicalBlock(scope: !1219, file: !162, line: 508, column: 5)
!1227 = !DILocation(line: 509, column: 15, scope: !1226)
!1228 = !DILocation(line: 509, column: 18, scope: !1229)
!1229 = !DILexicalBlockFile(scope: !1226, file: !162, discriminator: 1)
!1230 = !DILocation(line: 509, column: 15, scope: !1229)
!1231 = !DILocation(line: 508, column: 5, scope: !1232)
!1232 = !DILexicalBlockFile(scope: !1219, file: !162, discriminator: 1)
!1233 = !DILocalVariable(name: "possi_iter", scope: !1234, file: !162, line: 511, type: !1235)
!1234 = distinct !DILexicalBlock(scope: !1226, file: !162, line: 510, column: 29)
!1235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1236, size: 64, align: 64)
!1236 = !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi_pkg_iterator", file: !74, line: 346, flags: DIFlagFwdDecl)
!1237 = !DILocation(line: 511, column: 37, scope: !1234)
!1238 = !DILocation(line: 513, column: 42, scope: !1234)
!1239 = !DILocation(line: 513, column: 20, scope: !1234)
!1240 = !DILocation(line: 513, column: 18, scope: !1234)
!1241 = !DILocation(line: 514, column: 7, scope: !1234)
!1242 = !DILocation(line: 514, column: 15, scope: !1243)
!1243 = !DILexicalBlockFile(scope: !1234, file: !162, discriminator: 1)
!1244 = !DILocation(line: 514, column: 19, scope: !1243)
!1245 = !DILocation(line: 514, column: 55, scope: !1246)
!1246 = !DILexicalBlockFile(scope: !1234, file: !162, discriminator: 2)
!1247 = !DILocation(line: 514, column: 32, scope: !1246)
!1248 = !DILocation(line: 514, column: 30, scope: !1246)
!1249 = !DILocation(line: 514, column: 19, scope: !1246)
!1250 = !DILocation(line: 514, column: 7, scope: !1251)
!1251 = !DILexicalBlockFile(scope: !1234, file: !162, discriminator: 3)
!1252 = !DILocation(line: 515, column: 13, scope: !1253)
!1253 = distinct !DILexicalBlock(scope: !1254, file: !162, line: 515, column: 13)
!1254 = distinct !DILexicalBlock(scope: !1234, file: !162, line: 514, column: 69)
!1255 = !DILocation(line: 515, column: 21, scope: !1253)
!1256 = !DILocation(line: 515, column: 30, scope: !1253)
!1257 = !DILocation(line: 516, column: 13, scope: !1253)
!1258 = !DILocation(line: 516, column: 21, scope: !1253)
!1259 = !DILocation(line: 516, column: 33, scope: !1253)
!1260 = !DILocation(line: 516, column: 40, scope: !1253)
!1261 = !DILocation(line: 516, column: 61, scope: !1253)
!1262 = !DILocation(line: 517, column: 31, scope: !1253)
!1263 = !DILocation(line: 517, column: 39, scope: !1253)
!1264 = !DILocation(line: 517, column: 50, scope: !1253)
!1265 = !DILocation(line: 517, column: 13, scope: !1253)
!1266 = !DILocation(line: 515, column: 13, scope: !1267)
!1267 = !DILexicalBlockFile(scope: !1254, file: !162, discriminator: 1)
!1268 = !DILocation(line: 518, column: 17, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1253, file: !162, line: 517, column: 58)
!1270 = !DILocation(line: 518, column: 15, scope: !1269)
!1271 = !DILocation(line: 519, column: 11, scope: !1269)
!1272 = !DILocation(line: 521, column: 25, scope: !1273)
!1273 = distinct !DILexicalBlock(scope: !1254, file: !162, line: 521, column: 9)
!1274 = !DILocation(line: 521, column: 32, scope: !1273)
!1275 = !DILocation(line: 521, column: 36, scope: !1273)
!1276 = !DILocation(line: 521, column: 45, scope: !1273)
!1277 = !DILocation(line: 521, column: 23, scope: !1273)
!1278 = !DILocation(line: 521, column: 14, scope: !1273)
!1279 = !DILocation(line: 522, column: 15, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1273, file: !162, line: 521, column: 9)
!1281 = !DILocation(line: 522, column: 19, scope: !1280)
!1282 = !DILocation(line: 522, column: 22, scope: !1283)
!1283 = !DILexicalBlockFile(scope: !1280, file: !162, discriminator: 1)
!1284 = !DILocation(line: 522, column: 19, scope: !1283)
!1285 = !DILocation(line: 521, column: 9, scope: !1286)
!1286 = !DILexicalBlockFile(scope: !1273, file: !162, discriminator: 1)
!1287 = !DILocation(line: 524, column: 15, scope: !1288)
!1288 = distinct !DILexicalBlock(scope: !1289, file: !162, line: 524, column: 15)
!1289 = distinct !DILexicalBlock(scope: !1280, file: !162, line: 523, column: 41)
!1290 = !DILocation(line: 524, column: 25, scope: !1288)
!1291 = !DILocation(line: 524, column: 29, scope: !1288)
!1292 = !DILocation(line: 524, column: 34, scope: !1288)
!1293 = !DILocation(line: 524, column: 15, scope: !1289)
!1294 = !DILocation(line: 525, column: 13, scope: !1288)
!1295 = !DILocation(line: 526, column: 47, scope: !1296)
!1296 = distinct !DILexicalBlock(scope: !1289, file: !162, line: 526, column: 15)
!1297 = !DILocation(line: 526, column: 54, scope: !1296)
!1298 = !DILocation(line: 526, column: 16, scope: !1296)
!1299 = !DILocation(line: 526, column: 15, scope: !1289)
!1300 = !DILocation(line: 527, column: 13, scope: !1296)
!1301 = !DILocation(line: 528, column: 20, scope: !1289)
!1302 = !DILocation(line: 528, column: 30, scope: !1289)
!1303 = !DILocation(line: 528, column: 34, scope: !1289)
!1304 = !DILocation(line: 528, column: 18, scope: !1289)
!1305 = !DILocation(line: 529, column: 16, scope: !1306)
!1306 = distinct !DILexicalBlock(scope: !1289, file: !162, line: 529, column: 15)
!1307 = !DILocation(line: 529, column: 24, scope: !1306)
!1308 = !DILocation(line: 529, column: 15, scope: !1289)
!1309 = !DILocation(line: 530, column: 13, scope: !1306)
!1310 = !DILocation(line: 531, column: 15, scope: !1311)
!1311 = distinct !DILexicalBlock(scope: !1289, file: !162, line: 531, column: 15)
!1312 = !DILocation(line: 531, column: 23, scope: !1311)
!1313 = !DILocation(line: 531, column: 35, scope: !1311)
!1314 = !DILocation(line: 531, column: 42, scope: !1311)
!1315 = !DILocation(line: 531, column: 15, scope: !1289)
!1316 = !DILocation(line: 532, column: 19, scope: !1317)
!1317 = distinct !DILexicalBlock(scope: !1311, file: !162, line: 531, column: 64)
!1318 = !DILocation(line: 532, column: 17, scope: !1317)
!1319 = !DILocation(line: 533, column: 13, scope: !1317)
!1320 = !DILocation(line: 535, column: 9, scope: !1289)
!1321 = !DILocation(line: 523, column: 25, scope: !1280)
!1322 = !DILocation(line: 523, column: 35, scope: !1280)
!1323 = !DILocation(line: 523, column: 23, scope: !1280)
!1324 = !DILocation(line: 521, column: 9, scope: !1325)
!1325 = !DILexicalBlockFile(scope: !1280, file: !162, discriminator: 2)
!1326 = distinct !{!1326, !1327}
!1327 = !DILocation(line: 521, column: 9, scope: !1254)
!1328 = !DILocation(line: 514, column: 7, scope: !1329)
!1329 = !DILexicalBlockFile(scope: !1234, file: !162, discriminator: 4)
!1330 = distinct !{!1330, !1241}
!1331 = !DILocation(line: 537, column: 30, scope: !1234)
!1332 = !DILocation(line: 537, column: 7, scope: !1234)
!1333 = !DILocation(line: 538, column: 5, scope: !1234)
!1334 = !DILocation(line: 510, column: 16, scope: !1226)
!1335 = !DILocation(line: 510, column: 23, scope: !1226)
!1336 = !DILocation(line: 510, column: 15, scope: !1226)
!1337 = !DILocation(line: 508, column: 5, scope: !1338)
!1338 = !DILexicalBlockFile(scope: !1226, file: !162, discriminator: 2)
!1339 = distinct !{!1339, !1340}
!1340 = !DILocation(line: 508, column: 5, scope: !1220)
!1341 = !DILocation(line: 539, column: 10, scope: !1342)
!1342 = distinct !DILexicalBlock(scope: !1220, file: !162, line: 539, column: 9)
!1343 = !DILocation(line: 539, column: 9, scope: !1220)
!1344 = !DILocation(line: 540, column: 7, scope: !1345)
!1345 = distinct !DILexicalBlock(scope: !1342, file: !162, line: 539, column: 15)
!1346 = !DILocation(line: 541, column: 26, scope: !1345)
!1347 = !DILocation(line: 541, column: 7, scope: !1345)
!1348 = !DILocation(line: 542, column: 7, scope: !1345)
!1349 = !DILocation(line: 543, column: 14, scope: !1345)
!1350 = !DILocation(line: 543, column: 76, scope: !1345)
!1351 = !DILocation(line: 543, column: 7, scope: !1352)
!1352 = !DILexicalBlockFile(scope: !1345, file: !162, discriminator: 1)
!1353 = !DILocation(line: 544, column: 14, scope: !1345)
!1354 = !DILocation(line: 545, column: 26, scope: !1345)
!1355 = !DILocation(line: 545, column: 31, scope: !1345)
!1356 = !DILocation(line: 545, column: 36, scope: !1345)
!1357 = !DILocation(line: 545, column: 41, scope: !1345)
!1358 = !DILocation(line: 545, column: 45, scope: !1345)
!1359 = !DILocation(line: 545, column: 14, scope: !1345)
!1360 = !DILocation(line: 546, column: 26, scope: !1345)
!1361 = !DILocation(line: 546, column: 37, scope: !1345)
!1362 = !DILocation(line: 546, column: 47, scope: !1345)
!1363 = !DILocation(line: 546, column: 14, scope: !1345)
!1364 = !DILocation(line: 544, column: 7, scope: !1352)
!1365 = !DILocation(line: 544, column: 7, scope: !1345)
!1366 = !DILocation(line: 548, column: 5, scope: !1220)
!1367 = !DILocation(line: 548, column: 10, scope: !1220)
!1368 = !DILocation(line: 548, column: 22, scope: !1220)
!1369 = !DILocation(line: 548, column: 29, scope: !1220)
!1370 = !DILocation(line: 549, column: 15, scope: !1371)
!1371 = distinct !DILexicalBlock(scope: !1220, file: !162, line: 549, column: 5)
!1372 = !DILocation(line: 549, column: 20, scope: !1371)
!1373 = !DILocation(line: 549, column: 30, scope: !1371)
!1374 = !DILocation(line: 549, column: 13, scope: !1371)
!1375 = !DILocation(line: 549, column: 10, scope: !1371)
!1376 = !DILocation(line: 549, column: 39, scope: !1377)
!1377 = !DILexicalBlockFile(scope: !1378, file: !162, discriminator: 1)
!1378 = distinct !DILexicalBlock(scope: !1371, file: !162, line: 549, column: 5)
!1379 = !DILocation(line: 549, column: 5, scope: !1377)
!1380 = !DILocation(line: 550, column: 11, scope: !1381)
!1381 = distinct !DILexicalBlock(scope: !1382, file: !162, line: 550, column: 11)
!1382 = distinct !DILexicalBlock(scope: !1378, file: !162, line: 549, column: 60)
!1383 = !DILocation(line: 550, column: 16, scope: !1381)
!1384 = !DILocation(line: 550, column: 21, scope: !1381)
!1385 = !DILocation(line: 550, column: 11, scope: !1382)
!1386 = !DILocation(line: 550, column: 40, scope: !1387)
!1387 = !DILexicalBlockFile(scope: !1381, file: !162, discriminator: 1)
!1388 = !DILocation(line: 551, column: 19, scope: !1389)
!1389 = distinct !DILexicalBlock(scope: !1382, file: !162, line: 551, column: 11)
!1390 = !DILocation(line: 551, column: 11, scope: !1389)
!1391 = !DILocation(line: 551, column: 11, scope: !1382)
!1392 = !DILocation(line: 552, column: 9, scope: !1389)
!1393 = !DILocation(line: 554, column: 7, scope: !1382)
!1394 = !DILocation(line: 549, column: 49, scope: !1395)
!1395 = !DILexicalBlockFile(scope: !1378, file: !162, discriminator: 2)
!1396 = !DILocation(line: 549, column: 54, scope: !1395)
!1397 = !DILocation(line: 549, column: 47, scope: !1395)
!1398 = !DILocation(line: 549, column: 5, scope: !1395)
!1399 = distinct !{!1399, !1400}
!1400 = !DILocation(line: 549, column: 5, scope: !1220)
!1401 = !DILocation(line: 556, column: 3, scope: !1220)
!1402 = !DILocation(line: 556, column: 12, scope: !1136)
!1403 = !DILocation(line: 556, column: 3, scope: !1136)
!1404 = !DILocation(line: 559, column: 14, scope: !161)
!1405 = !DILocation(line: 559, column: 22, scope: !161)
!1406 = !DILocation(line: 559, column: 52, scope: !161)
!1407 = !DILocation(line: 559, column: 58, scope: !161)
!1408 = !DILocation(line: 559, column: 63, scope: !161)
!1409 = !DILocation(line: 559, column: 3, scope: !1136)
!1410 = !DILocation(line: 561, column: 11, scope: !161)
!1411 = !DILocation(line: 561, column: 19, scope: !161)
!1412 = !DILocation(line: 561, column: 3, scope: !1136)
!1413 = !DILocation(line: 563, column: 3, scope: !161)
!1414 = !DILocation(line: 564, column: 1, scope: !161)
