; ModuleID = './[inter]src--select.o.i'
source_filename = "./[inter]src--select.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.cmdinfo = type { i8*, i8, i32, i32*, i8**, void (%struct.cmdinfo*, i8*)*, i32, i8*, i32 (i8**)* }
%struct.namevalue = type { i8*, i32, i32 }
%struct.pkg_array = type { i32, %struct.pkginfo** }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }
%struct.anon.1 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }

!76 = !DIEnumerator(name: "PKG_ISTOBE_NORMAL", value: 0)
!77 = !DIEnumerator(name: "PKG_ISTOBE_REMOVE", value: 1)
!78 = !DIEnumerator(name: "PKG_ISTOBE_INSTALLNEW", value: 2)
!79 = !DIEnumerator(name: "PKG_ISTOBE_DECONFIGURE", value: 3)
!80 = !DIEnumerator(name: "PKG_ISTOBE_PREINSTALL", value: 4)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_cycle_color", file: !74, line: 47, size: 32, align: 32, elements: !82)
!82 = !{!83, !84, !85}
!83 = !DIEnumerator(name: "PKG_CYCLE_WHITE", value: 0)
!84 = !DIEnumerator(name: "PKG_CYCLE_GRAY", value: 1)
!85 = !DIEnumerator(name: "PKG_CYCLE_BLACK", value: 2)
!86 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fsys_namenode_flags", file: !87, line: 61, size: 32, align: 32, elements: !88)
!87 = !DIFile(filename: "../lib/dpkg/fsys.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98}
!89 = !DIEnumerator(name: "FNNF_NEW_CONFF", value: 1)
!90 = !DIEnumerator(name: "FNNF_NEW_INARCHIVE", value: 2)
!91 = !DIEnumerator(name: "FNNF_OLD_CONFF", value: 4)
!92 = !DIEnumerator(name: "FNNF_OBS_CONFF", value: 8)
!93 = !DIEnumerator(name: "FNNF_ELIDE_OTHER_LISTS", value: 16)
!94 = !DIEnumerator(name: "FNNF_NO_ATOMIC_OVERWRITE", value: 32)
!95 = !DIEnumerator(name: "FNNF_PLACED_ON_DISK", value: 64)
!96 = !DIEnumerator(name: "FNNF_DEFERRED_FSYNC", value: 128)
!97 = !DIEnumerator(name: "FNNF_DEFERRED_RENAME", value: 256)
!98 = !DIEnumerator(name: "FNNF_FILTERED", value: 512)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "modstatdb_rw", file: !4, line: 263, size: 32, align: 32, elements: !100)
!100 = !{!101, !102, !103, !104, !105, !106, !107, !108}
!101 = !DIEnumerator(name: "msdbrw_readonly", value: 0)
!102 = !DIEnumerator(name: "msdbrw_needsuperuserlockonly", value: 1)
!103 = !DIEnumerator(name: "msdbrw_writeifposs", value: 2)
!104 = !DIEnumerator(name: "msdbrw_write", value: 3)
!105 = !DIEnumerator(name: "msdbrw_needsuperuser", value: 4)
!106 = !DIEnumerator(name: "msdbrw_available_readonly", value: 256)
!107 = !DIEnumerator(name: "msdbrw_available_write", value: 512)
!108 = !DIEnumerator(name: "msdbrw_available_mask", value: 65280)
!109 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_spec_flags", file: !110, line: 41, size: 32, align: 32, elements: !111)
!110 = !DIFile(filename: "../lib/dpkg/pkg-spec.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!111 = !{!112, !113, !114, !115}
!112 = !DIEnumerator(name: "PKG_SPEC_PATTERNS", value: 1)
!113 = !DIEnumerator(name: "PKG_SPEC_ARCH_SINGLE", value: 256)
!114 = !DIEnumerator(name: "PKG_SPEC_ARCH_WILDCARD", value: 512)
!115 = !DIEnumerator(name: "PKG_SPEC_ARCH_MASK", value: 65280)
!116 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_msg_type", file: !117, line: 36, size: 32, align: 32, elements: !118)
!117 = !DIFile(filename: "../lib/dpkg/error.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!118 = !{!119, !120, !121}
!119 = !DIEnumerator(name: "DPKG_MSG_NONE", value: 0)
!120 = !DIEnumerator(name: "DPKG_MSG_WARN", value: 1)
!121 = !DIEnumerator(name: "DPKG_MSG_ERROR", value: 2)
!122 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_name_arch_when", file: !4, line: 396, size: 32, align: 32, elements: !123)
!123 = !{!124, !125, !126, !127}
!124 = !DIEnumerator(name: "pnaw_never", value: 0)
!125 = !DIEnumerator(name: "pnaw_nonambig", value: 1)
!126 = !DIEnumerator(name: "pnaw_foreign", value: 2)
!127 = !DIEnumerator(name: "pnaw_always", value: 3)
!128 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_ctype_bit", file: !129, line: 32, size: 32, align: 32, elements: !130)
!129 = !DIFile(filename: "../lib/dpkg/c-ctype.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!130 = !{!131, !132, !133, !134, !135, !136, !137, !138}
!131 = !DIEnumerator(name: "C_CTYPE_BLANK", value: 1)
!132 = !DIEnumerator(name: "C_CTYPE_WHITE", value: 2)
!133 = !DIEnumerator(name: "C_CTYPE_SPACE", value: 4)
!134 = !DIEnumerator(name: "C_CTYPE_UPPER", value: 8)
!135 = !DIEnumerator(name: "C_CTYPE_LOWER", value: 16)
!136 = !DIEnumerator(name: "C_CTYPE_DIGIT", value: 32)
!137 = !DIEnumerator(name: "C_CTYPE_ALPHA", value: 24)
!138 = !DIEnumerator(name: "C_CTYPE_ALNUM", value: 56)
!139 = !{!140}
!140 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!141 = !{i32 2, !"Dwarf Version", i32 4}
!142 = !{i32 2, !"Debug Info Version", i32 3}
!143 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!144 = distinct !DISubprogram(name: "getselections", scope: !145, file: !145, line: 61, type: !146, isLocal: false, isDefinition: true, scopeLine: 62, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !154)
!145 = !DIFile(filename: "select.c", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!146 = !DISubroutineType(types: !147)
!147 = !{!148, !149}
!148 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!149 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !150, size: 64, align: 64)
!150 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !151)
!151 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !153)
!153 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!154 = !{}
!155 = !DILocalVariable(name: "argv", arg: 1, scope: !144, file: !145, line: 61, type: !149)
!156 = !DIExpression()
!157 = !DILocation(line: 61, column: 34, scope: !144)
!158 = !DILocalVariable(name: "array", scope: !144, file: !145, line: 63, type: !159)
!159 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_array", file: !160, line: 38, size: 128, align: 64, elements: !161)
!160 = !DIFile(filename: "../lib/dpkg/pkg-array.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!161 = !{!162, !163}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "n_pkgs", scope: !159, file: !160, line: 39, baseType: !148, size: 32, align: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "pkgs", scope: !159, file: !160, line: 40, baseType: !164, size: 64, align: 64, offset: 64)
!164 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !166, size: 64, align: 64)
!166 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !167)
!167 = !{!168, !216, !217, !218, !219, !220, !221, !222, !223, !224, !254, !255, !271, !280, !296, !297, !303, !359, !363, !364}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !166, file: !4, line: 196, baseType: !169, size: 64, align: 64)
!169 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !170, size: 64, align: 64)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !171)
!171 = !{!172, !173, !174, !175, !215}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !170, file: !4, line: 243, baseType: !169, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !170, file: !4, line: 244, baseType: !151, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !170, file: !4, line: 245, baseType: !166, size: 3072, align: 64, offset: 128)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !170, file: !4, line: 249, baseType: !176, size: 128, align: 64, offset: 3200)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !170, file: !4, line: 246, size: 128, align: 64, elements: !177)
!177 = !{!178, !214}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !176, file: !4, line: 247, baseType: !179, size: 64, align: 64)
!179 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !180, size: 64, align: 64)
!180 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !181)
!181 = !{!182, !190, !191, !192, !193, !194, !203, !210, !211, !213}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !180, file: !4, line: 64, baseType: !183, size: 64, align: 64)
!183 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !184, size: 64, align: 64)
!184 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !185)
!185 = !{!186, !187, !188, !189}
!186 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !184, file: !4, line: 57, baseType: !165, size: 64, align: 64)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !184, file: !4, line: 58, baseType: !183, size: 64, align: 64, offset: 64)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !184, file: !4, line: 59, baseType: !179, size: 64, align: 64, offset: 128)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !184, file: !4, line: 60, baseType: !3, size: 32, align: 32, offset: 192)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !180, file: !4, line: 65, baseType: !169, size: 64, align: 64, offset: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !180, file: !4, line: 66, baseType: !179, size: 64, align: 64, offset: 128)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !180, file: !4, line: 66, baseType: !179, size: 64, align: 64, offset: 192)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !180, file: !4, line: 66, baseType: !179, size: 64, align: 64, offset: 256)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !180, file: !4, line: 67, baseType: !195, size: 64, align: 64, offset: 320)
!195 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !196, size: 64, align: 64)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !16, line: 48, size: 192, align: 64, elements: !198)
!198 = !{!199, !201, !202}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !197, file: !16, line: 49, baseType: !200, size: 64, align: 64)
!200 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !197, size: 64, align: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !197, file: !16, line: 50, baseType: !151, size: 64, align: 64, offset: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !197, file: !16, line: 51, baseType: !15, size: 32, align: 32, offset: 128)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !180, file: !4, line: 68, baseType: !204, size: 192, align: 64, offset: 384)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !27, line: 42, size: 192, align: 64, elements: !205)
!205 = !{!206, !208, !209}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !204, file: !27, line: 44, baseType: !207, size: 32, align: 32)
!207 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !204, file: !27, line: 46, baseType: !151, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !204, file: !27, line: 48, baseType: !151, size: 64, align: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !180, file: !4, line: 69, baseType: !26, size: 32, align: 32, offset: 576)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !180, file: !4, line: 70, baseType: !212, size: 8, align: 8, offset: 608)
!212 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !180, file: !4, line: 71, baseType: !212, size: 8, align: 8, offset: 616)
!214 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !176, file: !4, line: 248, baseType: !179, size: 64, align: 64, offset: 64)
!215 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !170, file: !4, line: 250, baseType: !148, size: 32, align: 32, offset: 3328)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !166, file: !4, line: 197, baseType: !165, size: 64, align: 64, offset: 64)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !166, file: !4, line: 199, baseType: !35, size: 32, align: 32, offset: 128)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !166, file: !4, line: 201, baseType: !43, size: 32, align: 32, offset: 160)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !166, file: !4, line: 202, baseType: !47, size: 32, align: 32, offset: 192)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !166, file: !4, line: 203, baseType: !57, size: 32, align: 32, offset: 224)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !166, file: !4, line: 204, baseType: !151, size: 64, align: 64, offset: 256)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !166, file: !4, line: 205, baseType: !151, size: 64, align: 64, offset: 320)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !166, file: !4, line: 206, baseType: !204, size: 192, align: 64, offset: 384)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !166, file: !4, line: 207, baseType: !225, size: 960, align: 64, offset: 576)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !226)
!226 = !{!227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !247}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !225, file: !4, line: 108, baseType: !183, size: 64, align: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !225, file: !4, line: 110, baseType: !212, size: 8, align: 8, offset: 64)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !225, file: !4, line: 111, baseType: !67, size: 32, align: 32, offset: 96)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !225, file: !4, line: 112, baseType: !195, size: 64, align: 64, offset: 128)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !225, file: !4, line: 115, baseType: !151, size: 64, align: 64, offset: 192)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !225, file: !4, line: 116, baseType: !151, size: 64, align: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !225, file: !4, line: 117, baseType: !151, size: 64, align: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !225, file: !4, line: 118, baseType: !151, size: 64, align: 64, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !225, file: !4, line: 119, baseType: !151, size: 64, align: 64, offset: 448)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !225, file: !4, line: 120, baseType: !151, size: 64, align: 64, offset: 512)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !225, file: !4, line: 121, baseType: !151, size: 64, align: 64, offset: 576)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !225, file: !4, line: 122, baseType: !204, size: 192, align: 64, offset: 640)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !225, file: !4, line: 123, baseType: !240, size: 64, align: 64, offset: 832)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64, align: 64)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !242)
!242 = !{!243, !244, !245, !246}
!243 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !241, file: !4, line: 81, baseType: !240, size: 64, align: 64)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !241, file: !4, line: 82, baseType: !151, size: 64, align: 64, offset: 64)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !241, file: !4, line: 83, baseType: !151, size: 64, align: 64, offset: 128)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !241, file: !4, line: 84, baseType: !212, size: 8, align: 8, offset: 192)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !225, file: !4, line: 124, baseType: !248, size: 64, align: 64, offset: 896)
!248 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !249, size: 64, align: 64)
!249 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !250)
!250 = !{!251, !252, !253}
!251 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !249, file: !4, line: 75, baseType: !248, size: 64, align: 64)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !249, file: !4, line: 76, baseType: !151, size: 64, align: 64, offset: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !249, file: !4, line: 77, baseType: !151, size: 64, align: 64, offset: 128)
!254 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !166, file: !4, line: 208, baseType: !225, size: 960, align: 64, offset: 1536)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !166, file: !4, line: 209, baseType: !256, size: 64, align: 64, offset: 2496)
!256 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !257, size: 64, align: 64)
!257 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !74, line: 53, size: 256, align: 64, elements: !258)
!258 = !{!259, !260, !261, !262, !263, !264}
!259 = !DIDerivedType(tag: DW_TAG_member, name: "istobe", scope: !257, file: !74, line: 54, baseType: !73, size: 32, align: 32)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !257, file: !74, line: 57, baseType: !81, size: 32, align: 32, offset: 32)
!261 = !DIDerivedType(tag: DW_TAG_member, name: "enqueued", scope: !257, file: !74, line: 59, baseType: !212, size: 8, align: 8, offset: 64)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "replacingfilesandsaid", scope: !257, file: !74, line: 61, baseType: !148, size: 32, align: 32, offset: 96)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "cmdline_seen", scope: !257, file: !74, line: 62, baseType: !148, size: 32, align: 32, offset: 128)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "trigprocdeferred", scope: !257, file: !74, line: 65, baseType: !265, size: 64, align: 64, offset: 192)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !266, size: 64, align: 64)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !267, line: 34, size: 128, align: 64, elements: !268)
!267 = !DIFile(filename: "../lib/dpkg/pkg-list.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!268 = !{!269, !270}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !266, file: !267, line: 35, baseType: !265, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !266, file: !267, line: 36, baseType: !165, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !166, file: !4, line: 211, baseType: !272, size: 64, align: 64, offset: 2560)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !273, size: 64, align: 64)
!273 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !274)
!274 = !{!275, !276, !277, !278, !279}
!275 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !273, file: !4, line: 88, baseType: !272, size: 64, align: 64)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !273, file: !4, line: 89, baseType: !151, size: 64, align: 64, offset: 64)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !273, file: !4, line: 90, baseType: !151, size: 64, align: 64, offset: 128)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !273, file: !4, line: 91, baseType: !151, size: 64, align: 64, offset: 192)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !273, file: !4, line: 92, baseType: !151, size: 64, align: 64, offset: 256)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !166, file: !4, line: 216, baseType: !281, size: 128, align: 64, offset: 2624)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !166, file: !4, line: 213, size: 128, align: 64, elements: !282)
!282 = !{!283, !295}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !281, file: !4, line: 215, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !286)
!286 = !{!287, !288, !289, !290}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !285, file: !4, line: 143, baseType: !165, size: 64, align: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !285, file: !4, line: 143, baseType: !165, size: 64, align: 64, offset: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !285, file: !4, line: 144, baseType: !284, size: 64, align: 64, offset: 128)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !285, file: !4, line: 147, baseType: !291, size: 128, align: 64, offset: 192)
!291 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !285, file: !4, line: 145, size: 128, align: 64, elements: !292)
!292 = !{!293, !294}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !291, file: !4, line: 146, baseType: !284, size: 64, align: 64)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !291, file: !4, line: 146, baseType: !284, size: 64, align: 64, offset: 64)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !281, file: !4, line: 215, baseType: !284, size: 64, align: 64, offset: 64)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !166, file: !4, line: 219, baseType: !284, size: 64, align: 64, offset: 2752)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !166, file: !4, line: 220, baseType: !298, size: 64, align: 64, offset: 2816)
!298 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !299, size: 64, align: 64)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !300)
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !299, file: !4, line: 135, baseType: !298, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !299, file: !4, line: 136, baseType: !151, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !166, file: !4, line: 231, baseType: !304, size: 64, align: 64, offset: 2880)
!304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !305, size: 64, align: 64)
!305 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !87, line: 122, size: 128, align: 64, elements: !306)
!306 = !{!307, !308}
!307 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !305, file: !87, line: 123, baseType: !304, size: 64, align: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "namenode", scope: !305, file: !87, line: 124, baseType: !309, size: 64, align: 64, offset: 64)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode", file: !87, line: 90, size: 640, align: 64, elements: !311)
!311 = !{!312, !313, !314, !315, !323, !342, !345, !346, !347, !348}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !87, line: 91, baseType: !309, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !310, file: !87, line: 92, baseType: !151, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "packages", scope: !310, file: !87, line: 93, baseType: !265, size: 64, align: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "divert", scope: !310, file: !87, line: 94, baseType: !316, size: 64, align: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !317, size: 64, align: 64)
!317 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_diversion", file: !87, line: 151, size: 256, align: 64, elements: !318)
!318 = !{!319, !320, !321, !322}
!319 = !DIDerivedType(tag: DW_TAG_member, name: "useinstead", scope: !317, file: !87, line: 152, baseType: !309, size: 64, align: 64)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "camefrom", scope: !317, file: !87, line: 153, baseType: !309, size: 64, align: 64, offset: 64)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pkgset", scope: !317, file: !87, line: 154, baseType: !169, size: 64, align: 64, offset: 128)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !317, file: !87, line: 157, baseType: !316, size: 64, align: 64, offset: 192)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "statoverride", scope: !310, file: !87, line: 101, baseType: !324, size: 64, align: 64, offset: 256)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !326, line: 40, size: 256, align: 64, elements: !327)
!326 = !DIFile(filename: "../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!327 = !{!328, !333, !336, !339, !341}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !325, file: !326, line: 41, baseType: !329, size: 32, align: 32)
!329 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !330, line: 80, baseType: !331)
!330 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!331 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !332, line: 125, baseType: !207)
!332 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!333 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !325, file: !326, line: 42, baseType: !334, size: 32, align: 32, offset: 32)
!334 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !330, line: 65, baseType: !335)
!335 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !332, line: 126, baseType: !207)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !325, file: !326, line: 43, baseType: !337, size: 32, align: 32, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !330, line: 70, baseType: !338)
!338 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !332, line: 129, baseType: !207)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !325, file: !326, line: 47, baseType: !340, size: 64, align: 64, offset: 128)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !325, file: !326, line: 48, baseType: !340, size: 64, align: 64, offset: 192)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "trig_interested", scope: !310, file: !87, line: 103, baseType: !343, size: 64, align: 64, offset: 320)
!343 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !344, size: 64, align: 64)
!344 = !DICompositeType(tag: DW_TAG_structure_type, name: "trigfileint", file: !87, line: 103, flags: DIFlagFwdDecl)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !310, file: !87, line: 111, baseType: !86, size: 32, align: 32, offset: 384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "oldhash", scope: !310, file: !87, line: 114, baseType: !151, size: 64, align: 64, offset: 448)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "newhash", scope: !310, file: !87, line: 117, baseType: !151, size: 64, align: 64, offset: 512)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "file_ondisk_id", scope: !310, file: !87, line: 119, baseType: !349, size: 64, align: 64, offset: 576)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_ondisk_id", file: !87, line: 85, size: 128, align: 64, elements: !351)
!351 = !{!352, !356}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "id_dev", scope: !350, file: !87, line: 86, baseType: !353, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !330, line: 60, baseType: !354)
!354 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !332, line: 124, baseType: !355)
!355 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "id_ino", scope: !350, file: !87, line: 87, baseType: !357, size: 64, align: 64, offset: 64)
!357 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !330, line: 48, baseType: !358)
!358 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !332, line: 127, baseType: !355)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !166, file: !4, line: 232, baseType: !360, size: 64, align: 64, offset: 2944)
!360 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !330, line: 86, baseType: !361)
!361 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !332, line: 131, baseType: !362)
!362 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !166, file: !4, line: 233, baseType: !212, size: 8, align: 8, offset: 3008)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !166, file: !4, line: 236, baseType: !212, size: 8, align: 8, offset: 3016)
!365 = !DILocation(line: 63, column: 20, scope: !144)
!366 = !DILocalVariable(name: "pkg", scope: !144, file: !145, line: 64, type: !165)
!367 = !DILocation(line: 64, column: 19, scope: !144)
!368 = !DILocalVariable(name: "thisarg", scope: !144, file: !145, line: 65, type: !151)
!369 = !DILocation(line: 65, column: 15, scope: !144)
!370 = !DILocalVariable(name: "i", scope: !144, file: !145, line: 66, type: !148)
!371 = !DILocation(line: 66, column: 7, scope: !144)
!372 = !DILocalVariable(name: "found", scope: !144, file: !145, line: 66, type: !148)
!373 = !DILocation(line: 66, column: 10, scope: !144)
!374 = !DILocation(line: 68, column: 3, scope: !144)
!375 = !DILocation(line: 70, column: 3, scope: !144)
!376 = !DILocation(line: 71, column: 3, scope: !144)
!377 = !DILocation(line: 73, column: 9, scope: !378)
!378 = distinct !DILexicalBlock(scope: !144, file: !145, line: 73, column: 7)
!379 = !DILocation(line: 73, column: 8, scope: !378)
!380 = !DILocation(line: 73, column: 7, scope: !144)
!381 = !DILocation(line: 74, column: 12, scope: !382)
!382 = distinct !DILexicalBlock(scope: !383, file: !145, line: 74, column: 5)
!383 = distinct !DILexicalBlock(scope: !378, file: !145, line: 73, column: 15)
!384 = !DILocation(line: 74, column: 10, scope: !382)
!385 = !DILocation(line: 74, column: 17, scope: !386)
!386 = !DILexicalBlockFile(scope: !387, file: !145, discriminator: 1)
!387 = distinct !DILexicalBlock(scope: !382, file: !145, line: 74, column: 5)
!388 = !DILocation(line: 74, column: 27, scope: !386)
!389 = !DILocation(line: 74, column: 19, scope: !386)
!390 = !DILocation(line: 74, column: 5, scope: !386)
!391 = !DILocation(line: 75, column: 24, scope: !392)
!392 = distinct !DILexicalBlock(scope: !387, file: !145, line: 74, column: 40)
!393 = !DILocation(line: 75, column: 13, scope: !392)
!394 = !DILocation(line: 75, column: 19, scope: !392)
!395 = !DILocation(line: 75, column: 11, scope: !392)
!396 = !DILocation(line: 76, column: 11, scope: !397)
!397 = distinct !DILexicalBlock(scope: !392, file: !145, line: 76, column: 11)
!398 = !DILocation(line: 76, column: 16, scope: !397)
!399 = !DILocation(line: 76, column: 23, scope: !397)
!400 = !DILocation(line: 76, column: 11, scope: !392)
!401 = !DILocation(line: 77, column: 9, scope: !397)
!402 = !DILocation(line: 78, column: 22, scope: !392)
!403 = !DILocation(line: 78, column: 7, scope: !392)
!404 = !DILocation(line: 79, column: 5, scope: !392)
!405 = !DILocation(line: 74, column: 36, scope: !406)
!406 = !DILexicalBlockFile(scope: !387, file: !145, discriminator: 2)
!407 = !DILocation(line: 74, column: 5, scope: !406)
!408 = distinct !{!408, !409}
!409 = !DILocation(line: 74, column: 5, scope: !383)
!410 = !DILocation(line: 80, column: 3, scope: !383)
!411 = !DILocation(line: 81, column: 5, scope: !412)
!412 = distinct !DILexicalBlock(scope: !378, file: !145, line: 80, column: 10)
!413 = !DILocation(line: 81, column: 27, scope: !414)
!414 = !DILexicalBlockFile(scope: !412, file: !145, discriminator: 1)
!415 = !DILocation(line: 81, column: 22, scope: !414)
!416 = !DILocation(line: 81, column: 20, scope: !414)
!417 = !DILocation(line: 81, column: 5, scope: !414)
!418 = !DILocalVariable(name: "pkgspec", scope: !419, file: !145, line: 82, type: !420)
!419 = distinct !DILexicalBlock(scope: !412, file: !145, line: 81, column: 32)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_spec", file: !110, line: 51, size: 320, align: 64, elements: !421)
!421 = !{!422, !423, !424, !425, !426, !427, !430}
!422 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !420, file: !110, line: 52, baseType: !340, size: 64, align: 64)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !420, file: !110, line: 53, baseType: !195, size: 64, align: 64, offset: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !420, file: !110, line: 55, baseType: !109, size: 32, align: 32, offset: 128)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "name_is_pattern", scope: !420, file: !110, line: 59, baseType: !212, size: 8, align: 8, offset: 160)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_pattern", scope: !420, file: !110, line: 60, baseType: !212, size: 8, align: 8, offset: 168)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_iter", scope: !420, file: !110, line: 63, baseType: !428, size: 64, align: 64, offset: 192)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !429, size: 64, align: 64)
!429 = !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_hash_iter", file: !4, line: 314, flags: DIFlagFwdDecl)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pkg_next", scope: !420, file: !110, line: 65, baseType: !165, size: 64, align: 64, offset: 256)
!431 = !DILocation(line: 82, column: 23, scope: !419)
!432 = !DILocation(line: 84, column: 12, scope: !419)
!433 = !DILocation(line: 85, column: 7, scope: !419)
!434 = !DILocation(line: 86, column: 32, scope: !419)
!435 = !DILocation(line: 86, column: 7, scope: !419)
!436 = !DILocation(line: 88, column: 14, scope: !437)
!437 = distinct !DILexicalBlock(scope: !419, file: !145, line: 88, column: 7)
!438 = !DILocation(line: 88, column: 12, scope: !437)
!439 = !DILocation(line: 88, column: 19, scope: !440)
!440 = !DILexicalBlockFile(scope: !441, file: !145, discriminator: 1)
!441 = distinct !DILexicalBlock(scope: !437, file: !145, line: 88, column: 7)
!442 = !DILocation(line: 88, column: 29, scope: !440)
!443 = !DILocation(line: 88, column: 21, scope: !440)
!444 = !DILocation(line: 88, column: 7, scope: !440)
!445 = !DILocation(line: 89, column: 26, scope: !446)
!446 = distinct !DILexicalBlock(scope: !441, file: !145, line: 88, column: 42)
!447 = !DILocation(line: 89, column: 15, scope: !446)
!448 = !DILocation(line: 89, column: 21, scope: !446)
!449 = !DILocation(line: 89, column: 13, scope: !446)
!450 = !DILocation(line: 90, column: 43, scope: !451)
!451 = distinct !DILexicalBlock(scope: !446, file: !145, line: 90, column: 13)
!452 = !DILocation(line: 90, column: 49, scope: !451)
!453 = !DILocation(line: 90, column: 54, scope: !451)
!454 = !DILocation(line: 90, column: 14, scope: !451)
!455 = !DILocation(line: 90, column: 13, scope: !446)
!456 = !DILocation(line: 91, column: 11, scope: !451)
!457 = !DILocation(line: 92, column: 24, scope: !446)
!458 = !DILocation(line: 92, column: 9, scope: !446)
!459 = !DILocation(line: 92, column: 35, scope: !446)
!460 = !DILocation(line: 93, column: 7, scope: !446)
!461 = !DILocation(line: 88, column: 38, scope: !462)
!462 = !DILexicalBlockFile(scope: !441, file: !145, discriminator: 2)
!463 = !DILocation(line: 88, column: 7, scope: !462)
!464 = distinct !{!464, !465}
!465 = !DILocation(line: 88, column: 7, scope: !419)
!466 = !DILocation(line: 94, column: 12, scope: !467)
!467 = distinct !DILexicalBlock(scope: !419, file: !145, line: 94, column: 11)
!468 = !DILocation(line: 94, column: 11, scope: !419)
!469 = !DILocation(line: 95, column: 16, scope: !467)
!470 = !DILocation(line: 95, column: 58, scope: !467)
!471 = !DILocation(line: 95, column: 9, scope: !472)
!472 = !DILexicalBlockFile(scope: !467, file: !145, discriminator: 1)
!473 = !DILocation(line: 95, column: 9, scope: !467)
!474 = !DILocation(line: 97, column: 7, scope: !419)
!475 = !DILocation(line: 81, column: 5, scope: !476)
!476 = !DILexicalBlockFile(scope: !412, file: !145, discriminator: 2)
!477 = distinct !{!477, !411}
!478 = !DILocation(line: 101, column: 11, scope: !144)
!479 = !DILocation(line: 101, column: 19, scope: !144)
!480 = !DILocation(line: 101, column: 3, scope: !481)
!481 = !DILexicalBlockFile(scope: !144, file: !145, discriminator: 1)
!482 = !DILocation(line: 102, column: 11, scope: !144)
!483 = !DILocation(line: 102, column: 19, scope: !144)
!484 = !DILocation(line: 102, column: 3, scope: !481)
!485 = !DILocation(line: 104, column: 3, scope: !144)
!486 = !DILocation(line: 106, column: 3, scope: !144)
!487 = !DILocation(line: 108, column: 3, scope: !144)
!488 = distinct !DISubprogram(name: "getsel1package", scope: !145, file: !145, line: 45, type: !489, isLocal: true, isDefinition: true, scopeLine: 45, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !154)
!489 = !DISubroutineType(types: !490)
!490 = !{null, !165}
!491 = !DILocalVariable(name: "pkg", arg: 1, scope: !488, file: !145, line: 45, type: !165)
!492 = !DILocation(line: 45, column: 44, scope: !488)
!493 = !DILocalVariable(name: "pkgname", scope: !488, file: !145, line: 46, type: !151)
!494 = !DILocation(line: 46, column: 15, scope: !488)
!495 = !DILocalVariable(name: "l", scope: !488, file: !145, line: 47, type: !148)
!496 = !DILocation(line: 47, column: 7, scope: !488)
!497 = !DILocation(line: 49, column: 7, scope: !498)
!498 = distinct !DILexicalBlock(scope: !488, file: !145, line: 49, column: 7)
!499 = !DILocation(line: 49, column: 12, scope: !498)
!500 = !DILocation(line: 49, column: 17, scope: !498)
!501 = !DILocation(line: 49, column: 7, scope: !488)
!502 = !DILocation(line: 50, column: 5, scope: !498)
!503 = !DILocation(line: 51, column: 22, scope: !488)
!504 = !DILocation(line: 51, column: 13, scope: !488)
!505 = !DILocation(line: 51, column: 11, scope: !488)
!506 = !DILocation(line: 52, column: 14, scope: !488)
!507 = !DILocation(line: 52, column: 7, scope: !488)
!508 = !DILocation(line: 52, column: 5, scope: !488)
!509 = !DILocation(line: 53, column: 5, scope: !488)
!510 = !DILocation(line: 54, column: 11, scope: !488)
!511 = !DILocation(line: 54, column: 9, scope: !488)
!512 = !DILocation(line: 54, column: 5, scope: !488)
!513 = !DILocation(line: 55, column: 7, scope: !514)
!514 = distinct !DILexicalBlock(scope: !488, file: !145, line: 55, column: 7)
!515 = !DILocation(line: 55, column: 9, scope: !514)
!516 = !DILocation(line: 55, column: 7, scope: !488)
!517 = !DILocation(line: 56, column: 7, scope: !514)
!518 = !DILocation(line: 56, column: 5, scope: !514)
!519 = !DILocation(line: 57, column: 24, scope: !488)
!520 = !DILocation(line: 57, column: 33, scope: !488)
!521 = !DILocation(line: 57, column: 66, scope: !488)
!522 = !DILocation(line: 57, column: 52, scope: !488)
!523 = !DILocation(line: 57, column: 3, scope: !524)
!524 = !DILexicalBlockFile(scope: !488, file: !145, discriminator: 1)
!525 = !DILocation(line: 58, column: 1, scope: !488)
!526 = !DILocation(line: 58, column: 1, scope: !524)
!527 = distinct !DISubprogram(name: "setselections", scope: !145, file: !145, line: 112, type: !146, isLocal: false, isDefinition: true, scopeLine: 113, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !154)
!528 = !DILocalVariable(name: "argv", arg: 1, scope: !527, file: !145, line: 112, type: !149)
!529 = !DILocation(line: 112, column: 34, scope: !527)
!530 = !DILocalVariable(name: "msdbflags", scope: !527, file: !145, line: 114, type: !99)
!531 = !DILocation(line: 114, column: 21, scope: !527)
!532 = !DILocalVariable(name: "nv", scope: !527, file: !145, line: 115, type: !533)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !534, size: 64, align: 64)
!534 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !535)
!535 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "namevalue", file: !536, line: 35, size: 128, align: 64, elements: !537)
!536 = !DIFile(filename: "../lib/dpkg/namevalue.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!537 = !{!538, !539, !540}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !535, file: !536, line: 36, baseType: !151, size: 64, align: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !535, file: !536, line: 37, baseType: !148, size: 32, align: 32, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !535, file: !536, line: 38, baseType: !148, size: 32, align: 32, offset: 96)
!541 = !DILocation(line: 115, column: 27, scope: !527)
!542 = !DILocalVariable(name: "pkg", scope: !527, file: !145, line: 116, type: !165)
!543 = !DILocation(line: 116, column: 19, scope: !527)
!544 = !DILocalVariable(name: "c", scope: !527, file: !145, line: 117, type: !148)
!545 = !DILocation(line: 117, column: 7, scope: !527)
!546 = !DILocalVariable(name: "lno", scope: !527, file: !145, line: 117, type: !148)
!547 = !DILocation(line: 117, column: 10, scope: !527)
!548 = !DILocalVariable(name: "namevb", scope: !527, file: !145, line: 118, type: !549)
!549 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !550, line: 55, size: 192, align: 64, elements: !551)
!550 = !DIFile(filename: "../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!551 = !{!552, !555, !556}
!552 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !549, file: !550, line: 56, baseType: !553, size: 64, align: 64)
!553 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !554, line: 216, baseType: !355)
!554 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!555 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !549, file: !550, line: 56, baseType: !553, size: 64, align: 64, offset: 64)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !549, file: !550, line: 57, baseType: !340, size: 64, align: 64, offset: 128)
!557 = !DILocation(line: 118, column: 17, scope: !527)
!558 = !DILocalVariable(name: "selvb", scope: !527, file: !145, line: 119, type: !549)
!559 = !DILocation(line: 119, column: 17, scope: !527)
!560 = !DILocalVariable(name: "db_possibly_outdated", scope: !527, file: !145, line: 120, type: !212)
!561 = !DILocation(line: 120, column: 7, scope: !527)
!562 = !DILocation(line: 122, column: 8, scope: !563)
!563 = distinct !DILexicalBlock(scope: !527, file: !145, line: 122, column: 7)
!564 = !DILocation(line: 122, column: 7, scope: !563)
!565 = !DILocation(line: 122, column: 7, scope: !527)
!566 = !DILocation(line: 123, column: 14, scope: !563)
!567 = !DILocation(line: 123, column: 50, scope: !563)
!568 = !DILocation(line: 123, column: 61, scope: !563)
!569 = !DILocation(line: 123, column: 5, scope: !570)
!570 = !DILexicalBlockFile(scope: !563, file: !145, discriminator: 1)
!571 = !DILocation(line: 123, column: 5, scope: !563)
!572 = !DILocation(line: 125, column: 13, scope: !527)
!573 = !DILocation(line: 126, column: 7, scope: !574)
!574 = distinct !DILexicalBlock(scope: !527, file: !145, line: 126, column: 7)
!575 = !DILocation(line: 126, column: 7, scope: !527)
!576 = !DILocation(line: 127, column: 15, scope: !574)
!577 = !DILocation(line: 127, column: 5, scope: !574)
!578 = !DILocation(line: 129, column: 15, scope: !574)
!579 = !DILocation(line: 131, column: 18, scope: !527)
!580 = !DILocation(line: 131, column: 3, scope: !527)
!581 = !DILocation(line: 132, column: 3, scope: !527)
!582 = !DILocation(line: 134, column: 6, scope: !527)
!583 = !DILocation(line: 135, column: 3, scope: !527)
!584 = !DILocalVariable(name: "err", scope: !585, file: !145, line: 136, type: !588)
!585 = distinct !DILexicalBlock(scope: !586, file: !145, line: 135, column: 12)
!586 = distinct !DILexicalBlock(scope: !587, file: !145, line: 135, column: 3)
!587 = distinct !DILexicalBlock(scope: !527, file: !145, line: 135, column: 3)
!588 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_error", file: !117, line: 42, size: 128, align: 64, elements: !589)
!589 = !{!590, !591, !592}
!590 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !588, file: !117, line: 43, baseType: !116, size: 32, align: 32)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "syserrno", scope: !588, file: !117, line: 45, baseType: !148, size: 32, align: 32, offset: 32)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !588, file: !117, line: 46, baseType: !340, size: 64, align: 64, offset: 64)
!593 = !DILocation(line: 136, column: 23, scope: !585)
!594 = !DILocation(line: 138, column: 5, scope: !585)
!595 = distinct !{!595, !594}
!596 = !DILocation(line: 139, column: 11, scope: !597)
!597 = distinct !DILexicalBlock(scope: !585, file: !145, line: 138, column: 8)
!598 = !DILocation(line: 139, column: 9, scope: !597)
!599 = !DILocation(line: 140, column: 11, scope: !600)
!600 = distinct !DILexicalBlock(scope: !597, file: !145, line: 140, column: 11)
!601 = !DILocation(line: 140, column: 13, scope: !600)
!602 = !DILocation(line: 140, column: 11, scope: !597)
!603 = !DILocation(line: 141, column: 12, scope: !600)
!604 = !DILocation(line: 141, column: 9, scope: !600)
!605 = !DILocation(line: 142, column: 5, scope: !597)
!606 = !DILocation(line: 142, column: 14, scope: !607)
!607 = !DILexicalBlockFile(scope: !585, file: !145, discriminator: 1)
!608 = !DILocation(line: 142, column: 16, scope: !607)
!609 = !DILocation(line: 142, column: 22, scope: !607)
!610 = !DILocation(line: 142, column: 35, scope: !611)
!611 = !DILexicalBlockFile(scope: !585, file: !145, discriminator: 2)
!612 = !DILocation(line: 142, column: 25, scope: !611)
!613 = !DILocation(line: 142, column: 5, scope: !614)
!614 = !DILexicalBlockFile(scope: !597, file: !145, discriminator: 3)
!615 = !DILocation(line: 143, column: 9, scope: !616)
!616 = distinct !DILexicalBlock(scope: !585, file: !145, line: 143, column: 9)
!617 = !DILocation(line: 143, column: 11, scope: !616)
!618 = !DILocation(line: 143, column: 9, scope: !585)
!619 = !DILocation(line: 143, column: 18, scope: !620)
!620 = !DILexicalBlockFile(scope: !616, file: !145, discriminator: 1)
!621 = !DILocation(line: 144, column: 9, scope: !622)
!622 = distinct !DILexicalBlock(scope: !585, file: !145, line: 144, column: 9)
!623 = !DILocation(line: 144, column: 11, scope: !622)
!624 = !DILocation(line: 144, column: 9, scope: !585)
!625 = !DILocation(line: 145, column: 7, scope: !626)
!626 = distinct !DILexicalBlock(scope: !622, file: !145, line: 144, column: 19)
!627 = distinct !{!627, !625}
!628 = !DILocation(line: 145, column: 15, scope: !629)
!629 = !DILexicalBlockFile(scope: !630, file: !145, discriminator: 1)
!630 = distinct !DILexicalBlock(scope: !626, file: !145, line: 145, column: 10)
!631 = !DILocation(line: 145, column: 13, scope: !629)
!632 = !DILocation(line: 145, column: 30, scope: !629)
!633 = !DILocation(line: 145, column: 32, scope: !629)
!634 = !DILocation(line: 145, column: 44, scope: !635)
!635 = !DILexicalBlockFile(scope: !636, file: !145, discriminator: 2)
!636 = distinct !DILexicalBlock(scope: !630, file: !145, line: 145, column: 30)
!637 = !DILocation(line: 145, column: 41, scope: !635)
!638 = !DILocation(line: 145, column: 48, scope: !639)
!639 = !DILexicalBlockFile(scope: !630, file: !145, discriminator: 3)
!640 = !DILocation(line: 145, column: 57, scope: !641)
!641 = !DILexicalBlockFile(scope: !626, file: !145, discriminator: 4)
!642 = !DILocation(line: 145, column: 59, scope: !641)
!643 = !DILocation(line: 145, column: 65, scope: !641)
!644 = !DILocation(line: 145, column: 68, scope: !645)
!645 = !DILexicalBlockFile(scope: !626, file: !145, discriminator: 5)
!646 = !DILocation(line: 145, column: 70, scope: !645)
!647 = !DILocation(line: 145, column: 48, scope: !648)
!648 = !DILexicalBlockFile(scope: !630, file: !145, discriminator: 6)
!649 = !DILocation(line: 146, column: 7, scope: !626)
!650 = distinct !{!650, !583}
!651 = !DILocation(line: 149, column: 5, scope: !585)
!652 = !DILocation(line: 150, column: 5, scope: !585)
!653 = !DILocation(line: 150, column: 23, scope: !607)
!654 = !DILocation(line: 150, column: 13, scope: !607)
!655 = !DILocation(line: 150, column: 12, scope: !607)
!656 = !DILocation(line: 150, column: 5, scope: !607)
!657 = !DILocation(line: 151, column: 32, scope: !658)
!658 = distinct !DILexicalBlock(scope: !585, file: !145, line: 150, column: 27)
