; ModuleID = './[inter]src--remove.o.i'
source_filename = "./[inter]src--remove.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.cmdinfo = type { i8*, i8, i32, i32*, i8**, void (%struct.cmdinfo*, i8*)*, i32, i8*, i32 (i8**)* }
%struct.varbuf = type { i64, i64, i8* }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.2, i32 }
%struct.anon.2 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }
%struct.pkgbin = type { %struct.dependency*, i8, i32, %struct.dpkg_arch*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.dpkg_version, %struct.conffile*, %struct.arbitraryfield* }
%struct.conffile = type { %struct.conffile*, i8*, i8*, i8 }
%struct.arbitraryfield = type { %struct.arbitraryfield*, i8*, i8* }

!171 = !DIEnumerator(name: "act_printavail", value: 38)
!172 = !DIEnumerator(name: "act_avclear", value: 39)
!173 = !DIEnumerator(name: "act_avreplace", value: 40)
!174 = !DIEnumerator(name: "act_avmerge", value: 41)
!175 = !DIEnumerator(name: "act_forgetold", value: 42)
!176 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "force_flags", file: !177, line: 28, size: 32, align: 32, elements: !178)
!177 = !DIFile(filename: "force.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!178 = !{!179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206}
!179 = !DIEnumerator(name: "FORCE_ARCHITECTURE", value: 1)
!180 = !DIEnumerator(name: "FORCE_BAD_PATH", value: 2)
!181 = !DIEnumerator(name: "FORCE_BAD_VERIFY", value: 4)
!182 = !DIEnumerator(name: "FORCE_BAD_VERSION", value: 8)
!183 = !DIEnumerator(name: "FORCE_BREAKS", value: 16)
!184 = !DIEnumerator(name: "FORCE_CONFF_ASK", value: 32)
!185 = !DIEnumerator(name: "FORCE_CONFF_DEF", value: 64)
!186 = !DIEnumerator(name: "FORCE_CONFF_MISS", value: 128)
!187 = !DIEnumerator(name: "FORCE_CONFF_NEW", value: 256)
!188 = !DIEnumerator(name: "FORCE_CONFF_OLD", value: 512)
!189 = !DIEnumerator(name: "FORCE_CONFIGURE_ANY", value: 1024)
!190 = !DIEnumerator(name: "FORCE_CONFLICTS", value: 2048)
!191 = !DIEnumerator(name: "FORCE_DEPENDS", value: 4096)
!192 = !DIEnumerator(name: "FORCE_DEPENDS_VERSION", value: 8192)
!193 = !DIEnumerator(name: "FORCE_DOWNGRADE", value: 16384)
!194 = !DIEnumerator(name: "FORCE_HOLD", value: 32768)
!195 = !DIEnumerator(name: "FORCE_NON_ROOT", value: 65536)
!196 = !DIEnumerator(name: "FORCE_OVERWRITE", value: 131072)
!197 = !DIEnumerator(name: "FORCE_OVERWRITE_DIR", value: 262144)
!198 = !DIEnumerator(name: "FORCE_OVERWRITE_DIVERTED", value: 524288)
!199 = !DIEnumerator(name: "FORCE_REMOVE_ESSENTIAL", value: 1048576)
!200 = !DIEnumerator(name: "FORCE_REMOVE_REINSTREQ", value: 2097152)
!201 = !DIEnumerator(name: "FORCE_SCRIPT_CHROOTLESS", value: 4194304)
!202 = !DIEnumerator(name: "FORCE_UNSAFE_IO", value: 8388608)
!203 = !DIEnumerator(name: "FORCE_STATOVERRIDE_ADD", value: 16777216)
!204 = !DIEnumerator(name: "FORCE_STATOVERRIDE_DEL", value: 33554432)
!205 = !DIEnumerator(name: "FORCE_SECURITY_MAC", value: 67108864)
!206 = !DIEnumerator(name: "FORCE_ALL", value: -1)
!207 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "versiondisplayepochwhen", file: !4, line: 388, size: 32, align: 32, elements: !208)
!208 = !{!209, !210, !211}
!209 = !DIEnumerator(name: "vdew_never", value: 0)
!210 = !DIEnumerator(name: "vdew_nonambig", value: 1)
!211 = !DIEnumerator(name: "vdew_always", value: 2)
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !213, line: 41, size: 32, align: 32, elements: !214)
!213 = !DIFile(filename: "../lib/dpkg/ehandle.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!214 = !{!215, !216, !217}
!215 = !DIEnumerator(name: "ehflag_normaltidy", value: 1)
!216 = !DIEnumerator(name: "ehflag_bombout", value: 2)
!217 = !DIEnumerator(name: "ehflag_recursiveerror", value: 4)
!218 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dependtry", file: !74, line: 243, size: 32, align: 32, elements: !219)
!219 = !{!220, !221, !222, !223, !224, !225}
!220 = !DIEnumerator(name: "DEPEND_TRY_NORMAL", value: 1)
!221 = !DIEnumerator(name: "DEPEND_TRY_CYCLES", value: 2)
!222 = !DIEnumerator(name: "DEPEND_TRY_TRIGGERS", value: 3)
!223 = !DIEnumerator(name: "DEPEND_TRY_FORCE_DEPENDS_VERSION", value: 4)
!224 = !DIEnumerator(name: "DEPEND_TRY_FORCE_DEPENDS", value: 5)
!225 = !DIEnumerator(name: "DEPEND_TRY_LAST", value: 6)
!226 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_ctype_bit", file: !227, line: 32, size: 32, align: 32, elements: !228)
!227 = !DIFile(filename: "../lib/dpkg/c-ctype.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!228 = !{!229, !230, !231, !232, !233, !234, !235, !236}
!229 = !DIEnumerator(name: "C_CTYPE_BLANK", value: 1)
!230 = !DIEnumerator(name: "C_CTYPE_WHITE", value: 2)
!231 = !DIEnumerator(name: "C_CTYPE_SPACE", value: 4)
!232 = !DIEnumerator(name: "C_CTYPE_UPPER", value: 8)
!233 = !DIEnumerator(name: "C_CTYPE_LOWER", value: 16)
!234 = !DIEnumerator(name: "C_CTYPE_DIGIT", value: 32)
!235 = !DIEnumerator(name: "C_CTYPE_ALPHA", value: 24)
!236 = !DIEnumerator(name: "C_CTYPE_ALNUM", value: 56)
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!239 = !{!240, !462, !472, !478, !479, !480}
!240 = distinct !DIGlobalVariable(name: "oldpkgstatus", scope: !241, file: !242, line: 190, type: !47, isLocal: true, isDefinition: true, variable: i32* @deferred_remove.oldpkgstatus)
!241 = distinct !DISubprogram(name: "deferred_remove", scope: !242, file: !242, line: 91, type: !243, isLocal: false, isDefinition: true, scopeLine: 91, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !461)
!242 = !DIFile(filename: "remove.c", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!243 = !DISubroutineType(types: !244)
!244 = !{null, !245}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !247)
!247 = !{!248, !300, !301, !302, !303, !304, !305, !306, !307, !308, !338, !339, !355, !364, !380, !381, !387, !455, !459, !460}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !246, file: !4, line: 196, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !251)
!251 = !{!252, !253, !257, !258, !298}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !4, line: 243, baseType: !249, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !250, file: !4, line: 244, baseType: !254, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!256 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !250, file: !4, line: 245, baseType: !246, size: 3072, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !250, file: !4, line: 249, baseType: !259, size: 128, align: 64, offset: 3200)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !250, file: !4, line: 246, size: 128, align: 64, elements: !260)
!260 = !{!261, !297}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !259, file: !4, line: 247, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !264)
!264 = !{!265, !273, !274, !275, !276, !277, !286, !293, !294, !296}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !263, file: !4, line: 64, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !268)
!268 = !{!269, !270, !271, !272}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !267, file: !4, line: 57, baseType: !245, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !4, line: 58, baseType: !266, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !267, file: !4, line: 59, baseType: !262, size: 64, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !267, file: !4, line: 60, baseType: !3, size: 32, align: 32, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !263, file: !4, line: 65, baseType: !249, size: 64, align: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !263, file: !4, line: 66, baseType: !262, size: 64, align: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !263, file: !4, line: 66, baseType: !262, size: 64, align: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !263, file: !4, line: 66, baseType: !262, size: 64, align: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !263, file: !4, line: 67, baseType: !278, size: 64, align: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !16, line: 48, size: 192, align: 64, elements: !281)
!281 = !{!282, !284, !285}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !280, file: !16, line: 49, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !280, file: !16, line: 50, baseType: !254, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !280, file: !16, line: 51, baseType: !15, size: 32, align: 32, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !263, file: !4, line: 68, baseType: !287, size: 192, align: 64, offset: 384)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !27, line: 42, size: 192, align: 64, elements: !288)
!288 = !{!289, !291, !292}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !287, file: !27, line: 44, baseType: !290, size: 32, align: 32)
!290 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !287, file: !27, line: 46, baseType: !254, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !287, file: !27, line: 48, baseType: !254, size: 64, align: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !263, file: !4, line: 69, baseType: !26, size: 32, align: 32, offset: 576)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !263, file: !4, line: 70, baseType: !295, size: 8, align: 8, offset: 608)
!295 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !263, file: !4, line: 71, baseType: !295, size: 8, align: 8, offset: 616)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !259, file: !4, line: 248, baseType: !262, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !250, file: !4, line: 250, baseType: !299, size: 32, align: 32, offset: 3328)
!299 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !246, file: !4, line: 197, baseType: !245, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !246, file: !4, line: 199, baseType: !35, size: 32, align: 32, offset: 128)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !246, file: !4, line: 201, baseType: !43, size: 32, align: 32, offset: 160)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !246, file: !4, line: 202, baseType: !47, size: 32, align: 32, offset: 192)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !246, file: !4, line: 203, baseType: !57, size: 32, align: 32, offset: 224)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !246, file: !4, line: 204, baseType: !254, size: 64, align: 64, offset: 256)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !246, file: !4, line: 205, baseType: !254, size: 64, align: 64, offset: 320)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !246, file: !4, line: 206, baseType: !287, size: 192, align: 64, offset: 384)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !246, file: !4, line: 207, baseType: !309, size: 960, align: 64, offset: 576)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !310)
!310 = !{!311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !331}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !309, file: !4, line: 108, baseType: !266, size: 64, align: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !309, file: !4, line: 110, baseType: !295, size: 8, align: 8, offset: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !309, file: !4, line: 111, baseType: !67, size: 32, align: 32, offset: 96)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !309, file: !4, line: 112, baseType: !278, size: 64, align: 64, offset: 128)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !309, file: !4, line: 115, baseType: !254, size: 64, align: 64, offset: 192)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !309, file: !4, line: 116, baseType: !254, size: 64, align: 64, offset: 256)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !309, file: !4, line: 117, baseType: !254, size: 64, align: 64, offset: 320)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !309, file: !4, line: 118, baseType: !254, size: 64, align: 64, offset: 384)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !309, file: !4, line: 119, baseType: !254, size: 64, align: 64, offset: 448)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !309, file: !4, line: 120, baseType: !254, size: 64, align: 64, offset: 512)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !309, file: !4, line: 121, baseType: !254, size: 64, align: 64, offset: 576)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !309, file: !4, line: 122, baseType: !287, size: 192, align: 64, offset: 640)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !309, file: !4, line: 123, baseType: !324, size: 64, align: 64, offset: 832)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !325, size: 64, align: 64)
!325 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !326)
!326 = !{!327, !328, !329, !330}
!327 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !325, file: !4, line: 81, baseType: !324, size: 64, align: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !325, file: !4, line: 82, baseType: !254, size: 64, align: 64, offset: 64)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !325, file: !4, line: 83, baseType: !254, size: 64, align: 64, offset: 128)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !325, file: !4, line: 84, baseType: !295, size: 8, align: 8, offset: 192)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !309, file: !4, line: 124, baseType: !332, size: 64, align: 64, offset: 896)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64, align: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !334)
!334 = !{!335, !336, !337}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !333, file: !4, line: 75, baseType: !332, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !333, file: !4, line: 76, baseType: !254, size: 64, align: 64, offset: 64)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !333, file: !4, line: 77, baseType: !254, size: 64, align: 64, offset: 128)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !246, file: !4, line: 208, baseType: !309, size: 960, align: 64, offset: 1536)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !246, file: !4, line: 209, baseType: !340, size: 64, align: 64, offset: 2496)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !341, size: 64, align: 64)
!341 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !74, line: 53, size: 256, align: 64, elements: !342)
!342 = !{!343, !344, !345, !346, !347, !348}
!343 = !DIDerivedType(tag: DW_TAG_member, name: "istobe", scope: !341, file: !74, line: 54, baseType: !73, size: 32, align: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !341, file: !74, line: 57, baseType: !81, size: 32, align: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "enqueued", scope: !341, file: !74, line: 59, baseType: !295, size: 8, align: 8, offset: 64)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "replacingfilesandsaid", scope: !341, file: !74, line: 61, baseType: !299, size: 32, align: 32, offset: 96)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "cmdline_seen", scope: !341, file: !74, line: 62, baseType: !299, size: 32, align: 32, offset: 128)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "trigprocdeferred", scope: !341, file: !74, line: 65, baseType: !349, size: 64, align: 64, offset: 192)
!349 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !350, size: 64, align: 64)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !351, line: 34, size: 128, align: 64, elements: !352)
!351 = !DIFile(filename: "../lib/dpkg/pkg-list.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!352 = !{!353, !354}
!353 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !350, file: !351, line: 35, baseType: !349, size: 64, align: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !350, file: !351, line: 36, baseType: !245, size: 64, align: 64, offset: 64)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !246, file: !4, line: 211, baseType: !356, size: 64, align: 64, offset: 2560)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64, align: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !358)
!358 = !{!359, !360, !361, !362, !363}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !357, file: !4, line: 88, baseType: !356, size: 64, align: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !357, file: !4, line: 89, baseType: !254, size: 64, align: 64, offset: 64)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !357, file: !4, line: 90, baseType: !254, size: 64, align: 64, offset: 128)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !357, file: !4, line: 91, baseType: !254, size: 64, align: 64, offset: 192)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !357, file: !4, line: 92, baseType: !254, size: 64, align: 64, offset: 256)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !246, file: !4, line: 216, baseType: !365, size: 128, align: 64, offset: 2624)
!365 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !246, file: !4, line: 213, size: 128, align: 64, elements: !366)
!366 = !{!367, !379}
!367 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !365, file: !4, line: 215, baseType: !368, size: 64, align: 64)
!368 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !369, size: 64, align: 64)
!369 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !370)
!370 = !{!371, !372, !373, !374}
!371 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !369, file: !4, line: 143, baseType: !245, size: 64, align: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !369, file: !4, line: 143, baseType: !245, size: 64, align: 64, offset: 64)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !369, file: !4, line: 144, baseType: !368, size: 64, align: 64, offset: 128)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !369, file: !4, line: 147, baseType: !375, size: 128, align: 64, offset: 192)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !369, file: !4, line: 145, size: 128, align: 64, elements: !376)
!376 = !{!377, !378}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !375, file: !4, line: 146, baseType: !368, size: 64, align: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !375, file: !4, line: 146, baseType: !368, size: 64, align: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !365, file: !4, line: 215, baseType: !368, size: 64, align: 64, offset: 64)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !246, file: !4, line: 219, baseType: !368, size: 64, align: 64, offset: 2752)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !246, file: !4, line: 220, baseType: !382, size: 64, align: 64, offset: 2816)
!382 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !383, size: 64, align: 64)
!383 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !384)
!384 = !{!385, !386}
!385 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !383, file: !4, line: 135, baseType: !382, size: 64, align: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !383, file: !4, line: 136, baseType: !254, size: 64, align: 64, offset: 64)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !246, file: !4, line: 231, baseType: !388, size: 64, align: 64, offset: 2880)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64, align: 64)
!389 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !92, line: 122, size: 128, align: 64, elements: !390)
!390 = !{!391, !392}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !389, file: !92, line: 123, baseType: !388, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "namenode", scope: !389, file: !92, line: 124, baseType: !393, size: 64, align: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !394, size: 64, align: 64)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode", file: !92, line: 90, size: 640, align: 64, elements: !395)
!395 = !{!396, !397, !398, !399, !407, !426, !441, !442, !443, !444}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !394, file: !92, line: 91, baseType: !393, size: 64, align: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !394, file: !92, line: 92, baseType: !254, size: 64, align: 64, offset: 64)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "packages", scope: !394, file: !92, line: 93, baseType: !349, size: 64, align: 64, offset: 128)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "divert", scope: !394, file: !92, line: 94, baseType: !400, size: 64, align: 64, offset: 192)
!400 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !401, size: 64, align: 64)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_diversion", file: !92, line: 151, size: 256, align: 64, elements: !402)
!402 = !{!403, !404, !405, !406}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "useinstead", scope: !401, file: !92, line: 152, baseType: !393, size: 64, align: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "camefrom", scope: !401, file: !92, line: 153, baseType: !393, size: 64, align: 64, offset: 64)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "pkgset", scope: !401, file: !92, line: 154, baseType: !249, size: 64, align: 64, offset: 128)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !401, file: !92, line: 157, baseType: !400, size: 64, align: 64, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "statoverride", scope: !394, file: !92, line: 101, baseType: !408, size: 64, align: 64, offset: 256)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64, align: 64)
!409 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !410, line: 40, size: 256, align: 64, elements: !411)
!410 = !DIFile(filename: "../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!411 = !{!412, !417, !420, !423, !425}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !409, file: !410, line: 41, baseType: !413, size: 32, align: 32)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !414, line: 80, baseType: !415)
!414 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !416, line: 125, baseType: !290)
!416 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!417 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !409, file: !410, line: 42, baseType: !418, size: 32, align: 32, offset: 32)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !414, line: 65, baseType: !419)
!419 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !416, line: 126, baseType: !290)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !409, file: !410, line: 43, baseType: !421, size: 32, align: 32, offset: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !414, line: 70, baseType: !422)
!422 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !416, line: 129, baseType: !290)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !409, file: !410, line: 47, baseType: !424, size: 64, align: 64, offset: 128)
!424 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !409, file: !410, line: 48, baseType: !424, size: 64, align: 64, offset: 192)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "trig_interested", scope: !394, file: !92, line: 103, baseType: !427, size: 64, align: 64, offset: 320)
!427 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !428, size: 64, align: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigfileint", file: !87, line: 54, size: 448, align: 64, elements: !429)
!429 = !{!430, !431, !433, !434, !435, !436}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !428, file: !87, line: 55, baseType: !245, size: 64, align: 64)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "pkgbin", scope: !428, file: !87, line: 56, baseType: !432, size: 64, align: 64, offset: 64)
!432 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !309, size: 64, align: 64)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "fnn", scope: !428, file: !87, line: 57, baseType: !393, size: 64, align: 64, offset: 128)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !428, file: !87, line: 58, baseType: !86, size: 32, align: 32, offset: 192)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "samefile_next", scope: !428, file: !87, line: 59, baseType: !427, size: 64, align: 64, offset: 256)
!436 = !DIDerivedType(tag: DW_TAG_member, name: "inoverall", scope: !428, file: !87, line: 62, baseType: !437, size: 128, align: 64, offset: 320)
!437 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !428, file: !87, line: 60, size: 128, align: 64, elements: !438)
!438 = !{!439, !440}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !437, file: !87, line: 61, baseType: !427, size: 64, align: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !437, file: !87, line: 61, baseType: !427, size: 64, align: 64, offset: 64)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !394, file: !92, line: 111, baseType: !91, size: 32, align: 32, offset: 384)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "oldhash", scope: !394, file: !92, line: 114, baseType: !254, size: 64, align: 64, offset: 448)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "newhash", scope: !394, file: !92, line: 117, baseType: !254, size: 64, align: 64, offset: 512)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "file_ondisk_id", scope: !394, file: !92, line: 119, baseType: !445, size: 64, align: 64, offset: 576)
!445 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !446, size: 64, align: 64)
!446 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_ondisk_id", file: !92, line: 85, size: 128, align: 64, elements: !447)
!447 = !{!448, !452}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "id_dev", scope: !446, file: !92, line: 86, baseType: !449, size: 64, align: 64)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !414, line: 60, baseType: !450)
!450 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !416, line: 124, baseType: !451)
!451 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!452 = !DIDerivedType(tag: DW_TAG_member, name: "id_ino", scope: !446, file: !92, line: 87, baseType: !453, size: 64, align: 64, offset: 64)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !414, line: 48, baseType: !454)
!454 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !416, line: 127, baseType: !451)
!455 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !246, file: !4, line: 232, baseType: !456, size: 64, align: 64, offset: 2944)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !414, line: 86, baseType: !457)
!457 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !416, line: 131, baseType: !458)
!458 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!459 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !246, file: !4, line: 233, baseType: !295, size: 8, align: 8, offset: 3008)
!460 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !246, file: !4, line: 236, baseType: !295, size: 8, align: 8, offset: 3016)
!461 = !{}
!462 = distinct !DIGlobalVariable(name: "fnvb", scope: !463, file: !242, line: 267, type: !464, isLocal: true, isDefinition: true, variable: %struct.varbuf* @removal_bulk_remove_files.fnvb)
!463 = distinct !DISubprogram(name: "removal_bulk_remove_files", scope: !242, file: !242, line: 262, type: !243, isLocal: true, isDefinition: true, scopeLine: 263, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !461)
!464 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !465, line: 55, size: 192, align: 64, elements: !466)
!465 = !DIFile(filename: "../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!466 = !{!467, !470, !471}
!467 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !464, file: !465, line: 56, baseType: !468, size: 64, align: 64)
!468 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !469, line: 216, baseType: !451)
!469 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!470 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !464, file: !465, line: 56, baseType: !468, size: 64, align: 64, offset: 64)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !464, file: !465, line: 57, baseType: !424, size: 64, align: 64, offset: 128)
!472 = distinct !DIGlobalVariable(name: "removeconffexts", scope: !473, file: !242, line: 478, type: !474, isLocal: true, isDefinition: true, variable: [8 x i8*]* @removal_bulk_remove_configfiles.removeconffexts)
!473 = distinct !DISubprogram(name: "removal_bulk_remove_configfiles", scope: !242, file: !242, line: 477, type: !243, isLocal: true, isDefinition: true, scopeLine: 477, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !461)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !475, size: 512, align: 64, elements: !476)
!475 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !254)
!476 = !{!477}
!477 = !DISubrange(count: 8)
!478 = distinct !DIGlobalVariable(name: "fnvb", scope: !473, file: !242, line: 532, type: !464, isLocal: true, isDefinition: true, variable: %struct.varbuf* @removal_bulk_remove_configfiles.fnvb)
!479 = distinct !DIGlobalVariable(name: "removevb", scope: !473, file: !242, line: 532, type: !464, isLocal: true, isDefinition: true, variable: %struct.varbuf* @removal_bulk_remove_configfiles.removevb)
!480 = distinct !DIGlobalVariable(name: "fnvb", scope: !481, file: !242, line: 389, type: !464, isLocal: true, isDefinition: true, variable: %struct.varbuf* @removal_bulk_remove_leftover_dirs.fnvb)
!481 = distinct !DISubprogram(name: "removal_bulk_remove_leftover_dirs", scope: !242, file: !242, line: 385, type: !243, isLocal: true, isDefinition: true, scopeLine: 385, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !461)
!482 = !{i32 2, !"Dwarf Version", i32 4}
!483 = !{i32 2, !"Debug Info Version", i32 3}
!484 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!485 = !DILocalVariable(name: "pkg", arg: 1, scope: !241, file: !242, line: 91, type: !245)
!486 = !DIExpression()
!487 = !DILocation(line: 91, column: 38, scope: !241)
!488 = !DILocalVariable(name: "raemsgs", scope: !241, file: !242, line: 92, type: !464)
!489 = !DILocation(line: 92, column: 17, scope: !241)
!490 = !DILocalVariable(name: "dep", scope: !241, file: !242, line: 93, type: !266)
!491 = !DILocation(line: 93, column: 22, scope: !241)
!492 = !DILocalVariable(name: "rok", scope: !241, file: !242, line: 94, type: !104)
!493 = !DILocation(line: 94, column: 18, scope: !241)
!494 = !DILocation(line: 97, column: 18, scope: !241)
!495 = !DILocation(line: 97, column: 9, scope: !241)
!496 = !DILocation(line: 96, column: 3, scope: !241)
!497 = !DILocation(line: 99, column: 8, scope: !498)
!498 = distinct !DILexicalBlock(scope: !241, file: !242, line: 99, column: 7)
!499 = !DILocation(line: 99, column: 18, scope: !498)
!500 = !DILocation(line: 99, column: 21, scope: !501)
!501 = !DILexicalBlockFile(scope: !498, file: !242, discriminator: 1)
!502 = !DILocation(line: 99, column: 26, scope: !501)
!503 = !DILocation(line: 99, column: 31, scope: !501)
!504 = !DILocation(line: 99, column: 7, scope: !501)
!505 = !DILocation(line: 100, column: 9, scope: !506)
!506 = distinct !DILexicalBlock(scope: !507, file: !242, line: 100, column: 9)
!507 = distinct !DILexicalBlock(scope: !498, file: !242, line: 99, column: 52)
!508 = !DILocation(line: 100, column: 20, scope: !506)
!509 = !DILocation(line: 100, column: 28, scope: !506)
!510 = !DILocation(line: 100, column: 9, scope: !507)
!511 = !DILocation(line: 101, column: 20, scope: !506)
!512 = !DILocation(line: 101, column: 7, scope: !506)
!513 = !DILocation(line: 103, column: 20, scope: !506)
!514 = !DILocation(line: 103, column: 7, scope: !506)
!515 = !DILocation(line: 105, column: 10, scope: !516)
!516 = distinct !DILexicalBlock(scope: !507, file: !242, line: 105, column: 9)
!517 = !DILocation(line: 105, column: 9, scope: !507)
!518 = !DILocation(line: 106, column: 22, scope: !516)
!519 = !DILocation(line: 106, column: 7, scope: !516)
!520 = !DILocation(line: 107, column: 3, scope: !507)
!521 = !DILocation(line: 109, column: 29, scope: !241)
!522 = !DILocation(line: 109, column: 3, scope: !241)
!523 = !DILocation(line: 111, column: 7, scope: !524)
!524 = distinct !DILexicalBlock(scope: !241, file: !242, line: 111, column: 7)
!525 = !DILocation(line: 111, column: 12, scope: !524)
!526 = !DILocation(line: 111, column: 19, scope: !524)
!527 = !DILocation(line: 111, column: 7, scope: !241)
!528 = !DILocation(line: 112, column: 18, scope: !529)
!529 = distinct !DILexicalBlock(scope: !524, file: !242, line: 111, column: 45)
!530 = !DILocation(line: 113, column: 13, scope: !529)
!531 = !DILocation(line: 114, column: 22, scope: !529)
!532 = !DILocation(line: 114, column: 13, scope: !529)
!533 = !DILocation(line: 113, column: 5, scope: !534)
!534 = !DILexicalBlockFile(scope: !529, file: !242, discriminator: 1)
!535 = !DILocation(line: 115, column: 5, scope: !529)
!536 = !DILocation(line: 115, column: 10, scope: !529)
!537 = !DILocation(line: 115, column: 22, scope: !529)
!538 = !DILocation(line: 115, column: 29, scope: !529)
!539 = !DILocation(line: 116, column: 5, scope: !529)
!540 = !DILocation(line: 117, column: 15, scope: !541)
!541 = distinct !DILexicalBlock(scope: !524, file: !242, line: 117, column: 14)
!542 = !DILocation(line: 117, column: 25, scope: !541)
!543 = !DILocation(line: 118, column: 14, scope: !541)
!544 = !DILocation(line: 118, column: 19, scope: !541)
!545 = !DILocation(line: 118, column: 26, scope: !541)
!546 = !DILocation(line: 118, column: 50, scope: !541)
!547 = !DILocation(line: 119, column: 14, scope: !541)
!548 = !DILocation(line: 119, column: 25, scope: !541)
!549 = !DILocation(line: 119, column: 33, scope: !541)
!550 = !DILocation(line: 117, column: 14, scope: !551)
!551 = !DILexicalBlockFile(scope: !524, file: !242, discriminator: 1)
!552 = !DILocation(line: 120, column: 18, scope: !553)
!553 = distinct !DILexicalBlock(scope: !541, file: !242, line: 119, column: 47)
!554 = !DILocation(line: 121, column: 13, scope: !553)
!555 = !DILocation(line: 123, column: 22, scope: !553)
!556 = !DILocation(line: 123, column: 13, scope: !553)
!557 = !DILocation(line: 121, column: 5, scope: !558)
!558 = !DILexicalBlockFile(scope: !553, file: !242, discriminator: 1)
!559 = !DILocation(line: 124, column: 5, scope: !553)
!560 = !DILocation(line: 124, column: 10, scope: !553)
!561 = !DILocation(line: 124, column: 22, scope: !553)
!562 = !DILocation(line: 124, column: 29, scope: !553)
!563 = !DILocation(line: 125, column: 5, scope: !553)
!564 = !DILocation(line: 128, column: 7, scope: !565)
!565 = distinct !DILexicalBlock(scope: !241, file: !242, line: 128, column: 7)
!566 = !DILocation(line: 128, column: 12, scope: !565)
!567 = !DILocation(line: 128, column: 22, scope: !565)
!568 = !DILocation(line: 128, column: 32, scope: !565)
!569 = !DILocation(line: 128, column: 35, scope: !570)
!570 = !DILexicalBlockFile(scope: !565, file: !242, discriminator: 1)
!571 = !DILocation(line: 128, column: 40, scope: !570)
!572 = !DILocation(line: 128, column: 47, scope: !570)
!573 = !DILocation(line: 128, column: 7, scope: !570)
!574 = !DILocation(line: 130, column: 17, scope: !565)
!575 = !DILocation(line: 129, column: 5, scope: !565)
!576 = !DILocation(line: 133, column: 18, scope: !241)
!577 = !DILocation(line: 133, column: 9, scope: !241)
!578 = !DILocation(line: 132, column: 3, scope: !241)
!579 = !DILocation(line: 134, column: 7, scope: !241)
!580 = !DILocation(line: 135, column: 19, scope: !241)
!581 = !DILocation(line: 135, column: 24, scope: !241)
!582 = !DILocation(line: 135, column: 29, scope: !241)
!583 = !DILocation(line: 135, column: 3, scope: !241)
!584 = !DILocation(line: 136, column: 13, scope: !585)
!585 = distinct !DILexicalBlock(scope: !241, file: !242, line: 136, column: 3)
!586 = !DILocation(line: 136, column: 18, scope: !585)
!587 = !DILocation(line: 136, column: 28, scope: !585)
!588 = !DILocation(line: 136, column: 11, scope: !585)
!589 = !DILocation(line: 136, column: 8, scope: !585)
!590 = !DILocation(line: 136, column: 37, scope: !591)
!591 = !DILexicalBlockFile(scope: !592, file: !242, discriminator: 1)
!592 = distinct !DILexicalBlock(scope: !585, file: !242, line: 136, column: 3)
!593 = !DILocation(line: 136, column: 3, scope: !591)
!594 = !DILocation(line: 137, column: 9, scope: !595)
!595 = distinct !DILexicalBlock(scope: !596, file: !242, line: 137, column: 9)
!596 = distinct !DILexicalBlock(scope: !592, file: !242, line: 136, column: 58)
!597 = !DILocation(line: 137, column: 14, scope: !595)
!598 = !DILocation(line: 137, column: 19, scope: !595)
!599 = !DILocation(line: 137, column: 9, scope: !596)
!600 = !DILocation(line: 137, column: 36, scope: !601)
!601 = !DILexicalBlockFile(scope: !595, file: !242, discriminator: 1)
!602 = !DILocation(line: 138, column: 56, scope: !596)
!603 = !DILocation(line: 138, column: 61, scope: !596)
!604 = !DILocation(line: 138, column: 67, scope: !596)
!605 = !DILocation(line: 138, column: 71, scope: !596)
!606 = !DILocation(line: 138, column: 5, scope: !596)
!607 = !DILocation(line: 139, column: 21, scope: !596)
!608 = !DILocation(line: 139, column: 26, scope: !596)
!609 = !DILocation(line: 139, column: 31, scope: !596)
!610 = !DILocation(line: 139, column: 37, scope: !596)
!611 = !DILocation(line: 139, column: 5, scope: !596)
!612 = !DILocation(line: 140, column: 3, scope: !596)
!613 = !DILocation(line: 136, column: 47, scope: !614)
!614 = !DILexicalBlockFile(scope: !592, file: !242, discriminator: 2)
!615 = !DILocation(line: 136, column: 52, scope: !614)
!616 = !DILocation(line: 136, column: 45, scope: !614)
!617 = !DILocation(line: 136, column: 3, scope: !614)
!618 = distinct !{!618, !619}
!619 = !DILocation(line: 136, column: 3, scope: !241)
!620 = !DILocation(line: 142, column: 7, scope: !621)
!621 = distinct !DILexicalBlock(scope: !241, file: !242, line: 142, column: 7)
!622 = !DILocation(line: 142, column: 11, scope: !621)
!623 = !DILocation(line: 142, column: 7, scope: !241)
!624 = !DILocation(line: 143, column: 5, scope: !625)
!625 = distinct !DILexicalBlock(scope: !621, file: !242, line: 142, column: 31)
!626 = !DILocation(line: 144, column: 5, scope: !625)
!627 = !DILocation(line: 144, column: 10, scope: !625)
!628 = !DILocation(line: 144, column: 22, scope: !625)
!629 = !DILocation(line: 144, column: 29, scope: !625)
!630 = !DILocation(line: 145, column: 21, scope: !625)
!631 = !DILocation(line: 145, column: 5, scope: !625)
!632 = !DILocation(line: 146, column: 5, scope: !625)
!633 = !DILocation(line: 147, column: 14, scope: !634)
!634 = distinct !DILexicalBlock(scope: !621, file: !242, line: 147, column: 14)
!635 = !DILocation(line: 147, column: 18, scope: !634)
!636 = !DILocation(line: 147, column: 14, scope: !621)
!637 = !DILocation(line: 148, column: 17, scope: !638)
!638 = distinct !DILexicalBlock(scope: !634, file: !242, line: 147, column: 37)
!639 = !DILocation(line: 149, column: 5, scope: !638)
!640 = !DILocation(line: 150, column: 12, scope: !638)
!641 = !DILocation(line: 151, column: 22, scope: !638)
!642 = !DILocation(line: 151, column: 13, scope: !638)
!643 = !DILocation(line: 151, column: 51, scope: !638)
!644 = !DILocation(line: 150, column: 5, scope: !645)
!645 = !DILexicalBlockFile(scope: !638, file: !242, discriminator: 1)
!646 = !DILocation(line: 152, column: 12, scope: !638)
!647 = !DILocation(line: 152, column: 5, scope: !645)
!648 = !DILocation(line: 152, column: 5, scope: !638)
!649 = !DILocation(line: 153, column: 22, scope: !650)
!650 = distinct !DILexicalBlock(scope: !634, file: !242, line: 153, column: 14)
!651 = !DILocation(line: 153, column: 14, scope: !650)
!652 = !DILocation(line: 153, column: 14, scope: !634)
!653 = !DILocation(line: 154, column: 5, scope: !654)
!654 = distinct !DILexicalBlock(scope: !650, file: !242, line: 153, column: 28)
!655 = !DILocation(line: 155, column: 12, scope: !654)
!656 = !DILocation(line: 156, column: 22, scope: !654)
!657 = !DILocation(line: 156, column: 13, scope: !654)
!658 = !DILocation(line: 156, column: 51, scope: !654)
!659 = !DILocation(line: 155, column: 5, scope: !660)
!660 = !DILexicalBlockFile(scope: !654, file: !242, discriminator: 1)
!661 = !DILocation(line: 157, column: 3, scope: !654)
!662 = !DILocation(line: 158, column: 3, scope: !241)
!663 = !DILocation(line: 159, column: 15, scope: !241)
!664 = !DILocation(line: 161, column: 7, scope: !665)
!665 = distinct !DILexicalBlock(scope: !241, file: !242, line: 161, column: 7)
!666 = !DILocation(line: 161, column: 12, scope: !665)
!667 = !DILocation(line: 161, column: 18, scope: !665)
!668 = !DILocation(line: 161, column: 7, scope: !241)
!669 = !DILocation(line: 163, column: 17, scope: !665)
!670 = !DILocation(line: 162, column: 5, scope: !665)
!671 = !DILocation(line: 166, column: 3, scope: !241)
!672 = !DILocation(line: 167, column: 3, scope: !241)
!673 = !DILocation(line: 169, column: 7, scope: !674)
!674 = distinct !DILexicalBlock(scope: !241, file: !242, line: 169, column: 7)
!675 = !DILocation(line: 169, column: 7, scope: !241)
!676 = !DILocation(line: 170, column: 12, scope: !677)
!677 = distinct !DILexicalBlock(scope: !674, file: !242, line: 169, column: 16)
!678 = !DILocation(line: 171, column: 21, scope: !677)
!679 = !DILocation(line: 171, column: 12, scope: !677)
!680 = !DILocation(line: 172, column: 29, scope: !677)
!681 = !DILocation(line: 172, column: 34, scope: !677)
!682 = !DILocation(line: 172, column: 44, scope: !677)
!683 = !DILocation(line: 172, column: 12, scope: !677)
!684 = !DILocation(line: 170, column: 5, scope: !685)
!685 = !DILexicalBlockFile(scope: !677, file: !242, discriminator: 1)
!686 = !DILocation(line: 173, column: 20, scope: !677)
!687 = !DILocation(line: 173, column: 5, scope: !677)
!688 = !DILocation(line: 174, column: 5, scope: !677)
!689 = !DILocation(line: 174, column: 10, scope: !677)
!690 = !DILocation(line: 174, column: 22, scope: !677)
!691 = !DILocation(line: 174, column: 29, scope: !677)
!692 = !DILocation(line: 175, column: 5, scope: !677)
!693 = !DILocation(line: 178, column: 26, scope: !241)
!694 = !DILocation(line: 178, column: 3, scope: !241)
!695 = !DILocation(line: 182, column: 7, scope: !696)
!696 = distinct !DILexicalBlock(scope: !241, file: !242, line: 182, column: 7)
!697 = !DILocation(line: 182, column: 12, scope: !696)
!698 = !DILocation(line: 182, column: 19, scope: !696)
!699 = !DILocation(line: 182, column: 7, scope: !241)
!700 = !DILocation(line: 183, column: 12, scope: !701)
!701 = distinct !DILexicalBlock(scope: !696, file: !242, line: 182, column: 43)
!702 = !DILocation(line: 183, column: 56, scope: !701)
!703 = !DILocation(line: 183, column: 47, scope: !704)
!704 = !DILexicalBlockFile(scope: !701, file: !242, discriminator: 1)
!705 = !DILocation(line: 184, column: 29, scope: !701)
!706 = !DILocation(line: 184, column: 34, scope: !701)
!707 = !DILocation(line: 184, column: 44, scope: !701)
!708 = !DILocation(line: 184, column: 12, scope: !701)
!709 = !DILocation(line: 183, column: 5, scope: !710)
!710 = !DILexicalBlockFile(scope: !701, file: !242, discriminator: 2)
!711 = !DILocation(line: 185, column: 26, scope: !701)
!712 = !DILocation(line: 185, column: 32, scope: !701)
!713 = !DILocation(line: 185, column: 37, scope: !701)
!714 = !DILocation(line: 185, column: 5, scope: !701)
!715 = !DILocation(line: 186, column: 3, scope: !701)
!716 = !DILocation(line: 188, column: 35, scope: !241)
!717 = !DILocation(line: 188, column: 3, scope: !241)
!718 = !DILocation(line: 189, column: 7, scope: !719)
!719 = distinct !DILexicalBlock(scope: !241, file: !242, line: 189, column: 7)
!720 = !DILocation(line: 189, column: 12, scope: !719)
!721 = !DILocation(line: 189, column: 19, scope: !719)
!722 = !DILocation(line: 189, column: 7, scope: !241)
!723 = !DILocation(line: 192, column: 19, scope: !724)
!724 = distinct !DILexicalBlock(scope: !719, file: !242, line: 189, column: 47)
!725 = !DILocation(line: 192, column: 24, scope: !724)
!726 = !DILocation(line: 192, column: 17, scope: !724)
!727 = !DILocation(line: 193, column: 20, scope: !724)
!728 = !DILocation(line: 193, column: 5, scope: !724)
!729 = !DILocation(line: 194, column: 20, scope: !724)
!730 = !DILocation(line: 194, column: 5, scope: !724)
!731 = !DILocation(line: 196, column: 26, scope: !724)
!732 = !DILocation(line: 196, column: 18, scope: !724)
!733 = !DILocation(line: 195, column: 5, scope: !724)
!734 = !DILocation(line: 197, column: 27, scope: !724)
!735 = !DILocation(line: 197, column: 5, scope: !724)
!736 = !DILocation(line: 200, column: 20, scope: !724)
!737 = !DILocation(line: 200, column: 5, scope: !724)
!738 = !DILocation(line: 201, column: 3, scope: !724)
!739 = !DILocation(line: 203, column: 16, scope: !241)
!740 = !DILocation(line: 203, column: 3, scope: !241)
!741 = !DILocation(line: 204, column: 1, scope: !241)
!742 = !DILocation(line: 204, column: 1, scope: !743)
!743 = !DILexicalBlockFile(scope: !241, file: !242, discriminator: 1)
!744 = distinct !DISubprogram(name: "checkforremoval", scope: !242, file: !242, line: 53, type: !745, isLocal: true, isDefinition: true, scopeLine: 56, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !461)
!745 = !DISubroutineType(types: !746)
!746 = !{null, !245, !249, !747, !748}
!747 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !104, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !464, size: 64, align: 64)
!749 = !DILocalVariable(name: "pkgtoremove", arg: 1, scope: !744, file: !242, line: 53, type: !245)
!750 = !DILocation(line: 53, column: 45, scope: !744)
!751 = !DILocalVariable(name: "pkgdepcheck", arg: 2, scope: !744, file: !242, line: 54, type: !249)
!752 = !DILocation(line: 54, column: 44, scope: !744)
!753 = !DILocalVariable(name: "rokp", arg: 3, scope: !744, file: !242, line: 55, type: !747)
!754 = !DILocation(line: 55, column: 45, scope: !744)
!755 = !DILocalVariable(name: "raemsgs", arg: 4, scope: !744, file: !242, line: 55, type: !748)
!756 = !DILocation(line: 55, column: 66, scope: !744)
!757 = !DILocalVariable(name: "possi", scope: !744, file: !242, line: 57, type: !262)
!758 = !DILocation(line: 57, column: 20, scope: !744)
!759 = !DILocalVariable(name: "depender", scope: !744, file: !242, line: 58, type: !245)
!760 = !DILocation(line: 58, column: 19, scope: !744)
!761 = !DILocalVariable(name: "ok", scope: !744, file: !242, line: 59, type: !104)
!762 = !DILocation(line: 59, column: 18, scope: !744)
!763 = !DILocalVariable(name: "raemsgs_state", scope: !744, file: !242, line: 60, type: !764)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf_state", file: !465, line: 96, size: 64, align: 64, elements: !765)
!765 = !{!766}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !764, file: !465, line: 97, baseType: !468, size: 64, align: 64)
!767 = !DILocation(line: 60, column: 23, scope: !744)
!768 = !DILocation(line: 62, column: 16, scope: !769)
!769 = distinct !DILexicalBlock(scope: !744, file: !242, line: 62, column: 3)
!770 = !DILocation(line: 62, column: 29, scope: !769)
!771 = !DILocation(line: 62, column: 38, scope: !769)
!772 = !DILocation(line: 62, column: 14, scope: !769)
!773 = !DILocation(line: 62, column: 8, scope: !769)
!774 = !DILocation(line: 62, column: 49, scope: !775)
!775 = !DILexicalBlockFile(scope: !776, file: !242, discriminator: 1)
!776 = distinct !DILexicalBlock(scope: !769, file: !242, line: 62, column: 3)
!777 = !DILocation(line: 62, column: 3, scope: !775)
!778 = !DILocation(line: 63, column: 9, scope: !779)
!779 = distinct !DILexicalBlock(scope: !780, file: !242, line: 63, column: 9)
!780 = distinct !DILexicalBlock(scope: !776, file: !242, line: 62, column: 81)
!781 = !DILocation(line: 63, column: 16, scope: !779)
!782 = !DILocation(line: 63, column: 20, scope: !779)
!783 = !DILocation(line: 63, column: 25, scope: !779)
!784 = !DILocation(line: 63, column: 40, scope: !779)
!785 = !DILocation(line: 63, column: 43, scope: !786)
!786 = !DILexicalBlockFile(scope: !779, file: !242, discriminator: 1)
!787 = !DILocation(line: 63, column: 50, scope: !786)
!788 = !DILocation(line: 63, column: 54, scope: !786)
!789 = !DILocation(line: 63, column: 59, scope: !786)
!790 = !DILocation(line: 63, column: 9, scope: !786)
!791 = !DILocation(line: 63, column: 78, scope: !792)
!792 = !DILexicalBlockFile(scope: !779, file: !242, discriminator: 2)
!793 = !DILocation(line: 64, column: 15, scope: !780)
!794 = !DILocation(line: 64, column: 22, scope: !780)
!795 = !DILocation(line: 64, column: 26, scope: !780)
!796 = !DILocation(line: 64, column: 13, scope: !780)
!797 = !DILocation(line: 66, column: 20, scope: !780)
!798 = !DILocation(line: 66, column: 11, scope: !780)
!799 = !DILocation(line: 65, column: 5, scope: !780)
!800 = !DILocation(line: 67, column: 9, scope: !801)
!801 = distinct !DILexicalBlock(scope: !780, file: !242, line: 67, column: 9)
!802 = !DILocation(line: 67, column: 19, scope: !801)
!803 = !DILocation(line: 67, column: 26, scope: !801)
!804 = !DILocation(line: 67, column: 9, scope: !780)
!805 = !DILocation(line: 68, column: 7, scope: !801)
!806 = !DILocation(line: 69, column: 24, scope: !807)
!807 = distinct !DILexicalBlock(scope: !780, file: !242, line: 69, column: 9)
!808 = !DILocation(line: 69, column: 9, scope: !807)
!809 = !DILocation(line: 69, column: 9, scope: !780)
!810 = !DILocation(line: 71, column: 22, scope: !811)
!811 = distinct !DILexicalBlock(scope: !807, file: !242, line: 69, column: 35)
!812 = !DILocation(line: 71, column: 13, scope: !811)
!813 = !DILocation(line: 70, column: 7, scope: !811)
!814 = !DILocation(line: 72, column: 7, scope: !811)
!815 = !DILocation(line: 74, column: 9, scope: !816)
!816 = distinct !DILexicalBlock(scope: !780, file: !242, line: 74, column: 9)
!817 = !DILocation(line: 74, column: 19, scope: !816)
!818 = !DILocation(line: 74, column: 9, scope: !780)
!819 = !DILocation(line: 75, column: 26, scope: !820)
!820 = distinct !DILexicalBlock(scope: !821, file: !242, line: 75, column: 11)
!821 = distinct !DILexicalBlock(scope: !816, file: !242, line: 74, column: 41)
!822 = !DILocation(line: 75, column: 11, scope: !820)
!823 = !DILocation(line: 75, column: 11, scope: !821)
!824 = !DILocation(line: 76, column: 22, scope: !820)
!825 = !DILocation(line: 76, column: 9, scope: !820)
!826 = !DILocation(line: 77, column: 5, scope: !821)
!827 = !DILocation(line: 78, column: 21, scope: !780)
!828 = !DILocation(line: 78, column: 5, scope: !780)
!829 = !DILocation(line: 79, column: 25, scope: !780)
!830 = !DILocation(line: 79, column: 34, scope: !780)
!831 = !DILocation(line: 79, column: 46, scope: !780)
!832 = !DILocation(line: 79, column: 9, scope: !780)
!833 = !DILocation(line: 79, column: 7, scope: !780)
!834 = !DILocation(line: 80, column: 9, scope: !835)
!835 = distinct !DILexicalBlock(scope: !780, file: !242, line: 80, column: 9)
!836 = !DILocation(line: 80, column: 12, scope: !835)
!837 = !DILocation(line: 80, column: 30, scope: !835)
!838 = !DILocation(line: 81, column: 9, scope: !835)
!839 = !DILocation(line: 81, column: 19, scope: !835)
!840 = !DILocation(line: 81, column: 30, scope: !835)
!841 = !DILocation(line: 82, column: 9, scope: !835)
!842 = !DILocation(line: 82, column: 19, scope: !835)
!843 = !DILocation(line: 82, column: 31, scope: !835)
!844 = !DILocation(line: 82, column: 38, scope: !835)
!845 = !DILocation(line: 80, column: 9, scope: !846)
!846 = !DILexicalBlockFile(scope: !780, file: !242, discriminator: 1)
!847 = !DILocation(line: 83, column: 10, scope: !835)
!848 = !DILocation(line: 83, column: 7, scope: !835)
!849 = !DILocation(line: 84, column: 9, scope: !850)
!850 = distinct !DILexicalBlock(scope: !780, file: !242, line: 84, column: 9)
!851 = !DILocation(line: 84, column: 12, scope: !850)
!852 = !DILocation(line: 84, column: 9, scope: !780)
!853 = !DILocation(line: 86, column: 23, scope: !850)
!854 = !DILocation(line: 86, column: 7, scope: !850)
!855 = !DILocation(line: 87, column: 9, scope: !856)
!856 = distinct !DILexicalBlock(scope: !780, file: !242, line: 87, column: 9)
!857 = !DILocation(line: 87, column: 15, scope: !856)
!858 = !DILocation(line: 87, column: 14, scope: !856)
!859 = !DILocation(line: 87, column: 12, scope: !856)
!860 = !DILocation(line: 87, column: 9, scope: !780)
!861 = !DILocation(line: 87, column: 28, scope: !862)
!862 = !DILexicalBlockFile(scope: !856, file: !242, discriminator: 1)
!863 = !DILocation(line: 87, column: 22, scope: !862)
!864 = !DILocation(line: 87, column: 26, scope: !862)
!865 = !DILocation(line: 87, column: 21, scope: !862)
!866 = !DILocation(line: 88, column: 3, scope: !780)
!867 = !DILocation(line: 62, column: 64, scope: !868)
!868 = !DILexicalBlockFile(scope: !776, file: !242, discriminator: 2)
!869 = !DILocation(line: 62, column: 71, scope: !868)
!870 = !DILocation(line: 62, column: 62, scope: !868)
!871 = !DILocation(line: 62, column: 3, scope: !868)
!872 = distinct !{!872, !873}
!873 = !DILocation(line: 62, column: 3, scope: !744)
!874 = !DILocation(line: 89, column: 1, scope: !744)
!875 = distinct !DISubprogram(name: "removal_bulk", scope: !242, file: !242, line: 628, type: !243, isLocal: false, isDefinition: true, scopeLine: 628, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !461)
!876 = !DILocalVariable(name: "pkg", arg: 1, scope: !875, file: !242, line: 628, type: !245)
!877 = !DILocation(line: 628, column: 35, scope: !875)
!878 = !DILocalVariable(name: "foundpostrm", scope: !875, file: !242, line: 629, type: !295)
!879 = !DILocation(line: 629, column: 7, scope: !875)
!880 = !DILocation(line: 631, column: 58, scope: !875)
!881 = !DILocation(line: 631, column: 49, scope: !875)
!882 = !DILocation(line: 631, column: 3, scope: !883)
!883 = !DILexicalBlockFile(scope: !875, file: !242, discriminator: 1)
!884 = !DILocation(line: 633, column: 7, scope: !885)
!885 = distinct !DILexicalBlock(scope: !875, file: !242, line: 633, column: 7)
!886 = !DILocation(line: 633, column: 12, scope: !885)
!887 = !DILocation(line: 633, column: 19, scope: !885)
!888 = !DILocation(line: 633, column: 45, scope: !885)
!889 = !DILocation(line: 634, column: 7, scope: !885)
!890 = !DILocation(line: 634, column: 12, scope: !885)
!891 = !DILocation(line: 634, column: 19, scope: !885)
!892 = !DILocation(line: 633, column: 7, scope: !883)
!893 = !DILocation(line: 635, column: 31, scope: !894)
!894 = distinct !DILexicalBlock(scope: !885, file: !242, line: 634, column: 41)
!895 = !DILocation(line: 635, column: 5, scope: !894)
!896 = !DILocation(line: 636, column: 3, scope: !894)
!897 = !DILocation(line: 638, column: 37, scope: !875)
!898 = !DILocation(line: 638, column: 43, scope: !875)
!899 = !DILocation(line: 638, column: 48, scope: !875)
!900 = !DILocation(line: 638, column: 17, scope: !875)
!901 = !DILocation(line: 638, column: 15, scope: !875)
!902 = !DILocation(line: 640, column: 61, scope: !875)
!903 = !DILocation(line: 640, column: 3, scope: !875)
!904 = !DILocation(line: 642, column: 8, scope: !905)
!905 = distinct !DILexicalBlock(scope: !875, file: !242, line: 642, column: 7)
!906 = !DILocation(line: 642, column: 20, scope: !905)
!907 = !DILocation(line: 642, column: 24, scope: !908)
!908 = !DILexicalBlockFile(scope: !905, file: !242, discriminator: 1)
!909 = !DILocation(line: 642, column: 29, scope: !908)
!910 = !DILocation(line: 642, column: 39, scope: !908)
!911 = !DILocation(line: 642, column: 7, scope: !908)
!912 = !DILocation(line: 645, column: 5, scope: !913)
!913 = distinct !DILexicalBlock(scope: !905, file: !242, line: 642, column: 50)
!914 = !DILocation(line: 647, column: 18, scope: !913)
!915 = !DILocation(line: 647, column: 5, scope: !913)
!916 = !DILocation(line: 648, column: 25, scope: !913)
!917 = !DILocation(line: 648, column: 30, scope: !913)
!918 = !DILocation(line: 648, column: 5, scope: !913)
!919 = !DILocation(line: 649, column: 3, scope: !913)
!920 = !DILocation(line: 649, column: 14, scope: !921)
!921 = !DILexicalBlockFile(scope: !922, file: !242, discriminator: 1)
!922 = distinct !DILexicalBlock(scope: !905, file: !242, line: 649, column: 14)
!923 = !DILocation(line: 649, column: 19, scope: !921)
!924 = !DILocation(line: 649, column: 24, scope: !921)
!925 = !DILocation(line: 651, column: 37, scope: !926)
!926 = distinct !DILexicalBlock(scope: !922, file: !242, line: 649, column: 43)
!927 = !DILocation(line: 651, column: 5, scope: !926)
!928 = !DILocation(line: 653, column: 3, scope: !926)
!929 = !DILocation(line: 656, column: 7, scope: !930)
!930 = distinct !DILexicalBlock(scope: !875, file: !242, line: 656, column: 7)
!931 = !DILocation(line: 656, column: 12, scope: !930)
!932 = !DILocation(line: 656, column: 17, scope: !930)
!933 = !DILocation(line: 656, column: 7, scope: !875)
!934 = !DILocalVariable(name: "filename", scope: !935, file: !242, line: 657, type: !254)
!935 = distinct !DILexicalBlock(scope: !930, file: !242, line: 656, column: 36)
!936 = !DILocation(line: 657, column: 17, scope: !935)
!937 = !DILocation(line: 660, column: 39, scope: !935)
!938 = !DILocation(line: 660, column: 5, scope: !935)
!939 = !DILocation(line: 662, column: 36, scope: !935)
!940 = !DILocation(line: 662, column: 42, scope: !935)
!941 = !DILocation(line: 662, column: 47, scope: !935)
!942 = !DILocation(line: 662, column: 16, scope: !935)
!943 = !DILocation(line: 662, column: 14, scope: !935)
!944 = !DILocation(line: 664, column: 11, scope: !935)
!945 = !DILocation(line: 663, column: 5, scope: !935)
!946 = !DILocation(line: 665, column: 16, scope: !947)
!947 = distinct !DILexicalBlock(scope: !935, file: !242, line: 665, column: 9)
!948 = !DILocation(line: 665, column: 9, scope: !947)
!949 = !DILocation(line: 665, column: 26, scope: !947)
!950 = !DILocation(line: 665, column: 30, scope: !951)
!951 = !DILexicalBlockFile(scope: !947, file: !242, discriminator: 1)
!952 = !DILocation(line: 665, column: 29, scope: !951)
!953 = !DILocation(line: 665, column: 34, scope: !951)
!954 = !DILocation(line: 665, column: 9, scope: !951)
!955 = !DILocation(line: 666, column: 15, scope: !947)
!956 = !DILocation(line: 666, column: 7, scope: !951)
!957 = !DILocation(line: 666, column: 7, scope: !947)
!958 = !DILocation(line: 668, column: 36, scope: !935)
!959 = !DILocation(line: 668, column: 42, scope: !935)
!960 = !DILocation(line: 668, column: 47, scope: !935)
!961 = !DILocation(line: 668, column: 16, scope: !935)
!962 = !DILocation(line: 668, column: 14, scope: !935)
!963 = !DILocation(line: 670, column: 11, scope: !935)
!964 = !DILocation(line: 669, column: 5, scope: !935)
!965 = !DILocation(line: 671, column: 16, scope: !966)
!966 = distinct !DILexicalBlock(scope: !935, file: !242, line: 671, column: 9)
!967 = !DILocation(line: 671, column: 9, scope: !966)
!968 = !DILocation(line: 671, column: 26, scope: !966)
!969 = !DILocation(line: 671, column: 30, scope: !970)
!970 = !DILexicalBlockFile(scope: !966, file: !242, discriminator: 1)
!971 = !DILocation(line: 671, column: 29, scope: !970)
!972 = !DILocation(line: 671, column: 34, scope: !970)
!973 = !DILocation(line: 671, column: 9, scope: !970)
!974 = !DILocation(line: 672, column: 15, scope: !966)
!975 = !DILocation(line: 672, column: 7, scope: !970)
!976 = !DILocation(line: 672, column: 7, scope: !966)
!977 = !DILocation(line: 674, column: 20, scope: !935)
!978 = !DILocation(line: 674, column: 5, scope: !935)
!979 = !DILocation(line: 675, column: 18, scope: !935)
!980 = !DILocation(line: 675, column: 5, scope: !935)
!981 = !DILocation(line: 679, column: 19, scope: !935)
!982 = !DILocation(line: 679, column: 24, scope: !935)
!983 = !DILocation(line: 679, column: 5, scope: !935)
!984 = !DILocation(line: 680, column: 3, scope: !935)
!985 = !DILocation(line: 682, column: 20, scope: !875)
!986 = !DILocation(line: 682, column: 3, scope: !875)
!987 = !DILocation(line: 683, column: 18, scope: !875)
!988 = !DILocation(line: 683, column: 3, scope: !875)
!989 = !DILocation(line: 685, column: 3, scope: !875)
!990 = !DILocation(line: 686, column: 1, scope: !875)
!991 = !DILocalVariable(name: "pkg", arg: 1, scope: !463, file: !242, line: 262, type: !245)
!992 = !DILocation(line: 262, column: 43, scope: !463)
!993 = !DILocalVariable(name: "rev_iter", scope: !463, file: !242, line: 264, type: !994)
!994 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_hash_rev_iter", file: !92, line: 188, size: 64, align: 64, elements: !995)
!995 = !{!996}
!996 = !DIDerivedType(tag: DW_TAG_member, name: "todo", scope: !994, file: !92, line: 189, baseType: !388, size: 64, align: 64)
!997 = !DILocation(line: 264, column: 29, scope: !463)
!998 = !DILocalVariable(name: "leftover", scope: !463, file: !242, line: 265, type: !388)
!999 = !DILocation(line: 265, column: 30, scope: !463)
!1000 = !DILocalVariable(name: "namenode", scope: !463, file: !242, line: 266, type: !393)
!1001 = !DILocation(line: 266, column: 25, scope: !463)
!1002 = !DILocalVariable(name: "fnvb_state", scope: !463, file: !242, line: 268, type: !764)
!1003 = !DILocation(line: 268, column: 23, scope: !463)
!1004 = !DILocalVariable(name: "stab", scope: !463, file: !242, line: 269, type: !1005)
!1005 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !1006, line: 46, size: 1152, align: 64, elements: !1007)
!1006 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!1007 = !{!1008, !1009, !1010, !1012, !1013, !1014, !1015, !1016, !1017, !1018, !1020, !1022, !1030, !1031, !1032}
!1008 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !1005, file: !1006, line: 48, baseType: !450, size: 64, align: 64)
!1009 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !1005, file: !1006, line: 53, baseType: !454, size: 64, align: 64, offset: 64)
!1010 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !1005, file: !1006, line: 61, baseType: !1011, size: 64, align: 64, offset: 128)
!1011 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !416, line: 130, baseType: !451)
!1012 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !1005, file: !1006, line: 62, baseType: !422, size: 32, align: 32, offset: 192)
!1013 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !1005, file: !1006, line: 64, baseType: !415, size: 32, align: 32, offset: 224)
!1014 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !1005, file: !1006, line: 65, baseType: !419, size: 32, align: 32, offset: 256)
!1015 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !1005, file: !1006, line: 67, baseType: !299, size: 32, align: 32, offset: 288)
!1016 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !1005, file: !1006, line: 69, baseType: !450, size: 64, align: 64, offset: 320)
!1017 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !1005, file: !1006, line: 74, baseType: !457, size: 64, align: 64, offset: 384)
!1018 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !1005, file: !1006, line: 78, baseType: !1019, size: 64, align: 64, offset: 448)
!1019 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !416, line: 153, baseType: !458)
!1020 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !1005, file: !1006, line: 80, baseType: !1021, size: 64, align: 64, offset: 512)
!1021 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !416, line: 158, baseType: !458)
!1022 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !1005, file: !1006, line: 91, baseType: !1023, size: 128, align: 64, offset: 576)
!1023 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !1024, line: 120, size: 128, align: 64, elements: !1025)
!1024 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!1025 = !{!1026, !1028}
!1026 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !1023, file: !1024, line: 122, baseType: !1027, size: 64, align: 64)
!1027 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !416, line: 139, baseType: !458)
!1028 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !1023, file: !1024, line: 123, baseType: !1029, size: 64, align: 64, offset: 64)
!1029 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !416, line: 175, baseType: !458)
!1030 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !1005, file: !1006, line: 92, baseType: !1023, size: 128, align: 64, offset: 704)
!1031 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !1005, file: !1006, line: 93, baseType: !1023, size: 128, align: 64, offset: 832)
!1032 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !1005, file: !1006, line: 106, baseType: !1033, size: 192, align: 64, offset: 960)
!1033 = !DICompositeType(tag: DW_TAG_array_type, baseType: !1029, size: 192, align: 64, elements: !1034)
!1034 = !{!1035}
!1035 = !DISubrange(count: 3)
!1036 = !DILocation(line: 269, column: 15, scope: !463)
!1037 = !DILocation(line: 271, column: 20, scope: !463)
!1038 = !DILocation(line: 271, column: 5, scope: !463)
!1039 = !DILocation(line: 272, column: 20, scope: !463)
!1040 = !DILocation(line: 272, column: 5, scope: !463)
!1041 = !DILocation(line: 273, column: 5, scope: !463)
!1042 = !DILocation(line: 275, column: 40, scope: !463)
!1043 = !DILocation(line: 275, column: 45, scope: !463)
!1044 = !DILocation(line: 275, column: 5, scope: !463)
!1045 = !DILocation(line: 276, column: 14, scope: !463)
!1046 = !DILocation(line: 277, column: 5, scope: !463)
!1047 = !DILocation(line: 277, column: 24, scope: !1048)
!1048 = !DILexicalBlockFile(scope: !463, file: !242, discriminator: 1)
!1049 = !DILocation(line: 277, column: 22, scope: !1048)
!1050 = !DILocation(line: 277, column: 5, scope: !1048)
!1051 = !DILocalVariable(name: "usenode", scope: !1052, file: !242, line: 278, type: !393)
!1052 = distinct !DILexicalBlock(scope: !463, file: !242, line: 277, column: 61)
!1053 = !DILocation(line: 278, column: 29, scope: !1052)
!1054 = !DILocalVariable(name: "is_dir", scope: !1052, file: !242, line: 279, type: !295)
!1055 = !DILocation(line: 279, column: 11, scope: !1052)
!1056 = !DILocation(line: 282, column: 13, scope: !1052)
!1057 = !DILocation(line: 282, column: 23, scope: !1052)
!1058 = !DILocation(line: 282, column: 29, scope: !1052)
!1059 = !DILocation(line: 282, column: 39, scope: !1052)
!1060 = !DILocation(line: 281, column: 7, scope: !1052)
!1061 = !DILocation(line: 284, column: 31, scope: !1052)
!1062 = !DILocation(line: 284, column: 41, scope: !1052)
!1063 = !DILocation(line: 284, column: 47, scope: !1052)
!1064 = !DILocation(line: 284, column: 52, scope: !1052)
!1065 = !DILocation(line: 284, column: 17, scope: !1052)
!1066 = !DILocation(line: 284, column: 15, scope: !1052)
!1067 = !DILocation(line: 286, column: 7, scope: !1052)
!1068 = !DILocation(line: 287, column: 29, scope: !1052)
!1069 = !DILocation(line: 287, column: 45, scope: !1052)
!1070 = !DILocation(line: 287, column: 38, scope: !1052)
!1071 = !DILocation(line: 287, column: 7, scope: !1072)
!1072 = !DILexicalBlockFile(scope: !1052, file: !242, discriminator: 1)
!1073 = !DILocation(line: 288, column: 29, scope: !1052)
!1074 = !DILocation(line: 288, column: 38, scope: !1052)
!1075 = !DILocation(line: 288, column: 51, scope: !1052)
!1076 = !DILocation(line: 288, column: 60, scope: !1052)
!1077 = !DILocation(line: 288, column: 44, scope: !1052)
!1078 = !DILocation(line: 288, column: 7, scope: !1072)
!1079 = !DILocation(line: 289, column: 7, scope: !1052)
!1080 = !DILocation(line: 290, column: 7, scope: !1052)
!1081 = !DILocation(line: 292, column: 26, scope: !1052)
!1082 = !DILocation(line: 292, column: 16, scope: !1052)
!1083 = !DILocation(line: 292, column: 38, scope: !1052)
!1084 = !DILocation(line: 292, column: 43, scope: !1052)
!1085 = !DILocation(line: 292, column: 50, scope: !1072)
!1086 = !DILocation(line: 292, column: 48, scope: !1072)
!1087 = !DILocation(line: 292, column: 59, scope: !1072)
!1088 = !DILocation(line: 292, column: 14, scope: !1089)
!1089 = !DILexicalBlockFile(scope: !1052, file: !242, discriminator: 2)
!1090 = !DILocation(line: 297, column: 12, scope: !1091)
!1091 = distinct !DILexicalBlock(scope: !1052, file: !242, line: 297, column: 11)
!1092 = !DILocation(line: 297, column: 19, scope: !1091)
!1093 = !DILocation(line: 297, column: 50, scope: !1094)
!1094 = !DILexicalBlockFile(scope: !1091, file: !242, discriminator: 1)
!1095 = !DILocation(line: 297, column: 55, scope: !1094)
!1096 = !DILocation(line: 297, column: 22, scope: !1094)
!1097 = !DILocation(line: 297, column: 11, scope: !1094)
!1098 = !DILocation(line: 298, column: 9, scope: !1091)
!1099 = distinct !{!1099, !1046}
!1100 = !DILocation(line: 301, column: 11, scope: !1101)
!1101 = distinct !DILexicalBlock(scope: !1052, file: !242, line: 301, column: 11)
!1102 = !DILocation(line: 301, column: 21, scope: !1101)
!1103 = !DILocation(line: 301, column: 27, scope: !1101)
!1104 = !DILocation(line: 301, column: 11, scope: !1052)
!1105 = !DILocation(line: 302, column: 34, scope: !1106)
!1106 = distinct !DILexicalBlock(scope: !1101, file: !242, line: 301, column: 45)
!1107 = !DILocation(line: 302, column: 9, scope: !1106)
!1108 = !DILocation(line: 303, column: 9, scope: !1106)
!1109 = !DILocation(line: 306, column: 11, scope: !1110)
!1110 = distinct !DILexicalBlock(scope: !1052, file: !242, line: 306, column: 11)
!1111 = !DILocation(line: 306, column: 11, scope: !1052)
!1112 = !DILocation(line: 307, column: 9, scope: !1113)
!1113 = distinct !DILexicalBlock(scope: !1110, file: !242, line: 306, column: 19)
!1114 = !DILocation(line: 311, column: 31, scope: !1115)
!1115 = distinct !DILexicalBlock(scope: !1113, file: !242, line: 311, column: 13)
!1116 = !DILocation(line: 311, column: 41, scope: !1115)
!1117 = !DILocation(line: 311, column: 13, scope: !1115)
!1118 = !DILocation(line: 311, column: 13, scope: !1113)
!1119 = !DILocation(line: 312, column: 28, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !1115, file: !242, line: 311, column: 47)
!1121 = !DILocation(line: 312, column: 4, scope: !1120)
!1122 = !DILocation(line: 313, column: 4, scope: !1120)
!1123 = !DILocation(line: 315, column: 32, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1113, file: !242, line: 315, column: 13)
!1125 = !DILocation(line: 315, column: 42, scope: !1124)
!1126 = !DILocation(line: 315, column: 47, scope: !1124)
!1127 = !DILocation(line: 315, column: 13, scope: !1124)
!1128 = !DILocation(line: 315, column: 13, scope: !1113)
!1129 = !DILocation(line: 316, column: 36, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1124, file: !242, line: 315, column: 58)
!1131 = !DILocation(line: 316, column: 11, scope: !1130)
!1132 = !DILocation(line: 317, column: 11, scope: !1130)
!1133 = !DILocation(line: 319, column: 35, scope: !1134)
!1134 = distinct !DILexicalBlock(scope: !1113, file: !242, line: 319, column: 13)
!1135 = !DILocation(line: 319, column: 45, scope: !1134)
!1136 = !DILocation(line: 319, column: 13, scope: !1134)
!1137 = !DILocation(line: 319, column: 13, scope: !1113)
!1138 = !DILocation(line: 320, column: 11, scope: !1134)
!1139 = !DILocation(line: 322, column: 20, scope: !1140)
!1140 = distinct !DILexicalBlock(scope: !1113, file: !242, line: 322, column: 13)
!1141 = !DILocation(line: 322, column: 29, scope: !1140)
!1142 = !DILocation(line: 322, column: 13, scope: !1140)
!1143 = !DILocation(line: 322, column: 41, scope: !1140)
!1144 = !DILocation(line: 322, column: 13, scope: !1113)
!1145 = !DILocation(line: 324, column: 73, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1140, file: !242, line: 322, column: 47)
!1147 = !DILocation(line: 323, column: 11, scope: !1146)
!1148 = !DILocation(line: 325, column: 36, scope: !1146)
!1149 = !DILocation(line: 325, column: 11, scope: !1146)
!1150 = !DILocation(line: 326, column: 11, scope: !1146)
!1151 = !DILocation(line: 328, column: 7, scope: !1113)
!1152 = !DILocation(line: 330, column: 26, scope: !1052)
!1153 = !DILocation(line: 330, column: 35, scope: !1052)
!1154 = !DILocation(line: 330, column: 7, scope: !1052)
!1155 = !DILocation(line: 332, column: 7, scope: !1052)
!1156 = !DILocation(line: 333, column: 7, scope: !1052)
!1157 = !DILocation(line: 334, column: 7, scope: !1052)
!1158 = !DILocation(line: 335, column: 73, scope: !1052)
!1159 = !DILocation(line: 335, column: 7, scope: !1052)
!1160 = !DILocation(line: 336, column: 29, scope: !1052)
!1161 = !DILocation(line: 336, column: 7, scope: !1052)
!1162 = !DILocation(line: 338, column: 7, scope: !1052)
!1163 = !DILocation(line: 339, column: 7, scope: !1052)
!1164 = !DILocation(line: 340, column: 7, scope: !1052)
!1165 = !DILocation(line: 341, column: 72, scope: !1052)
!1166 = !DILocation(line: 341, column: 7, scope: !1052)
!1167 = !DILocation(line: 342, column: 29, scope: !1052)
!1168 = !DILocation(line: 342, column: 7, scope: !1052)
!1169 = !DILocation(line: 344, column: 7, scope: !1052)
!1170 = !DILocation(line: 345, column: 7, scope: !1052)
!1171 = !DILocation(line: 347, column: 68, scope: !1052)
!1172 = !DILocation(line: 347, column: 7, scope: !1052)
!1173 = !DILocation(line: 348, column: 23, scope: !1174)
!1174 = distinct !DILexicalBlock(scope: !1052, file: !242, line: 348, column: 11)
!1175 = !DILocation(line: 348, column: 12, scope: !1174)
!1176 = !DILocation(line: 348, column: 28, scope: !1174)
!1177 = !DILocation(line: 348, column: 32, scope: !1178)
!1178 = !DILexicalBlockFile(scope: !1174, file: !242, discriminator: 1)
!1179 = !DILocation(line: 348, column: 31, scope: !1178)
!1180 = !DILocation(line: 348, column: 36, scope: !1178)
!1181 = !DILocation(line: 348, column: 46, scope: !1178)
!1182 = !DILocation(line: 348, column: 51, scope: !1183)
!1183 = !DILexicalBlockFile(scope: !1174, file: !242, discriminator: 2)
!1184 = !DILocation(line: 348, column: 50, scope: !1183)
!1185 = !DILocation(line: 348, column: 55, scope: !1183)
!1186 = !DILocation(line: 348, column: 11, scope: !1183)
!1187 = !DILocation(line: 348, column: 65, scope: !1188)
!1188 = !DILexicalBlockFile(scope: !1174, file: !242, discriminator: 3)
!1189 = !DILocation(line: 349, column: 12, scope: !1190)
!1190 = distinct !DILexicalBlock(scope: !1052, file: !242, line: 349, column: 10)
!1191 = !DILocation(line: 349, column: 11, scope: !1190)
!1192 = !DILocation(line: 349, column: 16, scope: !1190)
!1193 = !DILocation(line: 349, column: 29, scope: !1190)
!1194 = !DILocation(line: 349, column: 34, scope: !1195)
!1195 = !DILexicalBlockFile(scope: !1190, file: !242, discriminator: 1)
!1196 = !DILocation(line: 349, column: 33, scope: !1195)
!1197 = !DILocation(line: 349, column: 38, scope: !1195)
!1198 = !DILocation(line: 349, column: 10, scope: !1195)
!1199 = !DILocation(line: 352, column: 13, scope: !1200)
!1200 = distinct !DILexicalBlock(scope: !1190, file: !242, line: 349, column: 49)
!1201 = !DILocation(line: 350, column: 9, scope: !1200)
!1202 = !DILocation(line: 353, column: 33, scope: !1200)
!1203 = !DILocation(line: 353, column: 9, scope: !1200)
!1204 = !DILocation(line: 354, column: 9, scope: !1200)
!1205 = !DILocation(line: 355, column: 19, scope: !1206)
!1206 = distinct !DILexicalBlock(scope: !1190, file: !242, line: 355, column: 17)
!1207 = !DILocation(line: 355, column: 18, scope: !1206)
!1208 = !DILocation(line: 355, column: 23, scope: !1206)
!1209 = !DILocation(line: 355, column: 32, scope: !1206)
!1210 = !DILocation(line: 355, column: 37, scope: !1211)
!1211 = !DILexicalBlockFile(scope: !1206, file: !242, discriminator: 1)
!1212 = !DILocation(line: 355, column: 36, scope: !1211)
!1213 = !DILocation(line: 355, column: 41, scope: !1211)
!1214 = !DILocation(line: 355, column: 17, scope: !1211)
!1215 = !DILocation(line: 356, column: 17, scope: !1216)
!1216 = distinct !DILexicalBlock(scope: !1206, file: !242, line: 355, column: 51)
!1217 = !DILocation(line: 358, column: 26, scope: !1216)
!1218 = !DILocation(line: 358, column: 17, scope: !1216)
!1219 = !DILocation(line: 358, column: 47, scope: !1216)
!1220 = !DILocation(line: 358, column: 57, scope: !1216)
!1221 = !DILocation(line: 358, column: 73, scope: !1222)
!1222 = !DILexicalBlockFile(scope: !1216, file: !242, discriminator: 1)
!1223 = !DILocation(line: 358, column: 72, scope: !1216)
!1224 = !DILocation(line: 358, column: 63, scope: !1225)
!1225 = !DILexicalBlockFile(scope: !1216, file: !242, discriminator: 2)
!1226 = !DILocation(line: 356, column: 9, scope: !1222)
!1227 = !DILocation(line: 359, column: 33, scope: !1216)
!1228 = !DILocation(line: 359, column: 9, scope: !1216)
!1229 = !DILocation(line: 360, column: 9, scope: !1216)
!1230 = !DILocation(line: 362, column: 12, scope: !1231)
!1231 = distinct !DILexicalBlock(scope: !1052, file: !242, line: 362, column: 10)
!1232 = !DILocation(line: 362, column: 11, scope: !1231)
!1233 = !DILocation(line: 362, column: 16, scope: !1231)
!1234 = !DILocation(line: 362, column: 10, scope: !1052)
!1235 = !DILocation(line: 363, column: 17, scope: !1231)
!1236 = !DILocation(line: 363, column: 57, scope: !1231)
!1237 = !DILocation(line: 363, column: 9, scope: !1238)
!1238 = !DILexicalBlockFile(scope: !1231, file: !242, discriminator: 1)
!1239 = !DILocation(line: 363, column: 9, scope: !1231)
!1240 = !DILocation(line: 364, column: 69, scope: !1052)
!1241 = !DILocation(line: 364, column: 7, scope: !1052)
!1242 = !DILocation(line: 365, column: 30, scope: !1243)
!1243 = distinct !DILexicalBlock(scope: !1052, file: !242, line: 365, column: 11)
!1244 = !DILocation(line: 365, column: 11, scope: !1243)
!1245 = !DILocation(line: 365, column: 11, scope: !1052)
!1246 = !DILocation(line: 366, column: 17, scope: !1243)
!1247 = !DILocation(line: 366, column: 69, scope: !1243)
!1248 = !DILocation(line: 366, column: 9, scope: !1249)
!1249 = !DILexicalBlockFile(scope: !1243, file: !242, discriminator: 1)
!1250 = !DILocation(line: 366, column: 9, scope: !1243)
!1251 = !DILocation(line: 277, column: 5, scope: !1252)
!1252 = !DILexicalBlockFile(scope: !463, file: !242, discriminator: 2)
!1253 = !DILocation(line: 368, column: 27, scope: !463)
!1254 = !DILocation(line: 368, column: 33, scope: !463)
!1255 = !DILocation(line: 368, column: 38, scope: !463)
!1256 = !DILocation(line: 368, column: 49, scope: !463)
!1257 = !DILocation(line: 368, column: 5, scope: !463)
!1258 = !DILocation(line: 369, column: 27, scope: !463)
!1259 = !DILocation(line: 369, column: 5, scope: !463)
!1260 = !DILocation(line: 371, column: 39, scope: !463)
!1261 = !DILocation(line: 371, column: 45, scope: !463)
!1262 = !DILocation(line: 371, column: 50, scope: !463)
!1263 = !DILocation(line: 371, column: 19, scope: !463)
!1264 = !DILocation(line: 372, column: 51, scope: !463)
!1265 = !DILocation(line: 372, column: 57, scope: !463)
!1266 = !DILocation(line: 372, column: 62, scope: !463)
!1267 = !DILocation(line: 371, column: 5, scope: !1048)
!1268 = !DILocation(line: 373, column: 5, scope: !463)
!1269 = !DILocation(line: 375, column: 5, scope: !463)
!1270 = !DILocation(line: 376, column: 24, scope: !463)
!1271 = !DILocation(line: 376, column: 30, scope: !463)
!1272 = !DILocation(line: 376, column: 35, scope: !463)
!1273 = !DILocation(line: 376, column: 5, scope: !463)
!1274 = !DILocation(line: 377, column: 19, scope: !463)
!1275 = !DILocation(line: 377, column: 5, scope: !1048)
!1276 = !DILocation(line: 379, column: 20, scope: !463)
!1277 = !DILocation(line: 379, column: 5, scope: !463)
!1278 = !DILocation(line: 380, column: 5, scope: !463)
!1279 = !DILocation(line: 380, column: 10, scope: !463)
!1280 = !DILocation(line: 380, column: 20, scope: !463)
!1281 = !DILocation(line: 380, column: 30, scope: !463)
!1282 = !DILocation(line: 381, column: 20, scope: !463)
!1283 = !DILocation(line: 381, column: 5, scope: !463)
!1284 = !DILocation(line: 382, column: 5, scope: !463)
!1285 = !DILocation(line: 383, column: 1, scope: !463)
!1286 = !DILocalVariable(name: "pkg", arg: 1, scope: !473, file: !242, line: 477, type: !245)
!1287 = !DILocation(line: 477, column: 61, scope: !473)
!1288 = !DILocalVariable(name: "rc", scope: !473, file: !242, line: 479, type: !299)
!1289 = !DILocation(line: 479, column: 7, scope: !473)
!1290 = !DILocalVariable(name: "conffnameused", scope: !473, file: !242, line: 480, type: !299)
!1291 = !DILocation(line: 480, column: 7, scope: !473)
!1292 = !DILocalVariable(name: "conffbasenamelen", scope: !473, file: !242, line: 480, type: !299)
!1293 = !DILocation(line: 480, column: 22, scope: !473)
!1294 = !DILocalVariable(name: "conffbasename", scope: !473, file: !242, line: 481, type: !424)
!1295 = !DILocation(line: 481, column: 9, scope: !473)
!1296 = !DILocalVariable(name: "conff", scope: !473, file: !242, line: 482, type: !324)
!1297 = !DILocation(line: 482, column: 20, scope: !473)
!1298 = !DILocalVariable(name: "lconffp", scope: !473, file: !242, line: 482, type: !1299)
!1299 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!1300 = !DILocation(line: 482, column: 29, scope: !473)
!1301 = !DILocalVariable(name: "searchfile", scope: !473, file: !242, line: 483, type: !388)
!1302 = !DILocation(line: 483, column: 30, scope: !473)
!1303 = !DILocalVariable(name: "dsd", scope: !473, file: !242, line: 484, type: !1304)
!1304 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1305, size: 64, align: 64)
!1305 = !DIDerivedType(tag: DW_TAG_typedef, name: "DIR", file: !1306, line: 127, baseType: !1307)
!1306 = !DIFile(filename: "/usr/include/dirent.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!1307 = !DICompositeType(tag: DW_TAG_structure_type, name: "__dirstream", file: !1306, line: 127, flags: DIFlagFwdDecl)
!1308 = !DILocation(line: 484, column: 8, scope: !473)
!1309 = !DILocalVariable(name: "de", scope: !473, file: !242, line: 485, type: !1310)
!1310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !1311, size: 64, align: 64)
!1311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !1312, line: 22, size: 2240, align: 64, elements: !1313)
!1312 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!1313 = !{!1314, !1315, !1316, !1318, !1320}
!1314 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !1311, file: !1312, line: 25, baseType: !454, size: 64, align: 64)
!1315 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !1311, file: !1312, line: 26, baseType: !457, size: 64, align: 64, offset: 64)
!1316 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !1311, file: !1312, line: 31, baseType: !1317, size: 16, align: 16, offset: 128)
!1317 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!1318 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !1311, file: !1312, line: 32, baseType: !1319, size: 8, align: 8, offset: 144)
!1319 = !DIBasicType(name: "unsigned char", size: 8, align: 8, encoding: DW_ATE_unsigned_char)
!1320 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !1311, file: !1312, line: 33, baseType: !1321, size: 2048, align: 8, offset: 152)
!1321 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 2048, align: 8, elements: !1322)
!1322 = !{!1323}
!1323 = !DISubrange(count: 256)
!1324 = !DILocation(line: 485, column: 18, scope: !473)
!1325 = !DILocalVariable(name: "p", scope: !473, file: !242, line: 486, type: !424)
!1326 = !DILocation(line: 486, column: 9, scope: !473)
!1327 = !DILocalVariable(name: "ext", scope: !473, file: !242, line: 487, type: !1328)
!1328 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !475, size: 64, align: 64)
!1329 = !DILocation(line: 487, column: 22, scope: !473)
!1330 = !DILocation(line: 489, column: 12, scope: !473)
!1331 = !DILocation(line: 490, column: 21, scope: !473)
!1332 = !DILocation(line: 490, column: 12, scope: !473)
!1333 = !DILocation(line: 491, column: 29, scope: !473)
!1334 = !DILocation(line: 491, column: 34, scope: !473)
!1335 = !DILocation(line: 491, column: 44, scope: !473)
!1336 = !DILocation(line: 491, column: 12, scope: !473)
!1337 = !DILocation(line: 489, column: 5, scope: !1338)
!1338 = !DILexicalBlockFile(scope: !473, file: !242, discriminator: 1)
!1339 = !DILocation(line: 492, column: 25, scope: !473)
!1340 = !DILocation(line: 492, column: 31, scope: !473)
!1341 = !DILocation(line: 492, column: 36, scope: !473)
!1342 = !DILocation(line: 492, column: 5, scope: !473)
!1343 = !DILocation(line: 493, column: 37, scope: !473)
!1344 = !DILocation(line: 493, column: 5, scope: !473)
!1345 = !DILocation(line: 496, column: 35, scope: !473)
!1346 = !DILocation(line: 496, column: 5, scope: !473)
!1347 = !DILocation(line: 500, column: 25, scope: !473)
!1348 = !DILocation(line: 500, column: 30, scope: !473)
!1349 = !DILocation(line: 500, column: 5, scope: !473)
!1350 = !DILocation(line: 501, column: 20, scope: !473)
!1351 = !DILocation(line: 501, column: 5, scope: !473)
!1352 = !DILocation(line: 506, column: 21, scope: !1353)
!1353 = distinct !DILexicalBlock(scope: !473, file: !242, line: 506, column: 5)
!1354 = !DILocation(line: 506, column: 26, scope: !1353)
!1355 = !DILocation(line: 506, column: 36, scope: !1353)
!1356 = !DILocation(line: 506, column: 18, scope: !1353)
!1357 = !DILocation(line: 506, column: 10, scope: !1353)
!1358 = !DILocation(line: 506, column: 57, scope: !1359)
!1359 = !DILexicalBlockFile(scope: !1360, file: !242, discriminator: 1)
!1360 = distinct !DILexicalBlock(scope: !1353, file: !242, line: 506, column: 5)
!1361 = !DILocation(line: 506, column: 56, scope: !1359)
!1362 = !DILocation(line: 506, column: 54, scope: !1359)
!1363 = !DILocation(line: 506, column: 66, scope: !1359)
!1364 = !DILocation(line: 506, column: 5, scope: !1359)
!1365 = !DILocation(line: 507, column: 25, scope: !1366)
!1366 = distinct !DILexicalBlock(scope: !1367, file: !242, line: 507, column: 7)
!1367 = distinct !DILexicalBlock(scope: !1360, file: !242, line: 506, column: 76)
!1368 = !DILocation(line: 507, column: 30, scope: !1366)
!1369 = !DILocation(line: 507, column: 23, scope: !1366)
!1370 = !DILocation(line: 507, column: 12, scope: !1366)
!1371 = !DILocation(line: 508, column: 12, scope: !1372)
!1372 = distinct !DILexicalBlock(scope: !1366, file: !242, line: 507, column: 7)
!1373 = !DILocation(line: 508, column: 23, scope: !1372)
!1374 = !DILocation(line: 508, column: 33, scope: !1375)
!1375 = !DILexicalBlockFile(scope: !1372, file: !242, discriminator: 1)
!1376 = !DILocation(line: 508, column: 45, scope: !1375)
!1377 = !DILocation(line: 508, column: 55, scope: !1375)
!1378 = !DILocation(line: 508, column: 60, scope: !1375)
!1379 = !DILocation(line: 508, column: 67, scope: !1375)
!1380 = !DILocation(line: 508, column: 26, scope: !1375)
!1381 = !DILocation(line: 508, column: 23, scope: !1375)
!1382 = !DILocation(line: 507, column: 7, scope: !1383)
!1383 = !DILexicalBlockFile(scope: !1366, file: !242, discriminator: 1)
!1384 = !DILocation(line: 507, column: 7, scope: !1385)
