; ModuleID = './[inter]src--perpkgstate.o.i'
source_filename = "./[inter]src--perpkgstate.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }
%struct.anon.1 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }
%struct.pkgbin = type { %struct.dependency*, i8, i32, %struct.dpkg_arch*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.dpkg_version, %struct.conffile*, %struct.arbitraryfield* }
%struct.conffile = type { %struct.conffile*, i8*, i8*, i8 }
%struct.arbitraryfield = type { %struct.arbitraryfield*, i8*, i8* }
%struct.perpackagestate = type { i32, i32, i8, i32, i32, %struct.pkg_list* }
%struct.pkg_list = type { %struct.pkg_list*, %struct.pkginfo* }

!15 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_arch_type", file: !16, line: 37, size: 32, align: 32, elements: !17)
!16 = !DIFile(filename: "../lib/dpkg/arch.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!17 = !{!18, !19, !20, !21, !22, !23, !24, !25}
!18 = !DIEnumerator(name: "DPKG_ARCH_NONE", value: 0)
!19 = !DIEnumerator(name: "DPKG_ARCH_EMPTY", value: 1)
!20 = !DIEnumerator(name: "DPKG_ARCH_ILLEGAL", value: 2)
!21 = !DIEnumerator(name: "DPKG_ARCH_WILDCARD", value: 3)
!22 = !DIEnumerator(name: "DPKG_ARCH_ALL", value: 4)
!23 = !DIEnumerator(name: "DPKG_ARCH_NATIVE", value: 5)
!24 = !DIEnumerator(name: "DPKG_ARCH_FOREIGN", value: 6)
!25 = !DIEnumerator(name: "DPKG_ARCH_UNKNOWN", value: 7)
!26 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_relation", file: !27, line: 61, size: 32, align: 32, elements: !28)
!27 = !DIFile(filename: "../lib/dpkg/version.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!28 = !{!29, !30, !31, !32, !33, !34}
!29 = !DIEnumerator(name: "DPKG_RELATION_NONE", value: 0)
!30 = !DIEnumerator(name: "DPKG_RELATION_EQ", value: 1)
!31 = !DIEnumerator(name: "DPKG_RELATION_LT", value: 2)
!32 = !DIEnumerator(name: "DPKG_RELATION_LE", value: 3)
!33 = !DIEnumerator(name: "DPKG_RELATION_GT", value: 4)
!34 = !DIEnumerator(name: "DPKG_RELATION_GE", value: 5)
!35 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgwant", file: !4, line: 153, size: 32, align: 32, elements: !36)
!36 = !{!37, !38, !39, !40, !41, !42}
!37 = !DIEnumerator(name: "PKG_WANT_UNKNOWN", value: 0)
!38 = !DIEnumerator(name: "PKG_WANT_INSTALL", value: 1)
!39 = !DIEnumerator(name: "PKG_WANT_HOLD", value: 2)
!40 = !DIEnumerator(name: "PKG_WANT_DEINSTALL", value: 3)
!41 = !DIEnumerator(name: "PKG_WANT_PURGE", value: 4)
!42 = !DIEnumerator(name: "PKG_WANT_SENTINEL", value: 5)
!43 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgeflag", file: !4, line: 163, size: 32, align: 32, elements: !44)
!44 = !{!45, !46}
!45 = !DIEnumerator(name: "PKG_EFLAG_OK", value: 0)
!46 = !DIEnumerator(name: "PKG_EFLAG_REINSTREQ", value: 1)
!47 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgstatus", file: !4, line: 168, size: 32, align: 32, elements: !48)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56}
!49 = !DIEnumerator(name: "PKG_STAT_NOTINSTALLED", value: 0)
!50 = !DIEnumerator(name: "PKG_STAT_CONFIGFILES", value: 1)
!51 = !DIEnumerator(name: "PKG_STAT_HALFINSTALLED", value: 2)
!52 = !DIEnumerator(name: "PKG_STAT_UNPACKED", value: 3)
!53 = !DIEnumerator(name: "PKG_STAT_HALFCONFIGURED", value: 4)
!54 = !DIEnumerator(name: "PKG_STAT_TRIGGERSAWAITED", value: 5)
!55 = !DIEnumerator(name: "PKG_STAT_TRIGGERSPENDING", value: 6)
!56 = !DIEnumerator(name: "PKG_STAT_INSTALLED", value: 7)
!57 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgpriority", file: !4, line: 179, size: 32, align: 32, elements: !58)
!58 = !{!59, !60, !61, !62, !63, !64, !65, !66}
!59 = !DIEnumerator(name: "PKG_PRIO_REQUIRED", value: 0)
!60 = !DIEnumerator(name: "PKG_PRIO_IMPORTANT", value: 1)
!61 = !DIEnumerator(name: "PKG_PRIO_STANDARD", value: 2)
!62 = !DIEnumerator(name: "PKG_PRIO_OPTIONAL", value: 3)
!63 = !DIEnumerator(name: "PKG_PRIO_EXTRA", value: 4)
!64 = !DIEnumerator(name: "PKG_PRIO_OTHER", value: 5)
!65 = !DIEnumerator(name: "PKG_PRIO_UNKNOWN", value: 6)
!66 = !DIEnumerator(name: "PKG_PRIO_UNSET", value: -1)
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkgmultiarch", file: !4, line: 95, size: 32, align: 32, elements: !68)
!68 = !{!69, !70, !71, !72}
!69 = !DIEnumerator(name: "PKG_MULTIARCH_NO", value: 0)
!70 = !DIEnumerator(name: "PKG_MULTIARCH_SAME", value: 1)
!71 = !DIEnumerator(name: "PKG_MULTIARCH_ALLOWED", value: 2)
!72 = !DIEnumerator(name: "PKG_MULTIARCH_FOREIGN", value: 3)
!73 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_istobe", file: !74, line: 34, size: 32, align: 32, elements: !75)
!74 = !DIFile(filename: "main.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!75 = !{!76, !77, !78, !79, !80}
!76 = !DIEnumerator(name: "PKG_ISTOBE_NORMAL", value: 0)
!77 = !DIEnumerator(name: "PKG_ISTOBE_REMOVE", value: 1)
!78 = !DIEnumerator(name: "PKG_ISTOBE_INSTALLNEW", value: 2)
!79 = !DIEnumerator(name: "PKG_ISTOBE_DECONFIGURE", value: 3)
!80 = !DIEnumerator(name: "PKG_ISTOBE_PREINSTALL", value: 4)
!81 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_cycle_color", file: !74, line: 47, size: 32, align: 32, elements: !82)
!82 = !{!83, !84, !85}
!83 = !DIEnumerator(name: "PKG_CYCLE_WHITE", value: 0)
!84 = !DIEnumerator(name: "PKG_CYCLE_GRAY", value: 1)
!85 = !DIEnumerator(name: "PKG_CYCLE_BLACK", value: 2)
!86 = !{i32 2, !"Dwarf Version", i32 4}
!87 = !{i32 2, !"Debug Info Version", i32 3}
!88 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!89 = distinct !DISubprogram(name: "ensure_package_clientdata", scope: !90, file: !90, line: 32, type: !91, isLocal: false, isDefinition: true, scopeLine: 33, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !246)
!90 = !DIFile(filename: "perpkgstate.c", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!91 = !DISubroutineType(types: !92)
!92 = !{null, !93}
!93 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !94, size: 64, align: 64)
!94 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !95)
!95 = !{!96, !148, !149, !150, !151, !152, !153, !154, !155, !156, !186, !187, !203, !212, !228, !229, !235, !238, !244, !245}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !94, file: !4, line: 196, baseType: !97, size: 64, align: 64)
!97 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !98, size: 64, align: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !99)
!99 = !{!100, !101, !105, !106, !146}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !98, file: !4, line: 243, baseType: !97, size: 64, align: 64)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !98, file: !4, line: 244, baseType: !102, size: 64, align: 64, offset: 64)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64, align: 64)
!103 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !104)
!104 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !98, file: !4, line: 245, baseType: !94, size: 3072, align: 64, offset: 128)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !98, file: !4, line: 249, baseType: !107, size: 128, align: 64, offset: 3200)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !98, file: !4, line: 246, size: 128, align: 64, elements: !108)
!108 = !{!109, !145}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !107, file: !4, line: 247, baseType: !110, size: 64, align: 64)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64, align: 64)
!111 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !112)
!112 = !{!113, !121, !122, !123, !124, !125, !134, !141, !142, !144}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !111, file: !4, line: 64, baseType: !114, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !115, size: 64, align: 64)
!115 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !116)
!116 = !{!117, !118, !119, !120}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !115, file: !4, line: 57, baseType: !93, size: 64, align: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !115, file: !4, line: 58, baseType: !114, size: 64, align: 64, offset: 64)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !115, file: !4, line: 59, baseType: !110, size: 64, align: 64, offset: 128)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !115, file: !4, line: 60, baseType: !3, size: 32, align: 32, offset: 192)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !111, file: !4, line: 65, baseType: !97, size: 64, align: 64, offset: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !111, file: !4, line: 66, baseType: !110, size: 64, align: 64, offset: 128)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !111, file: !4, line: 66, baseType: !110, size: 64, align: 64, offset: 192)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !111, file: !4, line: 66, baseType: !110, size: 64, align: 64, offset: 256)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !111, file: !4, line: 67, baseType: !126, size: 64, align: 64, offset: 320)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !127, size: 64, align: 64)
!127 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !128)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !16, line: 48, size: 192, align: 64, elements: !129)
!129 = !{!130, !132, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !128, file: !16, line: 49, baseType: !131, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64, align: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !128, file: !16, line: 50, baseType: !102, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !128, file: !16, line: 51, baseType: !15, size: 32, align: 32, offset: 128)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !111, file: !4, line: 68, baseType: !135, size: 192, align: 64, offset: 384)
!135 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !27, line: 42, size: 192, align: 64, elements: !136)
!136 = !{!137, !139, !140}
!137 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !135, file: !27, line: 44, baseType: !138, size: 32, align: 32)
!138 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !135, file: !27, line: 46, baseType: !102, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !135, file: !27, line: 48, baseType: !102, size: 64, align: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !111, file: !4, line: 69, baseType: !26, size: 32, align: 32, offset: 576)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !111, file: !4, line: 70, baseType: !143, size: 8, align: 8, offset: 608)
!143 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !111, file: !4, line: 71, baseType: !143, size: 8, align: 8, offset: 616)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !107, file: !4, line: 248, baseType: !110, size: 64, align: 64, offset: 64)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !98, file: !4, line: 250, baseType: !147, size: 32, align: 32, offset: 3328)
!147 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !94, file: !4, line: 197, baseType: !93, size: 64, align: 64, offset: 64)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !94, file: !4, line: 199, baseType: !35, size: 32, align: 32, offset: 128)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !94, file: !4, line: 201, baseType: !43, size: 32, align: 32, offset: 160)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !94, file: !4, line: 202, baseType: !47, size: 32, align: 32, offset: 192)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !94, file: !4, line: 203, baseType: !57, size: 32, align: 32, offset: 224)
!153 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !94, file: !4, line: 204, baseType: !102, size: 64, align: 64, offset: 256)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !94, file: !4, line: 205, baseType: !102, size: 64, align: 64, offset: 320)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !94, file: !4, line: 206, baseType: !135, size: 192, align: 64, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !94, file: !4, line: 207, baseType: !157, size: 960, align: 64, offset: 576)
!157 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !158)
!158 = !{!159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !179}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !157, file: !4, line: 108, baseType: !114, size: 64, align: 64)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !157, file: !4, line: 110, baseType: !143, size: 8, align: 8, offset: 64)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !157, file: !4, line: 111, baseType: !67, size: 32, align: 32, offset: 96)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !157, file: !4, line: 112, baseType: !126, size: 64, align: 64, offset: 128)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !157, file: !4, line: 115, baseType: !102, size: 64, align: 64, offset: 192)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !157, file: !4, line: 116, baseType: !102, size: 64, align: 64, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !157, file: !4, line: 117, baseType: !102, size: 64, align: 64, offset: 320)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !157, file: !4, line: 118, baseType: !102, size: 64, align: 64, offset: 384)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !157, file: !4, line: 119, baseType: !102, size: 64, align: 64, offset: 448)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !157, file: !4, line: 120, baseType: !102, size: 64, align: 64, offset: 512)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !157, file: !4, line: 121, baseType: !102, size: 64, align: 64, offset: 576)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !157, file: !4, line: 122, baseType: !135, size: 192, align: 64, offset: 640)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !157, file: !4, line: 123, baseType: !172, size: 64, align: 64, offset: 832)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !174)
!174 = !{!175, !176, !177, !178}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !173, file: !4, line: 81, baseType: !172, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !173, file: !4, line: 82, baseType: !102, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !173, file: !4, line: 83, baseType: !102, size: 64, align: 64, offset: 128)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !173, file: !4, line: 84, baseType: !143, size: 8, align: 8, offset: 192)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !157, file: !4, line: 124, baseType: !180, size: 64, align: 64, offset: 896)
!180 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !181, size: 64, align: 64)
!181 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !182)
!182 = !{!183, !184, !185}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !181, file: !4, line: 75, baseType: !180, size: 64, align: 64)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !181, file: !4, line: 76, baseType: !102, size: 64, align: 64, offset: 64)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !181, file: !4, line: 77, baseType: !102, size: 64, align: 64, offset: 128)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !94, file: !4, line: 208, baseType: !157, size: 960, align: 64, offset: 1536)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !94, file: !4, line: 209, baseType: !188, size: 64, align: 64, offset: 2496)
!188 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !189, size: 64, align: 64)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !74, line: 53, size: 256, align: 64, elements: !190)
!190 = !{!191, !192, !193, !194, !195, !196}
!191 = !DIDerivedType(tag: DW_TAG_member, name: "istobe", scope: !189, file: !74, line: 54, baseType: !73, size: 32, align: 32)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !189, file: !74, line: 57, baseType: !81, size: 32, align: 32, offset: 32)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "enqueued", scope: !189, file: !74, line: 59, baseType: !143, size: 8, align: 8, offset: 64)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "replacingfilesandsaid", scope: !189, file: !74, line: 61, baseType: !147, size: 32, align: 32, offset: 96)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "cmdline_seen", scope: !189, file: !74, line: 62, baseType: !147, size: 32, align: 32, offset: 128)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "trigprocdeferred", scope: !189, file: !74, line: 65, baseType: !197, size: 64, align: 64, offset: 192)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !198, size: 64, align: 64)
!198 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !199, line: 34, size: 128, align: 64, elements: !200)
!199 = !DIFile(filename: "../lib/dpkg/pkg-list.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!200 = !{!201, !202}
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !198, file: !199, line: 35, baseType: !197, size: 64, align: 64)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !198, file: !199, line: 36, baseType: !93, size: 64, align: 64, offset: 64)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !94, file: !4, line: 211, baseType: !204, size: 64, align: 64, offset: 2560)
!204 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !205, size: 64, align: 64)
!205 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !206)
!206 = !{!207, !208, !209, !210, !211}
!207 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !205, file: !4, line: 88, baseType: !204, size: 64, align: 64)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !205, file: !4, line: 89, baseType: !102, size: 64, align: 64, offset: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !205, file: !4, line: 90, baseType: !102, size: 64, align: 64, offset: 128)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !205, file: !4, line: 91, baseType: !102, size: 64, align: 64, offset: 192)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !205, file: !4, line: 92, baseType: !102, size: 64, align: 64, offset: 256)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !94, file: !4, line: 216, baseType: !213, size: 128, align: 64, offset: 2624)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !94, file: !4, line: 213, size: 128, align: 64, elements: !214)
!214 = !{!215, !227}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !213, file: !4, line: 215, baseType: !216, size: 64, align: 64)
!216 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !217, size: 64, align: 64)
!217 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !218)
!218 = !{!219, !220, !221, !222}
!219 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !217, file: !4, line: 143, baseType: !93, size: 64, align: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !217, file: !4, line: 143, baseType: !93, size: 64, align: 64, offset: 64)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !217, file: !4, line: 144, baseType: !216, size: 64, align: 64, offset: 128)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !217, file: !4, line: 147, baseType: !223, size: 128, align: 64, offset: 192)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !217, file: !4, line: 145, size: 128, align: 64, elements: !224)
!224 = !{!225, !226}
!225 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !223, file: !4, line: 146, baseType: !216, size: 64, align: 64)
!226 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !223, file: !4, line: 146, baseType: !216, size: 64, align: 64, offset: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !213, file: !4, line: 215, baseType: !216, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !94, file: !4, line: 219, baseType: !216, size: 64, align: 64, offset: 2752)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !94, file: !4, line: 220, baseType: !230, size: 64, align: 64, offset: 2816)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64)
!231 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !232)
!232 = !{!233, !234}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !231, file: !4, line: 135, baseType: !230, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !231, file: !4, line: 136, baseType: !102, size: 64, align: 64, offset: 64)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !94, file: !4, line: 231, baseType: !236, size: 64, align: 64, offset: 2880)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !237, size: 64, align: 64)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !4, line: 231, flags: DIFlagFwdDecl)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !94, file: !4, line: 232, baseType: !239, size: 64, align: 64, offset: 2944)
!239 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !240, line: 86, baseType: !241)
!240 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!241 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !242, line: 131, baseType: !243)
!242 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!243 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !94, file: !4, line: 233, baseType: !143, size: 8, align: 8, offset: 3008)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !94, file: !4, line: 236, baseType: !143, size: 8, align: 8, offset: 3016)
!246 = !{}
!247 = !DILocalVariable(name: "pkg", arg: 1, scope: !89, file: !90, line: 32, type: !93)
!248 = !DIExpression()
!249 = !DILocation(line: 32, column: 43, scope: !89)
!250 = !DILocation(line: 34, column: 6, scope: !251)
!251 = distinct !DILexicalBlock(scope: !89, file: !90, line: 34, column: 6)
!252 = !DILocation(line: 34, column: 11, scope: !251)
!253 = !DILocation(line: 34, column: 6, scope: !89)
!254 = !DILocation(line: 35, column: 3, scope: !251)
!255 = !DILocation(line: 36, column: 20, scope: !89)
!256 = !DILocation(line: 36, column: 2, scope: !89)
!257 = !DILocation(line: 36, column: 7, scope: !89)
!258 = !DILocation(line: 36, column: 18, scope: !89)
!259 = !DILocation(line: 37, column: 2, scope: !89)
!260 = !DILocation(line: 37, column: 7, scope: !89)
!261 = !DILocation(line: 37, column: 19, scope: !89)
!262 = !DILocation(line: 37, column: 26, scope: !89)
!263 = !DILocation(line: 38, column: 2, scope: !89)
!264 = !DILocation(line: 38, column: 7, scope: !89)
!265 = !DILocation(line: 38, column: 19, scope: !89)
!266 = !DILocation(line: 38, column: 25, scope: !89)
!267 = !DILocation(line: 39, column: 2, scope: !89)
!268 = !DILocation(line: 39, column: 7, scope: !89)
!269 = !DILocation(line: 39, column: 19, scope: !89)
!270 = !DILocation(line: 39, column: 28, scope: !89)
!271 = !DILocation(line: 40, column: 2, scope: !89)
!272 = !DILocation(line: 40, column: 7, scope: !89)
!273 = !DILocation(line: 40, column: 19, scope: !89)
!274 = !DILocation(line: 40, column: 41, scope: !89)
!275 = !DILocation(line: 41, column: 2, scope: !89)
!276 = !DILocation(line: 41, column: 7, scope: !89)
!277 = !DILocation(line: 41, column: 19, scope: !89)
!278 = !DILocation(line: 41, column: 32, scope: !89)
!279 = !DILocation(line: 42, column: 2, scope: !89)
!280 = !DILocation(line: 42, column: 7, scope: !89)
!281 = !DILocation(line: 42, column: 19, scope: !89)
!282 = !DILocation(line: 42, column: 36, scope: !89)
!283 = !DILocation(line: 43, column: 1, scope: !89)
!284 = !DILocation(line: 43, column: 1, scope: !285)
!285 = !DILexicalBlockFile(scope: !89, file: !90, discriminator: 1)
