; ModuleID = './[inter]src--cleanup.o.i'
source_filename = "./[inter]src--cleanup.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.varbuf = type { i64, i64, i8* }
%struct.cmdinfo = type { i8*, i8, i32, i32*, i8**, void (%struct.cmdinfo*, i8*)*, i32, i8*, i32 (i8**)* }
%struct.fsys_namenode = type { %struct.fsys_namenode*, i8*, %struct.pkg_list*, %struct.fsys_diversion*, %struct.file_stat*, %struct.trigfileint*, i32, i8*, i8*, %struct.file_ondisk_id* }
%struct.pkg_list = type { %struct.pkg_list*, %struct.pkginfo* }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.1, i32 }
%struct.anon.1 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }

!90 = !DIEnumerator(name: "FNNF_NEW_INARCHIVE", value: 2)
!91 = !DIEnumerator(name: "FNNF_OLD_CONFF", value: 4)
!92 = !DIEnumerator(name: "FNNF_OBS_CONFF", value: 8)
!93 = !DIEnumerator(name: "FNNF_ELIDE_OTHER_LISTS", value: 16)
!94 = !DIEnumerator(name: "FNNF_NO_ATOMIC_OVERWRITE", value: 32)
!95 = !DIEnumerator(name: "FNNF_PLACED_ON_DISK", value: 64)
!96 = !DIEnumerator(name: "FNNF_DEFERRED_FSYNC", value: 128)
!97 = !DIEnumerator(name: "FNNF_DEFERRED_RENAME", value: 256)
!98 = !DIEnumerator(name: "FNNF_FILTERED", value: 512)
!99 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "debugflags", file: !100, line: 41, size: 32, align: 32, elements: !101)
!100 = !DIFile(filename: "../lib/dpkg/debug.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!101 = !{!102, !103, !104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114}
!102 = !DIEnumerator(name: "dbg_general", value: 1)
!103 = !DIEnumerator(name: "dbg_scripts", value: 2)
!104 = !DIEnumerator(name: "dbg_eachfile", value: 8)
!105 = !DIEnumerator(name: "dbg_eachfiledetail", value: 64)
!106 = !DIEnumerator(name: "dbg_conff", value: 16)
!107 = !DIEnumerator(name: "dbg_conffdetail", value: 128)
!108 = !DIEnumerator(name: "dbg_depcon", value: 32)
!109 = !DIEnumerator(name: "dbg_depcondetail", value: 256)
!110 = !DIEnumerator(name: "dbg_veryverbose", value: 512)
!111 = !DIEnumerator(name: "dbg_stupidlyverbose", value: 1024)
!112 = !DIEnumerator(name: "dbg_triggers", value: 4096)
!113 = !DIEnumerator(name: "dbg_triggersdetail", value: 8192)
!114 = !DIEnumerator(name: "dbg_triggersstupid", value: 16384)
!115 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "versiondisplayepochwhen", file: !4, line: 388, size: 32, align: 32, elements: !116)
!116 = !{!117, !118, !119}
!117 = !DIEnumerator(name: "vdew_never", value: 0)
!118 = !DIEnumerator(name: "vdew_nonambig", value: 1)
!119 = !DIEnumerator(name: "vdew_always", value: 2)
!120 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "action", file: !74, line: 68, size: 32, align: 32, elements: !121)
!121 = !{!122, !123, !124, !125, !126, !127, !128, !129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164}
!122 = !DIEnumerator(name: "act_unset", value: 0)
!123 = !DIEnumerator(name: "act_unpack", value: 1)
!124 = !DIEnumerator(name: "act_configure", value: 2)
!125 = !DIEnumerator(name: "act_install", value: 3)
!126 = !DIEnumerator(name: "act_triggers", value: 4)
!127 = !DIEnumerator(name: "act_remove", value: 5)
!128 = !DIEnumerator(name: "act_purge", value: 6)
!129 = !DIEnumerator(name: "act_verify", value: 7)
!130 = !DIEnumerator(name: "act_commandfd", value: 8)
!131 = !DIEnumerator(name: "act_status", value: 9)
!132 = !DIEnumerator(name: "act_listpackages", value: 10)
!133 = !DIEnumerator(name: "act_listfiles", value: 11)
!134 = !DIEnumerator(name: "act_searchfiles", value: 12)
!135 = !DIEnumerator(name: "act_controlpath", value: 13)
!136 = !DIEnumerator(name: "act_controllist", value: 14)
!137 = !DIEnumerator(name: "act_controlshow", value: 15)
!138 = !DIEnumerator(name: "act_cmpversions", value: 16)
!139 = !DIEnumerator(name: "act_arch_add", value: 17)
!140 = !DIEnumerator(name: "act_arch_remove", value: 18)
!141 = !DIEnumerator(name: "act_printarch", value: 19)
!142 = !DIEnumerator(name: "act_printforeignarches", value: 20)
!143 = !DIEnumerator(name: "act_assertpredep", value: 21)
!144 = !DIEnumerator(name: "act_assertepoch", value: 22)
!145 = !DIEnumerator(name: "act_assertlongfilenames", value: 23)
!146 = !DIEnumerator(name: "act_assertmulticonrep", value: 24)
!147 = !DIEnumerator(name: "act_assertmultiarch", value: 25)
!148 = !DIEnumerator(name: "act_assertverprovides", value: 26)
!149 = !DIEnumerator(name: "act_validate_pkgname", value: 27)
!150 = !DIEnumerator(name: "act_validate_trigname", value: 28)
!151 = !DIEnumerator(name: "act_validate_archname", value: 29)
!152 = !DIEnumerator(name: "act_validate_version", value: 30)
!153 = !DIEnumerator(name: "act_audit", value: 31)
!154 = !DIEnumerator(name: "act_unpackchk", value: 32)
!155 = !DIEnumerator(name: "act_predeppackage", value: 33)
!156 = !DIEnumerator(name: "act_getselections", value: 34)
!157 = !DIEnumerator(name: "act_setselections", value: 35)
!158 = !DIEnumerator(name: "act_clearselections", value: 36)
!159 = !DIEnumerator(name: "act_avail", value: 37)
!160 = !DIEnumerator(name: "act_printavail", value: 38)
!161 = !DIEnumerator(name: "act_avclear", value: 39)
!162 = !DIEnumerator(name: "act_avreplace", value: 40)
!163 = !DIEnumerator(name: "act_avmerge", value: 41)
!164 = !DIEnumerator(name: "act_forgetold", value: 42)
!165 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "pkg_name_arch_when", file: !4, line: 396, size: 32, align: 32, elements: !166)
!166 = !{!167, !168, !169, !170}
!167 = !DIEnumerator(name: "pnaw_never", value: 0)
!168 = !DIEnumerator(name: "pnaw_nonambig", value: 1)
!169 = !DIEnumerator(name: "pnaw_foreign", value: 2)
!170 = !DIEnumerator(name: "pnaw_always", value: 3)
!171 = !{!172, !376, !351, !377}
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !173, size: 64, align: 64)
!173 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !174)
!174 = !{!175, !227, !228, !229, !230, !231, !232, !233, !234, !235, !265, !266, !282, !291, !307, !308, !314, !370, !374, !375}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !173, file: !4, line: 196, baseType: !176, size: 64, align: 64)
!176 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !177, size: 64, align: 64)
!177 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !178)
!178 = !{!179, !180, !184, !185, !225}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !177, file: !4, line: 243, baseType: !176, size: 64, align: 64)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !177, file: !4, line: 244, baseType: !181, size: 64, align: 64, offset: 64)
!181 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !182, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !183)
!183 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !177, file: !4, line: 245, baseType: !173, size: 3072, align: 64, offset: 128)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !177, file: !4, line: 249, baseType: !186, size: 128, align: 64, offset: 3200)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !177, file: !4, line: 246, size: 128, align: 64, elements: !187)
!187 = !{!188, !224}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !186, file: !4, line: 247, baseType: !189, size: 64, align: 64)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !190, size: 64, align: 64)
!190 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !191)
!191 = !{!192, !200, !201, !202, !203, !204, !213, !220, !221, !223}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !190, file: !4, line: 64, baseType: !193, size: 64, align: 64)
!193 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !194, size: 64, align: 64)
!194 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !195)
!195 = !{!196, !197, !198, !199}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !194, file: !4, line: 57, baseType: !172, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !194, file: !4, line: 58, baseType: !193, size: 64, align: 64, offset: 64)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !194, file: !4, line: 59, baseType: !189, size: 64, align: 64, offset: 128)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !194, file: !4, line: 60, baseType: !3, size: 32, align: 32, offset: 192)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !190, file: !4, line: 65, baseType: !176, size: 64, align: 64, offset: 64)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !190, file: !4, line: 66, baseType: !189, size: 64, align: 64, offset: 128)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !190, file: !4, line: 66, baseType: !189, size: 64, align: 64, offset: 192)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !190, file: !4, line: 66, baseType: !189, size: 64, align: 64, offset: 256)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !190, file: !4, line: 67, baseType: !205, size: 64, align: 64, offset: 320)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64, align: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !16, line: 48, size: 192, align: 64, elements: !208)
!208 = !{!209, !211, !212}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !207, file: !16, line: 49, baseType: !210, size: 64, align: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64, align: 64)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !207, file: !16, line: 50, baseType: !181, size: 64, align: 64, offset: 64)
!212 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !207, file: !16, line: 51, baseType: !15, size: 32, align: 32, offset: 128)
!213 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !190, file: !4, line: 68, baseType: !214, size: 192, align: 64, offset: 384)
!214 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !27, line: 42, size: 192, align: 64, elements: !215)
!215 = !{!216, !218, !219}
!216 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !214, file: !27, line: 44, baseType: !217, size: 32, align: 32)
!217 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !214, file: !27, line: 46, baseType: !181, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !214, file: !27, line: 48, baseType: !181, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !190, file: !4, line: 69, baseType: !26, size: 32, align: 32, offset: 576)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !190, file: !4, line: 70, baseType: !222, size: 8, align: 8, offset: 608)
!222 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!223 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !190, file: !4, line: 71, baseType: !222, size: 8, align: 8, offset: 616)
!224 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !186, file: !4, line: 248, baseType: !189, size: 64, align: 64, offset: 64)
!225 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !177, file: !4, line: 250, baseType: !226, size: 32, align: 32, offset: 3328)
!226 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !173, file: !4, line: 197, baseType: !172, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !173, file: !4, line: 199, baseType: !35, size: 32, align: 32, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !173, file: !4, line: 201, baseType: !43, size: 32, align: 32, offset: 160)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !173, file: !4, line: 202, baseType: !47, size: 32, align: 32, offset: 192)
!231 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !173, file: !4, line: 203, baseType: !57, size: 32, align: 32, offset: 224)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !173, file: !4, line: 204, baseType: !181, size: 64, align: 64, offset: 256)
!233 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !173, file: !4, line: 205, baseType: !181, size: 64, align: 64, offset: 320)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !173, file: !4, line: 206, baseType: !214, size: 192, align: 64, offset: 384)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !173, file: !4, line: 207, baseType: !236, size: 960, align: 64, offset: 576)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !237)
!237 = !{!238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !258}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !236, file: !4, line: 108, baseType: !193, size: 64, align: 64)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !236, file: !4, line: 110, baseType: !222, size: 8, align: 8, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !236, file: !4, line: 111, baseType: !67, size: 32, align: 32, offset: 96)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !236, file: !4, line: 112, baseType: !205, size: 64, align: 64, offset: 128)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !236, file: !4, line: 115, baseType: !181, size: 64, align: 64, offset: 192)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !236, file: !4, line: 116, baseType: !181, size: 64, align: 64, offset: 256)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !236, file: !4, line: 117, baseType: !181, size: 64, align: 64, offset: 320)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !236, file: !4, line: 118, baseType: !181, size: 64, align: 64, offset: 384)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !236, file: !4, line: 119, baseType: !181, size: 64, align: 64, offset: 448)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !236, file: !4, line: 120, baseType: !181, size: 64, align: 64, offset: 512)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !236, file: !4, line: 121, baseType: !181, size: 64, align: 64, offset: 576)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !236, file: !4, line: 122, baseType: !214, size: 192, align: 64, offset: 640)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !236, file: !4, line: 123, baseType: !251, size: 64, align: 64, offset: 832)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64, align: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !253)
!253 = !{!254, !255, !256, !257}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !252, file: !4, line: 81, baseType: !251, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !252, file: !4, line: 82, baseType: !181, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !252, file: !4, line: 83, baseType: !181, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !252, file: !4, line: 84, baseType: !222, size: 8, align: 8, offset: 192)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !236, file: !4, line: 124, baseType: !259, size: 64, align: 64, offset: 896)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !260, size: 64, align: 64)
!260 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !261)
!261 = !{!262, !263, !264}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !260, file: !4, line: 75, baseType: !259, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !260, file: !4, line: 76, baseType: !181, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !260, file: !4, line: 77, baseType: !181, size: 64, align: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !173, file: !4, line: 208, baseType: !236, size: 960, align: 64, offset: 1536)
!266 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !173, file: !4, line: 209, baseType: !267, size: 64, align: 64, offset: 2496)
!267 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !268, size: 64, align: 64)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !74, line: 53, size: 256, align: 64, elements: !269)
!269 = !{!270, !271, !272, !273, !274, !275}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "istobe", scope: !268, file: !74, line: 54, baseType: !73, size: 32, align: 32)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !268, file: !74, line: 57, baseType: !81, size: 32, align: 32, offset: 32)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "enqueued", scope: !268, file: !74, line: 59, baseType: !222, size: 8, align: 8, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "replacingfilesandsaid", scope: !268, file: !74, line: 61, baseType: !226, size: 32, align: 32, offset: 96)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "cmdline_seen", scope: !268, file: !74, line: 62, baseType: !226, size: 32, align: 32, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "trigprocdeferred", scope: !268, file: !74, line: 65, baseType: !276, size: 64, align: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !277, size: 64, align: 64)
!277 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !278, line: 34, size: 128, align: 64, elements: !279)
!278 = !DIFile(filename: "../lib/dpkg/pkg-list.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!279 = !{!280, !281}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !277, file: !278, line: 35, baseType: !276, size: 64, align: 64)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !277, file: !278, line: 36, baseType: !172, size: 64, align: 64, offset: 64)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !173, file: !4, line: 211, baseType: !283, size: 64, align: 64, offset: 2560)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !284, size: 64, align: 64)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !285)
!285 = !{!286, !287, !288, !289, !290}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !284, file: !4, line: 88, baseType: !283, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !284, file: !4, line: 89, baseType: !181, size: 64, align: 64, offset: 64)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !284, file: !4, line: 90, baseType: !181, size: 64, align: 64, offset: 128)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !284, file: !4, line: 91, baseType: !181, size: 64, align: 64, offset: 192)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !284, file: !4, line: 92, baseType: !181, size: 64, align: 64, offset: 256)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !173, file: !4, line: 216, baseType: !292, size: 128, align: 64, offset: 2624)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !173, file: !4, line: 213, size: 128, align: 64, elements: !293)
!293 = !{!294, !306}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !292, file: !4, line: 215, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !297)
!297 = !{!298, !299, !300, !301}
!298 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !296, file: !4, line: 143, baseType: !172, size: 64, align: 64)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !296, file: !4, line: 143, baseType: !172, size: 64, align: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !296, file: !4, line: 144, baseType: !295, size: 64, align: 64, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !296, file: !4, line: 147, baseType: !302, size: 128, align: 64, offset: 192)
!302 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !296, file: !4, line: 145, size: 128, align: 64, elements: !303)
!303 = !{!304, !305}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !302, file: !4, line: 146, baseType: !295, size: 64, align: 64)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !302, file: !4, line: 146, baseType: !295, size: 64, align: 64, offset: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !292, file: !4, line: 215, baseType: !295, size: 64, align: 64, offset: 64)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !173, file: !4, line: 219, baseType: !295, size: 64, align: 64, offset: 2752)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !173, file: !4, line: 220, baseType: !309, size: 64, align: 64, offset: 2816)
!309 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !310, size: 64, align: 64)
!310 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !311)
!311 = !{!312, !313}
!312 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !310, file: !4, line: 135, baseType: !309, size: 64, align: 64)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !310, file: !4, line: 136, baseType: !181, size: 64, align: 64, offset: 64)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !173, file: !4, line: 231, baseType: !315, size: 64, align: 64, offset: 2880)
!315 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !316, size: 64, align: 64)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !87, line: 122, size: 128, align: 64, elements: !317)
!317 = !{!318, !319}
!318 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !316, file: !87, line: 123, baseType: !315, size: 64, align: 64)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "namenode", scope: !316, file: !87, line: 124, baseType: !320, size: 64, align: 64, offset: 64)
!320 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !321, size: 64, align: 64)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode", file: !87, line: 90, size: 640, align: 64, elements: !322)
!322 = !{!323, !324, !325, !326, !334, !353, !356, !357, !358, !359}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !321, file: !87, line: 91, baseType: !320, size: 64, align: 64)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !321, file: !87, line: 92, baseType: !181, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "packages", scope: !321, file: !87, line: 93, baseType: !276, size: 64, align: 64, offset: 128)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "divert", scope: !321, file: !87, line: 94, baseType: !327, size: 64, align: 64, offset: 192)
!327 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !328, size: 64, align: 64)
!328 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_diversion", file: !87, line: 151, size: 256, align: 64, elements: !329)
!329 = !{!330, !331, !332, !333}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "useinstead", scope: !328, file: !87, line: 152, baseType: !320, size: 64, align: 64)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "camefrom", scope: !328, file: !87, line: 153, baseType: !320, size: 64, align: 64, offset: 64)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "pkgset", scope: !328, file: !87, line: 154, baseType: !176, size: 64, align: 64, offset: 128)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !328, file: !87, line: 157, baseType: !327, size: 64, align: 64, offset: 192)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "statoverride", scope: !321, file: !87, line: 101, baseType: !335, size: 64, align: 64, offset: 256)
!335 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !336, size: 64, align: 64)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !337, line: 40, size: 256, align: 64, elements: !338)
!337 = !DIFile(filename: "../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!338 = !{!339, !344, !347, !350, !352}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !336, file: !337, line: 41, baseType: !340, size: 32, align: 32)
!340 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !341, line: 80, baseType: !342)
!341 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!342 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !343, line: 125, baseType: !217)
!343 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!344 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !336, file: !337, line: 42, baseType: !345, size: 32, align: 32, offset: 32)
!345 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !341, line: 65, baseType: !346)
!346 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !343, line: 126, baseType: !217)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !336, file: !337, line: 43, baseType: !348, size: 32, align: 32, offset: 64)
!348 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !341, line: 70, baseType: !349)
!349 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !343, line: 129, baseType: !217)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !336, file: !337, line: 47, baseType: !351, size: 64, align: 64, offset: 128)
!351 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64, align: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !336, file: !337, line: 48, baseType: !351, size: 64, align: 64, offset: 192)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "trig_interested", scope: !321, file: !87, line: 103, baseType: !354, size: 64, align: 64, offset: 320)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !355, size: 64, align: 64)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "trigfileint", file: !87, line: 103, flags: DIFlagFwdDecl)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !321, file: !87, line: 111, baseType: !86, size: 32, align: 32, offset: 384)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "oldhash", scope: !321, file: !87, line: 114, baseType: !181, size: 64, align: 64, offset: 448)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "newhash", scope: !321, file: !87, line: 117, baseType: !181, size: 64, align: 64, offset: 512)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "file_ondisk_id", scope: !321, file: !87, line: 119, baseType: !360, size: 64, align: 64, offset: 576)
!360 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !361, size: 64, align: 64)
!361 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_ondisk_id", file: !87, line: 85, size: 128, align: 64, elements: !362)
!362 = !{!363, !367}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "id_dev", scope: !361, file: !87, line: 86, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !341, line: 60, baseType: !365)
!365 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !343, line: 124, baseType: !366)
!366 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "id_ino", scope: !361, file: !87, line: 87, baseType: !368, size: 64, align: 64, offset: 64)
!368 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !341, line: 48, baseType: !369)
!369 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !343, line: 127, baseType: !366)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !173, file: !4, line: 232, baseType: !371, size: 64, align: 64, offset: 2944)
!371 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !341, line: 86, baseType: !372)
!372 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !343, line: 131, baseType: !373)
!373 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !173, file: !4, line: 233, baseType: !222, size: 8, align: 8, offset: 3008)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !173, file: !4, line: 236, baseType: !222, size: 8, align: 8, offset: 3016)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !47, size: 64, align: 64)
!378 = !{!379, !381}
!379 = distinct !DIGlobalVariable(name: "cleanup_pkg_failed", scope: !0, file: !380, line: 48, type: !226, isLocal: false, isDefinition: true, variable: i32* @cleanup_pkg_failed)
!380 = !DIFile(filename: "cleanup.c", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!381 = distinct !DIGlobalVariable(name: "cleanup_conflictor_failed", scope: !0, file: !380, line: 48, type: !226, isLocal: false, isDefinition: true, variable: i32* @cleanup_conflictor_failed)
!382 = !{i32 2, !"Dwarf Version", i32 4}
!383 = !{i32 2, !"Debug Info Version", i32 3}
!384 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!385 = distinct !DISubprogram(name: "cu_installnew", scope: !380, file: !380, line: 68, type: !386, isLocal: false, isDefinition: true, scopeLine: 68, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !389)
!386 = !DISubroutineType(types: !387)
!387 = !{null, !226, !388}
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64, align: 64)
!389 = !{}
!390 = !DILocalVariable(name: "argc", arg: 1, scope: !385, file: !380, line: 68, type: !226)
!391 = !DIExpression()
!392 = !DILocation(line: 68, column: 24, scope: !385)
!393 = !DILocalVariable(name: "argv", arg: 2, scope: !385, file: !380, line: 68, type: !388)
!394 = !DILocation(line: 68, column: 37, scope: !385)
!395 = !DILocalVariable(name: "namenode", scope: !385, file: !380, line: 69, type: !320)
!396 = !DILocation(line: 69, column: 25, scope: !385)
!397 = !DILocation(line: 69, column: 36, scope: !385)
!398 = !DILocalVariable(name: "stab", scope: !385, file: !380, line: 70, type: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !400, line: 46, size: 1152, align: 64, elements: !401)
!400 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!401 = !{!402, !403, !404, !406, !407, !408, !409, !410, !411, !412, !414, !416, !424, !425, !426}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !399, file: !400, line: 48, baseType: !365, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !399, file: !400, line: 53, baseType: !369, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !399, file: !400, line: 61, baseType: !405, size: 64, align: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !343, line: 130, baseType: !366)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !399, file: !400, line: 62, baseType: !349, size: 32, align: 32, offset: 192)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !399, file: !400, line: 64, baseType: !342, size: 32, align: 32, offset: 224)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !399, file: !400, line: 65, baseType: !346, size: 32, align: 32, offset: 256)
!409 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !399, file: !400, line: 67, baseType: !226, size: 32, align: 32, offset: 288)
!410 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !399, file: !400, line: 69, baseType: !365, size: 64, align: 64, offset: 320)
!411 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !399, file: !400, line: 74, baseType: !372, size: 64, align: 64, offset: 384)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !399, file: !400, line: 78, baseType: !413, size: 64, align: 64, offset: 448)
!413 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !343, line: 153, baseType: !373)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !399, file: !400, line: 80, baseType: !415, size: 64, align: 64, offset: 512)
!415 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !343, line: 158, baseType: !373)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !399, file: !400, line: 91, baseType: !417, size: 128, align: 64, offset: 576)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !418, line: 120, size: 128, align: 64, elements: !419)
!418 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!419 = !{!420, !422}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !417, file: !418, line: 122, baseType: !421, size: 64, align: 64)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !343, line: 139, baseType: !373)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !417, file: !418, line: 123, baseType: !423, size: 64, align: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !343, line: 175, baseType: !373)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !399, file: !400, line: 92, baseType: !417, size: 128, align: 64, offset: 704)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !399, file: !400, line: 93, baseType: !417, size: 128, align: 64, offset: 832)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !399, file: !400, line: 106, baseType: !427, size: 192, align: 64, offset: 960)
!427 = !DICompositeType(tag: DW_TAG_array_type, baseType: !423, size: 192, align: 64, elements: !428)
!428 = !{!429}
!429 = !DISubrange(count: 3)
!430 = !DILocation(line: 70, column: 15, scope: !385)
!431 = !DILocation(line: 72, column: 21, scope: !385)
!432 = !DILocation(line: 72, column: 50, scope: !385)
!433 = !DILocation(line: 75, column: 9, scope: !385)
!434 = !DILocation(line: 75, column: 19, scope: !385)
!435 = !DILocation(line: 75, column: 25, scope: !385)
!436 = !DILocation(line: 75, column: 35, scope: !385)
!437 = !DILocation(line: 74, column: 3, scope: !385)
!438 = !DILocation(line: 77, column: 17, scope: !385)
!439 = !DILocation(line: 77, column: 27, scope: !385)
!440 = !DILocation(line: 77, column: 3, scope: !385)
!441 = !DILocation(line: 79, column: 9, scope: !442)
!442 = distinct !DILexicalBlock(scope: !385, file: !380, line: 79, column: 7)
!443 = !DILocation(line: 79, column: 19, scope: !442)
!444 = !DILocation(line: 79, column: 25, scope: !442)
!445 = !DILocation(line: 79, column: 43, scope: !442)
!446 = !DILocation(line: 79, column: 64, scope: !447)
!447 = !DILexicalBlockFile(scope: !442, file: !380, discriminator: 1)
!448 = !DILocation(line: 79, column: 47, scope: !447)
!449 = !DILocation(line: 79, column: 7, scope: !447)
!450 = !DILocation(line: 82, column: 9, scope: !451)
!451 = distinct !DILexicalBlock(scope: !452, file: !380, line: 82, column: 9)
!452 = distinct !DILexicalBlock(scope: !442, file: !380, line: 79, column: 76)
!453 = !DILocation(line: 82, column: 19, scope: !451)
!454 = !DILocation(line: 82, column: 25, scope: !451)
!455 = !DILocation(line: 82, column: 9, scope: !452)
!456 = !DILocation(line: 85, column: 7, scope: !457)
!457 = distinct !DILexicalBlock(scope: !451, file: !380, line: 82, column: 53)
!458 = !DILocation(line: 86, column: 33, scope: !459)
!459 = distinct !DILexicalBlock(scope: !457, file: !380, line: 86, column: 11)
!460 = !DILocation(line: 86, column: 11, scope: !459)
!461 = !DILocation(line: 86, column: 38, scope: !459)
!462 = !DILocation(line: 86, column: 42, scope: !463)
!463 = !DILexicalBlockFile(scope: !459, file: !380, discriminator: 1)
!464 = !DILocation(line: 86, column: 41, scope: !463)
!465 = !DILocation(line: 86, column: 46, scope: !463)
!466 = !DILocation(line: 86, column: 56, scope: !463)
!467 = !DILocation(line: 86, column: 61, scope: !468)
!468 = !DILexicalBlockFile(scope: !459, file: !380, discriminator: 2)
!469 = !DILocation(line: 86, column: 60, scope: !468)
!470 = !DILocation(line: 86, column: 65, scope: !468)
!471 = !DILocation(line: 86, column: 11, scope: !468)
!472 = !DILocation(line: 87, column: 17, scope: !459)
!473 = !DILocation(line: 88, column: 51, scope: !459)
!474 = !DILocation(line: 88, column: 61, scope: !459)
!475 = !DILocation(line: 87, column: 9, scope: !463)
!476 = !DILocation(line: 87, column: 9, scope: !459)
!477 = !DILocation(line: 89, column: 5, scope: !457)
!478 = !DILocation(line: 90, column: 7, scope: !479)
!479 = distinct !DILexicalBlock(scope: !451, file: !380, line: 89, column: 12)
!480 = !DILocation(line: 93, column: 27, scope: !481)
!481 = distinct !DILexicalBlock(scope: !452, file: !380, line: 93, column: 9)
!482 = !DILocation(line: 93, column: 39, scope: !481)
!483 = !DILocation(line: 93, column: 9, scope: !481)
!484 = !DILocation(line: 93, column: 9, scope: !452)
!485 = !DILocation(line: 94, column: 15, scope: !481)
!486 = !DILocation(line: 94, column: 72, scope: !481)
!487 = !DILocation(line: 94, column: 82, scope: !481)
!488 = !DILocation(line: 94, column: 7, scope: !489)
!489 = !DILexicalBlockFile(scope: !481, file: !380, discriminator: 1)
!490 = !DILocation(line: 94, column: 7, scope: !481)
!491 = !DILocation(line: 97, column: 32, scope: !492)
!492 = distinct !DILexicalBlock(scope: !481, file: !380, line: 97, column: 14)
!493 = !DILocation(line: 97, column: 14, scope: !492)
