; ModuleID = './[inter]src--configure.o.i'
source_filename = "./[inter]src--configure.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.varbuf = type { i64, i64, i8* }
%struct._IO_FILE = type { i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct._IO_marker*, %struct._IO_FILE*, i32, i32, i64, i16, i8, [1 x i8], i8*, i64, i8*, i8*, i8*, i8*, i64, i32, [20 x i8] }
%struct._IO_marker = type { %struct._IO_marker*, %struct._IO_FILE*, i32 }
%struct.pkginfo = type { %struct.pkgset*, %struct.pkginfo*, i32, i32, i32, i32, i8*, i8*, %struct.dpkg_version, %struct.pkgbin, %struct.pkgbin, %struct.perpackagestate*, %struct.archivedetails*, %struct.anon, %struct.trigaw*, %struct.trigpend*, %struct.fsys_namenode_list*, i64, i8, i8 }
%struct.pkgset = type { %struct.pkgset*, i8*, %struct.pkginfo, %struct.anon.2, i32 }
%struct.anon.2 = type { %struct.deppossi*, %struct.deppossi* }
%struct.deppossi = type { %struct.dependency*, %struct.pkgset*, %struct.deppossi*, %struct.deppossi*, %struct.deppossi*, %struct.dpkg_arch*, %struct.dpkg_version, i32, i8, i8 }
%struct.dependency = type { %struct.pkginfo*, %struct.dependency*, %struct.deppossi*, i32 }
%struct.dpkg_arch = type { %struct.dpkg_arch*, i8*, i32 }
%struct.dpkg_version = type { i32, i8*, i8* }

!170 = !DIEnumerator(name: "dbg_veryverbose", value: 512)
!171 = !DIEnumerator(name: "dbg_stupidlyverbose", value: 1024)
!172 = !DIEnumerator(name: "dbg_triggers", value: 4096)
!173 = !DIEnumerator(name: "dbg_triggersdetail", value: 8192)
!174 = !DIEnumerator(name: "dbg_triggersstupid", value: 16384)
!175 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "dpkg_msg_type", file: !176, line: 36, size: 32, align: 32, elements: !177)
!176 = !DIFile(filename: "../lib/dpkg/error.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!177 = !{!178, !179, !180}
!178 = !DIEnumerator(name: "DPKG_MSG_NONE", value: 0)
!179 = !DIEnumerator(name: "DPKG_MSG_WARN", value: 1)
!180 = !DIEnumerator(name: "DPKG_MSG_ERROR", value: 2)
!181 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !182, line: 41, size: 32, align: 32, elements: !183)
!182 = !DIFile(filename: "../lib/dpkg/ehandle.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!183 = !{!184, !185, !186}
!184 = !DIEnumerator(name: "ehflag_normaltidy", value: 1)
!185 = !DIEnumerator(name: "ehflag_bombout", value: 2)
!186 = !DIEnumerator(name: "ehflag_recursiveerror", value: 4)
!187 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "conffopt", file: !188, line: 61, size: 32, align: 32, elements: !189)
!188 = !DIFile(filename: "configure.c", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!189 = !{!190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204}
!190 = !DIEnumerator(name: "CFOF_PROMPT", value: 1)
!191 = !DIEnumerator(name: "CFOF_KEEP", value: 2)
!192 = !DIEnumerator(name: "CFOF_INSTALL", value: 4)
!193 = !DIEnumerator(name: "CFOF_BACKUP", value: 8)
!194 = !DIEnumerator(name: "CFOF_NEW_CONFF", value: 16)
!195 = !DIEnumerator(name: "CFOF_IS_NEW", value: 32)
!196 = !DIEnumerator(name: "CFOF_IS_OLD", value: 64)
!197 = !DIEnumerator(name: "CFOF_USER_DEL", value: 128)
!198 = !DIEnumerator(name: "CFO_KEEP", value: 2)
!199 = !DIEnumerator(name: "CFO_IDENTICAL", value: 2)
!200 = !DIEnumerator(name: "CFO_INSTALL", value: 4)
!201 = !DIEnumerator(name: "CFO_NEW_CONFF", value: 20)
!202 = !DIEnumerator(name: "CFO_PROMPT", value: 1)
!203 = !DIEnumerator(name: "CFO_PROMPT_KEEP", value: 3)
!204 = !DIEnumerator(name: "CFO_PROMPT_INSTALL", value: 5)
!205 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "fsys_hash_find_flags", file: !92, line: 54, size: 32, align: 32, elements: !206)
!206 = !{!207, !208}
!207 = !DIEnumerator(name: "FHFF_NOCOPY", value: 1)
!208 = !DIEnumerator(name: "FHFF_NONE", value: 2)
!209 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !210, line: 46, size: 32, align: 32, elements: !211)
!210 = !DIFile(filename: "/usr/include/ctype.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!211 = !{!212, !213, !214, !215, !216, !217, !218, !219, !220, !221, !222, !223}
!212 = !DIEnumerator(name: "_ISupper", value: 256)
!213 = !DIEnumerator(name: "_ISlower", value: 512)
!214 = !DIEnumerator(name: "_ISalpha", value: 1024)
!215 = !DIEnumerator(name: "_ISdigit", value: 2048)
!216 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!217 = !DIEnumerator(name: "_ISspace", value: 8192)
!218 = !DIEnumerator(name: "_ISprint", value: 16384)
!219 = !DIEnumerator(name: "_ISgraph", value: 32768)
!220 = !DIEnumerator(name: "_ISblank", value: 1)
!221 = !DIEnumerator(name: "_IScntrl", value: 2)
!222 = !DIEnumerator(name: "_ISpunct", value: 4)
!223 = !DIEnumerator(name: "_ISalnum", value: 8)
!224 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "subproc_flags", file: !225, line: 36, size: 32, align: 32, elements: !226)
!225 = !DIFile(filename: "../lib/dpkg/subproc.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!226 = !{!227, !228, !229, !230, !231, !232}
!227 = !DIEnumerator(name: "SUBPROC_NORMAL", value: 0)
!228 = !DIEnumerator(name: "SUBPROC_WARN", value: 1)
!229 = !DIEnumerator(name: "SUBPROC_NOPIPE", value: 2)
!230 = !DIEnumerator(name: "SUBPROC_NOCHECK", value: 4)
!231 = !DIEnumerator(name: "SUBPROC_RETERROR", value: 8)
!232 = !DIEnumerator(name: "SUBPROC_RETSIGNO", value: 8)
!233 = !{!234, !235, !238, !239}
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!235 = !DIDerivedType(tag: DW_TAG_typedef, name: "intmax_t", file: !236, line: 134, baseType: !237)
!236 = !DIFile(filename: "/usr/include/stdint.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!237 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!238 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!239 = !DIBasicType(name: "unsigned short", size: 16, align: 16, encoding: DW_ATE_unsigned)
!240 = !{!241, !469, !473}
!241 = distinct !DIGlobalVariable(name: "target", scope: !242, file: !188, line: 702, type: !460, isLocal: true, isDefinition: true, variable: %struct.varbuf* @conffderef.target)
!242 = distinct !DISubprogram(name: "conffderef", scope: !188, file: !188, line: 700, type: !243, isLocal: false, isDefinition: true, scopeLine: 701, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !468)
!243 = !DISubroutineType(types: !244)
!244 = !{!238, !245, !459, !254}
!245 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !246, size: 64, align: 64)
!246 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkginfo", file: !4, line: 195, size: 3072, align: 64, elements: !247)
!247 = !{!248, !299, !300, !301, !302, !303, !304, !305, !306, !307, !337, !338, !354, !363, !379, !380, !386, !454, !457, !458}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "set", scope: !246, file: !4, line: 196, baseType: !249, size: 64, align: 64)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !250, size: 64, align: 64)
!250 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgset", file: !4, line: 242, size: 3392, align: 64, elements: !251)
!251 = !{!252, !253, !257, !258, !298}
!252 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !250, file: !4, line: 243, baseType: !249, size: 64, align: 64)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !250, file: !4, line: 244, baseType: !254, size: 64, align: 64, offset: 64)
!254 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !255, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !256)
!256 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !250, file: !4, line: 245, baseType: !246, size: 3072, align: 64, offset: 128)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "depended", scope: !250, file: !4, line: 249, baseType: !259, size: 128, align: 64, offset: 3200)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !250, file: !4, line: 246, size: 128, align: 64, elements: !260)
!260 = !{!261, !297}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !259, file: !4, line: 247, baseType: !262, size: 64, align: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64, align: 64)
!263 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "deppossi", file: !4, line: 63, size: 640, align: 64, elements: !264)
!264 = !{!265, !273, !274, !275, !276, !277, !286, !293, !294, !296}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !263, file: !4, line: 64, baseType: !266, size: 64, align: 64)
!266 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !267, size: 64, align: 64)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dependency", file: !4, line: 56, size: 256, align: 64, elements: !268)
!268 = !{!269, !270, !271, !272}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "up", scope: !267, file: !4, line: 57, baseType: !245, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !267, file: !4, line: 58, baseType: !266, size: 64, align: 64, offset: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "list", scope: !267, file: !4, line: 59, baseType: !262, size: 64, align: 64, offset: 128)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !267, file: !4, line: 60, baseType: !3, size: 32, align: 32, offset: 192)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "ed", scope: !263, file: !4, line: 65, baseType: !249, size: 64, align: 64, offset: 64)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !263, file: !4, line: 66, baseType: !262, size: 64, align: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "rev_next", scope: !263, file: !4, line: 66, baseType: !262, size: 64, align: 64, offset: 192)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "rev_prev", scope: !263, file: !4, line: 66, baseType: !262, size: 64, align: 64, offset: 256)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !263, file: !4, line: 67, baseType: !278, size: 64, align: 64, offset: 320)
!278 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !279, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !280)
!280 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_arch", file: !16, line: 48, size: 192, align: 64, elements: !281)
!281 = !{!282, !284, !285}
!282 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !280, file: !16, line: 49, baseType: !283, size: 64, align: 64)
!283 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !280, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !280, file: !16, line: 50, baseType: !254, size: 64, align: 64, offset: 64)
!285 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !280, file: !16, line: 51, baseType: !15, size: 32, align: 32, offset: 128)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !263, file: !4, line: 68, baseType: !287, size: 192, align: 64, offset: 384)
!287 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_version", file: !27, line: 42, size: 192, align: 64, elements: !288)
!288 = !{!289, !291, !292}
!289 = !DIDerivedType(tag: DW_TAG_member, name: "epoch", scope: !287, file: !27, line: 44, baseType: !290, size: 32, align: 32)
!290 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !287, file: !27, line: 46, baseType: !254, size: 64, align: 64, offset: 64)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "revision", scope: !287, file: !27, line: 48, baseType: !254, size: 64, align: 64, offset: 128)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "verrel", scope: !263, file: !4, line: 69, baseType: !26, size: 32, align: 32, offset: 576)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "arch_is_implicit", scope: !263, file: !4, line: 70, baseType: !295, size: 8, align: 8, offset: 608)
!295 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "cyclebreak", scope: !263, file: !4, line: 71, baseType: !295, size: 8, align: 8, offset: 616)
!297 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !259, file: !4, line: 248, baseType: !262, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "installed_instances", scope: !250, file: !4, line: 250, baseType: !238, size: 32, align: 32, offset: 3328)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "arch_next", scope: !246, file: !4, line: 197, baseType: !245, size: 64, align: 64, offset: 64)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "want", scope: !246, file: !4, line: 199, baseType: !35, size: 32, align: 32, offset: 128)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "eflag", scope: !246, file: !4, line: 201, baseType: !43, size: 32, align: 32, offset: 160)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "status", scope: !246, file: !4, line: 202, baseType: !47, size: 32, align: 32, offset: 192)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "priority", scope: !246, file: !4, line: 203, baseType: !57, size: 32, align: 32, offset: 224)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "otherpriority", scope: !246, file: !4, line: 204, baseType: !254, size: 64, align: 64, offset: 256)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "section", scope: !246, file: !4, line: 205, baseType: !254, size: 64, align: 64, offset: 320)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "configversion", scope: !246, file: !4, line: 206, baseType: !287, size: 192, align: 64, offset: 384)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "installed", scope: !246, file: !4, line: 207, baseType: !308, size: 960, align: 64, offset: 576)
!308 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkgbin", file: !4, line: 107, size: 960, align: 64, elements: !309)
!309 = !{!310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !330}
!310 = !DIDerivedType(tag: DW_TAG_member, name: "depends", scope: !308, file: !4, line: 108, baseType: !266, size: 64, align: 64)
!311 = !DIDerivedType(tag: DW_TAG_member, name: "essential", scope: !308, file: !4, line: 110, baseType: !295, size: 8, align: 8, offset: 64)
!312 = !DIDerivedType(tag: DW_TAG_member, name: "multiarch", scope: !308, file: !4, line: 111, baseType: !67, size: 32, align: 32, offset: 96)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "arch", scope: !308, file: !4, line: 112, baseType: !278, size: 64, align: 64, offset: 128)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "pkgname_archqual", scope: !308, file: !4, line: 115, baseType: !254, size: 64, align: 64, offset: 192)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "description", scope: !308, file: !4, line: 116, baseType: !254, size: 64, align: 64, offset: 256)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "maintainer", scope: !308, file: !4, line: 117, baseType: !254, size: 64, align: 64, offset: 320)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "source", scope: !308, file: !4, line: 118, baseType: !254, size: 64, align: 64, offset: 384)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "installedsize", scope: !308, file: !4, line: 119, baseType: !254, size: 64, align: 64, offset: 448)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "origin", scope: !308, file: !4, line: 120, baseType: !254, size: 64, align: 64, offset: 512)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "bugs", scope: !308, file: !4, line: 121, baseType: !254, size: 64, align: 64, offset: 576)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !308, file: !4, line: 122, baseType: !287, size: 192, align: 64, offset: 640)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "conffiles", scope: !308, file: !4, line: 123, baseType: !323, size: 64, align: 64, offset: 832)
!323 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !324, size: 64, align: 64)
!324 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "conffile", file: !4, line: 80, size: 256, align: 64, elements: !325)
!325 = !{!326, !327, !328, !329}
!326 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !324, file: !4, line: 81, baseType: !323, size: 64, align: 64)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !324, file: !4, line: 82, baseType: !254, size: 64, align: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "hash", scope: !324, file: !4, line: 83, baseType: !254, size: 64, align: 64, offset: 128)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "obsolete", scope: !324, file: !4, line: 84, baseType: !295, size: 8, align: 8, offset: 192)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "arbs", scope: !308, file: !4, line: 124, baseType: !331, size: 64, align: 64, offset: 896)
!331 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64, align: 64)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "arbitraryfield", file: !4, line: 74, size: 192, align: 64, elements: !333)
!333 = !{!334, !335, !336}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !332, file: !4, line: 75, baseType: !331, size: 64, align: 64)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !332, file: !4, line: 76, baseType: !254, size: 64, align: 64, offset: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !332, file: !4, line: 77, baseType: !254, size: 64, align: 64, offset: 128)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "available", scope: !246, file: !4, line: 208, baseType: !308, size: 960, align: 64, offset: 1536)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "clientdata", scope: !246, file: !4, line: 209, baseType: !339, size: 64, align: 64, offset: 2496)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !340, size: 64, align: 64)
!340 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "perpackagestate", file: !74, line: 53, size: 256, align: 64, elements: !341)
!341 = !{!342, !343, !344, !345, !346, !347}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "istobe", scope: !340, file: !74, line: 54, baseType: !73, size: 32, align: 32)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !340, file: !74, line: 57, baseType: !81, size: 32, align: 32, offset: 32)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "enqueued", scope: !340, file: !74, line: 59, baseType: !295, size: 8, align: 8, offset: 64)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "replacingfilesandsaid", scope: !340, file: !74, line: 61, baseType: !238, size: 32, align: 32, offset: 96)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "cmdline_seen", scope: !340, file: !74, line: 62, baseType: !238, size: 32, align: 32, offset: 128)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "trigprocdeferred", scope: !340, file: !74, line: 65, baseType: !348, size: 64, align: 64, offset: 192)
!348 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !349, size: 64, align: 64)
!349 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "pkg_list", file: !350, line: 34, size: 128, align: 64, elements: !351)
!350 = !DIFile(filename: "../lib/dpkg/pkg-list.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!351 = !{!352, !353}
!352 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !349, file: !350, line: 35, baseType: !348, size: 64, align: 64)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !349, file: !350, line: 36, baseType: !245, size: 64, align: 64, offset: 64)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "archives", scope: !246, file: !4, line: 211, baseType: !355, size: 64, align: 64, offset: 2560)
!355 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64, align: 64)
!356 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "archivedetails", file: !4, line: 87, size: 320, align: 64, elements: !357)
!357 = !{!358, !359, !360, !361, !362}
!358 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !356, file: !4, line: 88, baseType: !355, size: 64, align: 64)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !356, file: !4, line: 89, baseType: !254, size: 64, align: 64, offset: 64)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "msdosname", scope: !356, file: !4, line: 90, baseType: !254, size: 64, align: 64, offset: 128)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !356, file: !4, line: 91, baseType: !254, size: 64, align: 64, offset: 192)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "md5sum", scope: !356, file: !4, line: 92, baseType: !254, size: 64, align: 64, offset: 256)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "trigaw", scope: !246, file: !4, line: 216, baseType: !364, size: 128, align: 64, offset: 2624)
!364 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !246, file: !4, line: 213, size: 128, align: 64, elements: !365)
!365 = !{!366, !378}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "head", scope: !364, file: !4, line: 215, baseType: !367, size: 64, align: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !368, size: 64, align: 64)
!368 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigaw", file: !4, line: 142, size: 320, align: 64, elements: !369)
!369 = !{!370, !371, !372, !373}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "aw", scope: !368, file: !4, line: 143, baseType: !245, size: 64, align: 64)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "pend", scope: !368, file: !4, line: 143, baseType: !245, size: 64, align: 64, offset: 64)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "samepend_next", scope: !368, file: !4, line: 144, baseType: !367, size: 64, align: 64, offset: 128)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "sameaw", scope: !368, file: !4, line: 147, baseType: !374, size: 128, align: 64, offset: 192)
!374 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !368, file: !4, line: 145, size: 128, align: 64, elements: !375)
!375 = !{!376, !377}
!376 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !374, file: !4, line: 146, baseType: !367, size: 64, align: 64)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !374, file: !4, line: 146, baseType: !367, size: 64, align: 64, offset: 64)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "tail", scope: !364, file: !4, line: 215, baseType: !367, size: 64, align: 64, offset: 64)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "othertrigaw_head", scope: !246, file: !4, line: 219, baseType: !367, size: 64, align: 64, offset: 2752)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "trigpend_head", scope: !246, file: !4, line: 220, baseType: !381, size: 64, align: 64, offset: 2816)
!381 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !382, size: 64, align: 64)
!382 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigpend", file: !4, line: 134, size: 128, align: 64, elements: !383)
!383 = !{!384, !385}
!384 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !382, file: !4, line: 135, baseType: !381, size: 64, align: 64)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !382, file: !4, line: 136, baseType: !254, size: 64, align: 64, offset: 64)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "files", scope: !246, file: !4, line: 231, baseType: !387, size: 64, align: 64, offset: 2880)
!387 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !388, size: 64, align: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode_list", file: !92, line: 122, size: 128, align: 64, elements: !389)
!389 = !{!390, !391}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !388, file: !92, line: 123, baseType: !387, size: 64, align: 64)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "namenode", scope: !388, file: !92, line: 124, baseType: !392, size: 64, align: 64, offset: 64)
!392 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !393, size: 64, align: 64)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_namenode", file: !92, line: 90, size: 640, align: 64, elements: !394)
!394 = !{!395, !396, !397, !398, !406, !425, !440, !441, !442, !443}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !393, file: !92, line: 91, baseType: !392, size: 64, align: 64)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !393, file: !92, line: 92, baseType: !254, size: 64, align: 64, offset: 64)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "packages", scope: !393, file: !92, line: 93, baseType: !348, size: 64, align: 64, offset: 128)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "divert", scope: !393, file: !92, line: 94, baseType: !399, size: 64, align: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64, align: 64)
!400 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "fsys_diversion", file: !92, line: 151, size: 256, align: 64, elements: !401)
!401 = !{!402, !403, !404, !405}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "useinstead", scope: !400, file: !92, line: 152, baseType: !392, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "camefrom", scope: !400, file: !92, line: 153, baseType: !392, size: 64, align: 64, offset: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "pkgset", scope: !400, file: !92, line: 154, baseType: !249, size: 64, align: 64, offset: 128)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !400, file: !92, line: 157, baseType: !399, size: 64, align: 64, offset: 192)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "statoverride", scope: !393, file: !92, line: 101, baseType: !407, size: 64, align: 64, offset: 256)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !408, size: 64, align: 64)
!408 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !409, line: 40, size: 256, align: 64, elements: !410)
!409 = !DIFile(filename: "../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!410 = !{!411, !416, !419, !422, !424}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !408, file: !409, line: 41, baseType: !412, size: 32, align: 32)
!412 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !413, line: 80, baseType: !414)
!413 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!414 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !415, line: 125, baseType: !290)
!415 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!416 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !408, file: !409, line: 42, baseType: !417, size: 32, align: 32, offset: 32)
!417 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !413, line: 65, baseType: !418)
!418 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !415, line: 126, baseType: !290)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !408, file: !409, line: 43, baseType: !420, size: 32, align: 32, offset: 64)
!420 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !413, line: 70, baseType: !421)
!421 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !415, line: 129, baseType: !290)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !408, file: !409, line: 47, baseType: !423, size: 64, align: 64, offset: 128)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !256, size: 64, align: 64)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !408, file: !409, line: 48, baseType: !423, size: 64, align: 64, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "trig_interested", scope: !393, file: !92, line: 103, baseType: !426, size: 64, align: 64, offset: 320)
!426 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !427, size: 64, align: 64)
!427 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "trigfileint", file: !87, line: 54, size: 448, align: 64, elements: !428)
!428 = !{!429, !430, !432, !433, !434, !435}
!429 = !DIDerivedType(tag: DW_TAG_member, name: "pkg", scope: !427, file: !87, line: 55, baseType: !245, size: 64, align: 64)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "pkgbin", scope: !427, file: !87, line: 56, baseType: !431, size: 64, align: 64, offset: 64)
!431 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !308, size: 64, align: 64)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "fnn", scope: !427, file: !87, line: 57, baseType: !392, size: 64, align: 64, offset: 128)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "options", scope: !427, file: !87, line: 58, baseType: !86, size: 32, align: 32, offset: 192)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "samefile_next", scope: !427, file: !87, line: 59, baseType: !426, size: 64, align: 64, offset: 256)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "inoverall", scope: !427, file: !87, line: 62, baseType: !436, size: 128, align: 64, offset: 320)
!436 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !427, file: !87, line: 60, size: 128, align: 64, elements: !437)
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !436, file: !87, line: 61, baseType: !426, size: 64, align: 64)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "prev", scope: !436, file: !87, line: 61, baseType: !426, size: 64, align: 64, offset: 64)
!440 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !393, file: !92, line: 111, baseType: !91, size: 32, align: 32, offset: 384)
!441 = !DIDerivedType(tag: DW_TAG_member, name: "oldhash", scope: !393, file: !92, line: 114, baseType: !254, size: 64, align: 64, offset: 448)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "newhash", scope: !393, file: !92, line: 117, baseType: !254, size: 64, align: 64, offset: 512)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "file_ondisk_id", scope: !393, file: !92, line: 119, baseType: !444, size: 64, align: 64, offset: 576)
!444 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !445, size: 64, align: 64)
!445 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_ondisk_id", file: !92, line: 85, size: 128, align: 64, elements: !446)
!446 = !{!447, !451}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "id_dev", scope: !445, file: !92, line: 86, baseType: !448, size: 64, align: 64)
!448 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !413, line: 60, baseType: !449)
!449 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !415, line: 124, baseType: !450)
!450 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!451 = !DIDerivedType(tag: DW_TAG_member, name: "id_ino", scope: !445, file: !92, line: 87, baseType: !452, size: 64, align: 64, offset: 64)
!452 = !DIDerivedType(tag: DW_TAG_typedef, name: "ino_t", file: !413, line: 48, baseType: !453)
!453 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !415, line: 127, baseType: !450)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_phys_offs", scope: !246, file: !4, line: 232, baseType: !455, size: 64, align: 64, offset: 2944)
!455 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !413, line: 86, baseType: !456)
!456 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !415, line: 131, baseType: !237)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "files_list_valid", scope: !246, file: !4, line: 233, baseType: !295, size: 8, align: 8, offset: 3008)
!458 = !DIDerivedType(tag: DW_TAG_member, name: "status_dirty", scope: !246, file: !4, line: 236, baseType: !295, size: 8, align: 8, offset: 3016)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64, align: 64)
!460 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "varbuf", file: !461, line: 55, size: 192, align: 64, elements: !462)
!461 = !DIFile(filename: "../lib/dpkg/varbuf.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!462 = !{!463, !466, !467}
!463 = !DIDerivedType(tag: DW_TAG_member, name: "used", scope: !460, file: !461, line: 56, baseType: !464, size: 64, align: 64)
!464 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !465, line: 216, baseType: !450)
!465 = !DIFile(filename: "/usr/lib/gcc/x86_64-linux-gnu/5/include/stddef.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!466 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !460, file: !461, line: 56, baseType: !464, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !460, file: !461, line: 57, baseType: !423, size: 64, align: 64, offset: 128)
!468 = !{}
!469 = distinct !DIGlobalVariable(name: "fd", scope: !470, file: !188, line: 811, type: !238, isLocal: true, isDefinition: true, variable: i32* @md5hash.fd)
!470 = distinct !DISubprogram(name: "md5hash", scope: !188, file: !188, line: 808, type: !471, isLocal: false, isDefinition: true, scopeLine: 809, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !468)
!471 = !DISubroutineType(types: !472)
!472 = !{null, !245, !423, !254}
!473 = distinct !DIGlobalVariable(name: "conffoptcells", scope: !0, file: !188, line: 80, type: !474, isLocal: true, isDefinition: true, variable: [2 x [2 x i32]]* @conffoptcells)
!474 = !DICompositeType(tag: DW_TAG_array_type, baseType: !238, size: 128, align: 32, elements: !475)
!475 = !{!476, !476}
!476 = !DISubrange(count: 2)
!477 = !{i32 2, !"Dwarf Version", i32 4}
!478 = !{i32 2, !"Debug Info Version", i32 3}
!479 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!480 = distinct !DISubprogram(name: "deferred_configure", scope: !188, file: !188, line: 542, type: !481, isLocal: false, isDefinition: true, scopeLine: 543, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !468)
!481 = !DISubroutineType(types: !482)
!482 = !{null, !245}
!483 = !DILocalVariable(name: "pkg", arg: 1, scope: !480, file: !188, line: 542, type: !245)
!484 = !DIExpression()
!485 = !DILocation(line: 542, column: 36, scope: !480)
!486 = !DILocalVariable(name: "aemsgs", scope: !480, file: !188, line: 544, type: !460)
!487 = !DILocation(line: 544, column: 16, scope: !480)
!488 = !DILocalVariable(name: "conff", scope: !480, file: !188, line: 545, type: !323)
!489 = !DILocation(line: 545, column: 19, scope: !480)
!490 = !DILocalVariable(name: "otherpkg", scope: !480, file: !188, line: 546, type: !245)
!491 = !DILocation(line: 546, column: 18, scope: !480)
!492 = !DILocalVariable(name: "ok", scope: !480, file: !188, line: 547, type: !104)
!493 = !DILocation(line: 547, column: 17, scope: !480)
!494 = !DILocation(line: 549, column: 6, scope: !495)
!495 = distinct !DILexicalBlock(scope: !480, file: !188, line: 549, column: 6)
!496 = !DILocation(line: 549, column: 11, scope: !495)
!497 = !DILocation(line: 549, column: 18, scope: !495)
!498 = !DILocation(line: 549, column: 6, scope: !480)
!499 = !DILocation(line: 550, column: 10, scope: !495)
!500 = !DILocation(line: 551, column: 19, scope: !495)
!501 = !DILocation(line: 551, column: 10, scope: !495)
!502 = !DILocation(line: 550, column: 3, scope: !503)
!503 = !DILexicalBlockFile(scope: !495, file: !188, discriminator: 1)
!504 = !DILocation(line: 550, column: 3, scope: !495)
!505 = !DILocation(line: 552, column: 6, scope: !506)
!506 = distinct !DILexicalBlock(scope: !480, file: !188, line: 552, column: 6)
!507 = !DILocation(line: 552, column: 11, scope: !506)
!508 = !DILocation(line: 552, column: 18, scope: !506)
!509 = !DILocation(line: 552, column: 6, scope: !480)
!510 = !DILocation(line: 553, column: 10, scope: !506)
!511 = !DILocation(line: 554, column: 19, scope: !506)
!512 = !DILocation(line: 554, column: 10, scope: !506)
!513 = !DILocation(line: 553, column: 3, scope: !514)
!514 = !DILexicalBlockFile(scope: !506, file: !188, discriminator: 1)
!515 = !DILocation(line: 553, column: 3, scope: !506)
!516 = !DILocation(line: 555, column: 6, scope: !517)
!517 = distinct !DILexicalBlock(scope: !480, file: !188, line: 555, column: 6)
!518 = !DILocation(line: 555, column: 11, scope: !517)
!519 = !DILocation(line: 555, column: 18, scope: !517)
!520 = !DILocation(line: 555, column: 39, scope: !517)
!521 = !DILocation(line: 556, column: 6, scope: !517)
!522 = !DILocation(line: 556, column: 11, scope: !517)
!523 = !DILocation(line: 556, column: 18, scope: !517)
!524 = !DILocation(line: 555, column: 6, scope: !525)
!525 = !DILexicalBlockFile(scope: !480, file: !188, discriminator: 1)
!526 = !DILocation(line: 557, column: 10, scope: !517)
!527 = !DILocation(line: 559, column: 19, scope: !517)
!528 = !DILocation(line: 559, column: 10, scope: !517)
!529 = !DILocation(line: 560, column: 26, scope: !517)
!530 = !DILocation(line: 560, column: 10, scope: !517)
!531 = !DILocation(line: 557, column: 3, scope: !532)
!532 = !DILexicalBlockFile(scope: !517, file: !188, discriminator: 1)
!533 = !DILocation(line: 557, column: 3, scope: !517)
!534 = !DILocation(line: 562, column: 19, scope: !535)
!535 = distinct !DILexicalBlock(scope: !480, file: !188, line: 562, column: 2)
!536 = !DILocation(line: 562, column: 24, scope: !535)
!537 = !DILocation(line: 562, column: 29, scope: !535)
!538 = !DILocation(line: 562, column: 16, scope: !535)
!539 = !DILocation(line: 562, column: 7, scope: !535)
!540 = !DILocation(line: 562, column: 34, scope: !541)
!541 = !DILexicalBlockFile(scope: !542, file: !188, discriminator: 1)
!542 = distinct !DILexicalBlock(scope: !535, file: !188, line: 562, column: 2)
!543 = !DILocation(line: 562, column: 2, scope: !541)
!544 = !DILocation(line: 563, column: 7, scope: !545)
!545 = distinct !DILexicalBlock(scope: !546, file: !188, line: 563, column: 7)
!546 = distinct !DILexicalBlock(scope: !542, file: !188, line: 562, column: 76)
!547 = !DILocation(line: 563, column: 19, scope: !545)
!548 = !DILocation(line: 563, column: 16, scope: !545)
!549 = !DILocation(line: 563, column: 7, scope: !546)
!550 = !DILocation(line: 564, column: 4, scope: !545)
!551 = !DILocation(line: 565, column: 7, scope: !552)
!552 = distinct !DILexicalBlock(scope: !546, file: !188, line: 565, column: 7)
!553 = !DILocation(line: 565, column: 17, scope: !552)
!554 = !DILocation(line: 565, column: 24, scope: !552)
!555 = !DILocation(line: 565, column: 7, scope: !546)
!556 = !DILocation(line: 566, column: 4, scope: !552)
!557 = !DILocation(line: 568, column: 7, scope: !558)
!558 = distinct !DILexicalBlock(scope: !546, file: !188, line: 568, column: 7)
!559 = !DILocation(line: 568, column: 17, scope: !558)
!560 = !DILocation(line: 568, column: 24, scope: !558)
!561 = !DILocation(line: 568, column: 7, scope: !546)
!562 = !DILocation(line: 569, column: 11, scope: !558)
!563 = !DILocation(line: 571, column: 20, scope: !558)
!564 = !DILocation(line: 571, column: 11, scope: !558)
!565 = !DILocation(line: 572, column: 20, scope: !558)
!566 = !DILocation(line: 572, column: 11, scope: !558)
!567 = !DILocation(line: 573, column: 27, scope: !558)
!568 = !DILocation(line: 573, column: 11, scope: !558)
!569 = !DILocation(line: 569, column: 4, scope: !570)
!570 = !DILexicalBlockFile(scope: !558, file: !188, discriminator: 1)
!571 = !DILocation(line: 569, column: 4, scope: !558)
!572 = !DILocation(line: 575, column: 29, scope: !573)
!573 = distinct !DILexicalBlock(scope: !546, file: !188, line: 575, column: 7)
!574 = !DILocation(line: 575, column: 34, scope: !573)
!575 = !DILocation(line: 575, column: 44, scope: !573)
!576 = !DILocation(line: 576, column: 29, scope: !573)
!577 = !DILocation(line: 576, column: 39, scope: !573)
!578 = !DILocation(line: 576, column: 49, scope: !573)
!579 = !DILocation(line: 575, column: 7, scope: !573)
!580 = !DILocation(line: 575, column: 7, scope: !546)
!581 = !DILocation(line: 577, column: 11, scope: !573)
!582 = !DILocation(line: 579, column: 20, scope: !573)
!583 = !DILocation(line: 579, column: 11, scope: !573)
!584 = !DILocation(line: 580, column: 28, scope: !573)
!585 = !DILocation(line: 580, column: 33, scope: !573)
!586 = !DILocation(line: 580, column: 43, scope: !573)
!587 = !DILocation(line: 580, column: 11, scope: !573)
!588 = !DILocation(line: 582, column: 20, scope: !573)
!589 = !DILocation(line: 582, column: 11, scope: !573)
!590 = !DILocation(line: 583, column: 28, scope: !573)
!591 = !DILocation(line: 583, column: 38, scope: !573)
!592 = !DILocation(line: 583, column: 48, scope: !573)
!593 = !DILocation(line: 583, column: 11, scope: !573)
!594 = !DILocation(line: 577, column: 4, scope: !595)
!595 = !DILexicalBlockFile(scope: !573, file: !188, discriminator: 1)
!596 = !DILocation(line: 577, column: 4, scope: !573)
!597 = !DILocation(line: 585, column: 2, scope: !546)
!598 = !DILocation(line: 562, column: 55, scope: !599)
!599 = !DILexicalBlockFile(scope: !542, file: !188, discriminator: 2)
!600 = !DILocation(line: 562, column: 65, scope: !599)
!601 = !DILocation(line: 562, column: 53, scope: !599)
!602 = !DILocation(line: 562, column: 2, scope: !599)
!603 = distinct !{!603, !604}
!604 = !DILocation(line: 562, column: 2, scope: !480)
!605 = !DILocation(line: 587, column: 6, scope: !606)
!606 = distinct !DILexicalBlock(scope: !480, file: !188, line: 587, column: 6)
!607 = !DILocation(line: 587, column: 16, scope: !606)
!608 = !DILocation(line: 587, column: 6, scope: !480)
!609 = !DILocation(line: 588, column: 22, scope: !610)
!610 = distinct !DILexicalBlock(scope: !606, file: !188, line: 588, column: 7)
!611 = !DILocation(line: 588, column: 7, scope: !610)
!612 = !DILocation(line: 588, column: 7, scope: !606)
!613 = !DILocation(line: 589, column: 17, scope: !610)
!614 = !DILocation(line: 589, column: 4, scope: !610)
!615 = !DILocation(line: 588, column: 25, scope: !616)
!616 = !DILexicalBlockFile(scope: !610, file: !188, discriminator: 1)
!617 = !DILocation(line: 591, column: 23, scope: !480)
!618 = !DILocation(line: 591, column: 7, scope: !480)
!619 = !DILocation(line: 591, column: 5, scope: !480)
!620 = !DILocation(line: 592, column: 6, scope: !621)
!621 = distinct !DILexicalBlock(scope: !480, file: !188, line: 592, column: 6)
!622 = !DILocation(line: 592, column: 9, scope: !621)
!623 = !DILocation(line: 592, column: 6, scope: !480)
!624 = !DILocation(line: 593, column: 3, scope: !625)
!625 = distinct !DILexicalBlock(scope: !621, file: !188, line: 592, column: 29)
!626 = !DILocation(line: 594, column: 29, scope: !625)
!627 = !DILocation(line: 594, column: 3, scope: !625)
!628 = !DILocation(line: 595, column: 3, scope: !625)
!629 = !DILocation(line: 595, column: 8, scope: !625)
!630 = !DILocation(line: 595, column: 20, scope: !625)
!631 = !DILocation(line: 595, column: 27, scope: !625)
!632 = !DILocation(line: 596, column: 19, scope: !625)
!633 = !DILocation(line: 596, column: 3, scope: !625)
!634 = !DILocation(line: 597, column: 3, scope: !625)
!635 = !DILocation(line: 600, column: 2, scope: !480)
!636 = !DILocation(line: 610, column: 19, scope: !480)
!637 = !DILocation(line: 610, column: 7, scope: !480)
!638 = !DILocation(line: 610, column: 35, scope: !525)
!639 = !DILocation(line: 610, column: 7, scope: !525)
!640 = !DILocation(line: 610, column: 7, scope: !641)
!641 = !DILexicalBlockFile(scope: !480, file: !188, discriminator: 2)
!642 = !DILocation(line: 610, column: 7, scope: !643)
!643 = !DILexicalBlockFile(scope: !480, file: !188, discriminator: 3)
!644 = !DILocation(line: 610, column: 5, scope: !643)
!645 = !DILocation(line: 611, column: 6, scope: !646)
!646 = distinct !DILexicalBlock(scope: !480, file: !188, line: 611, column: 6)
!647 = !DILocation(line: 611, column: 9, scope: !646)
!648 = !DILocation(line: 611, column: 6, scope: !480)
!649 = !DILocation(line: 612, column: 16, scope: !650)
!650 = distinct !DILexicalBlock(scope: !646, file: !188, line: 611, column: 28)
!651 = !DILocation(line: 613, column: 3, scope: !650)
!652 = !DILocation(line: 614, column: 10, scope: !650)
!653 = !DILocation(line: 615, column: 19, scope: !650)
!654 = !DILocation(line: 615, column: 10, scope: !650)
!655 = !DILocation(line: 615, column: 47, scope: !650)
!656 = !DILocation(line: 614, column: 3, scope: !657)
!657 = !DILexicalBlockFile(scope: !650, file: !188, discriminator: 1)
!658 = !DILocation(line: 616, column: 3, scope: !650)
!659 = !DILocation(line: 617, column: 10, scope: !650)
!660 = !DILocation(line: 617, column: 3, scope: !657)
!661 = !DILocation(line: 617, column: 3, scope: !650)
!662 = !DILocation(line: 618, column: 20, scope: !663)
!663 = distinct !DILexicalBlock(scope: !646, file: !188, line: 618, column: 13)
!664 = !DILocation(line: 618, column: 13, scope: !663)
!665 = !DILocation(line: 618, column: 13, scope: !646)
!666 = !DILocation(line: 619, column: 3, scope: !667)
!667 = distinct !DILexicalBlock(scope: !663, file: !188, line: 618, column: 26)
!668 = !DILocation(line: 620, column: 10, scope: !667)
!669 = !DILocation(line: 621, column: 19, scope: !667)
!670 = !DILocation(line: 621, column: 10, scope: !667)
!671 = !DILocation(line: 621, column: 47, scope: !667)
!672 = !DILocation(line: 620, column: 3, scope: !673)
!673 = !DILexicalBlockFile(scope: !667, file: !188, discriminator: 1)
!674 = !DILocation(line: 622, column: 2, scope: !667)
!675 = !DILocation(line: 623, column: 2, scope: !480)
!676 = !DILocation(line: 624, column: 15, scope: !480)
!677 = !DILocation(line: 626, column: 6, scope: !678)
!678 = distinct !DILexicalBlock(scope: !480, file: !188, line: 626, column: 6)
!679 = !DILocation(line: 626, column: 11, scope: !678)
!680 = !DILocation(line: 626, column: 17, scope: !678)
!681 = !DILocation(line: 626, column: 6, scope: !480)
!682 = !DILocation(line: 628, column: 15, scope: !678)
!683 = !DILocation(line: 627, column: 3, scope: !678)
!684 = !DILocation(line: 631, column: 9, scope: !480)
!685 = !DILocation(line: 631, column: 55, scope: !480)
!686 = !DILocation(line: 631, column: 46, scope: !525)
!687 = !DILocation(line: 632, column: 26, scope: !480)
!688 = !DILocation(line: 632, column: 31, scope: !480)
!689 = !DILocation(line: 632, column: 41, scope: !480)
!690 = !DILocation(line: 632, column: 9, scope: !480)
!691 = !DILocation(line: 631, column: 2, scope: !641)
!692 = !DILocation(line: 633, column: 26, scope: !480)
!693 = !DILocation(line: 633, column: 32, scope: !480)
!694 = !DILocation(line: 633, column: 37, scope: !480)
!695 = !DILocation(line: 633, column: 2, scope: !480)
!696 = !DILocation(line: 635, column: 34, scope: !480)
!697 = !DILocation(line: 635, column: 2, scope: !480)
!698 = !DILocation(line: 637, column: 6, scope: !699)
!699 = distinct !DILexicalBlock(scope: !480, file: !188, line: 637, column: 6)
!700 = !DILocation(line: 637, column: 6, scope: !480)
!701 = !DILocation(line: 638, column: 18, scope: !702)
!702 = distinct !DILexicalBlock(scope: !699, file: !188, line: 637, column: 15)
!703 = !DILocation(line: 638, column: 3, scope: !702)
!704 = !DILocation(line: 639, column: 29, scope: !702)
!705 = !DILocation(line: 639, column: 3, scope: !702)
!706 = !DILocation(line: 640, column: 3, scope: !702)
!707 = !DILocation(line: 640, column: 8, scope: !702)
!708 = !DILocation(line: 640, column: 20, scope: !702)
!709 = !DILocation(line: 640, column: 27, scope: !702)
!710 = !DILocation(line: 641, column: 3, scope: !702)
!711 = !DILocation(line: 644, column: 6, scope: !712)
!712 = distinct !DILexicalBlock(scope: !480, file: !188, line: 644, column: 6)
!713 = !DILocation(line: 644, column: 11, scope: !712)
!714 = !DILocation(line: 644, column: 18, scope: !712)
!715 = !DILocation(line: 644, column: 6, scope: !480)
!716 = !DILocation(line: 645, column: 3, scope: !717)
!717 = distinct !DILexicalBlock(scope: !712, file: !188, line: 644, column: 40)
!718 = !DILocation(line: 654, column: 18, scope: !717)
!719 = !DILocation(line: 654, column: 3, scope: !717)
!720 = !DILocation(line: 662, column: 16, scope: !721)
!721 = distinct !DILexicalBlock(scope: !717, file: !188, line: 662, column: 3)
!722 = !DILocation(line: 662, column: 21, scope: !721)
!723 = !DILocation(line: 662, column: 31, scope: !721)
!724 = !DILocation(line: 662, column: 14, scope: !721)
!725 = !DILocation(line: 662, column: 8, scope: !721)
!726 = !DILocation(line: 662, column: 42, scope: !727)
!727 = !DILexicalBlockFile(scope: !728, file: !188, discriminator: 1)
!728 = distinct !DILexicalBlock(scope: !721, file: !188, line: 662, column: 3)
!729 = !DILocation(line: 662, column: 3, scope: !727)
!730 = !DILocation(line: 663, column: 8, scope: !731)
!731 = distinct !DILexicalBlock(scope: !732, file: !188, line: 663, column: 8)
!732 = distinct !DILexicalBlock(scope: !728, file: !188, line: 662, column: 70)
!733 = !DILocation(line: 663, column: 15, scope: !731)
!734 = !DILocation(line: 663, column: 8, scope: !732)
!735 = !DILocation(line: 664, column: 5, scope: !731)
!736 = !DILocation(line: 665, column: 32, scope: !732)
!737 = !DILocation(line: 665, column: 37, scope: !732)
!738 = !DILocation(line: 665, column: 4, scope: !732)
!739 = !DILocation(line: 666, column: 3, scope: !732)
!740 = !DILocation(line: 662, column: 57, scope: !741)
!741 = !DILexicalBlockFile(scope: !728, file: !188, discriminator: 2)
!742 = !DILocation(line: 662, column: 64, scope: !741)
!743 = !DILocation(line: 662, column: 55, scope: !741)
!744 = !DILocation(line: 662, column: 3, scope: !741)
!745 = distinct !{!745, !746}
!746 = !DILocation(line: 662, column: 3, scope: !717)
!747 = !DILocation(line: 668, column: 18, scope: !717)
!748 = !DILocation(line: 668, column: 3, scope: !717)
!749 = !DILocation(line: 669, column: 2, scope: !717)
!750 = !DILocation(line: 671, column: 6, scope: !751)
!751 = distinct !DILexicalBlock(scope: !480, file: !188, line: 671, column: 6)
!752 = !DILocation(line: 671, column: 11, scope: !751)
!753 = !DILocation(line: 671, column: 18, scope: !751)
!754 = !DILocation(line: 671, column: 6, scope: !480)
!755 = !DILocation(line: 672, column: 78, scope: !751)
!756 = !DILocation(line: 672, column: 69, scope: !751)
!757 = !DILocation(line: 672, column: 113, scope: !751)
!758 = !DILocation(line: 672, column: 97, scope: !759)
!759 = !DILexicalBlockFile(scope: !751, file: !188, discriminator: 1)
!760 = !DILocation(line: 672, column: 3, scope: !761)
!761 = !DILexicalBlockFile(scope: !751, file: !188, discriminator: 2)
!762 = !DILocation(line: 672, column: 3, scope: !751)
!763 = !DILocation(line: 675, column: 17, scope: !480)
!764 = !DILocation(line: 675, column: 2, scope: !480)
!765 = !DILocation(line: 677, column: 23, scope: !480)
!766 = !DILocation(line: 678, column: 52, scope: !480)
!767 = !DILocation(line: 678, column: 57, scope: !480)
!768 = !DILocation(line: 678, column: 23, scope: !480)
!769 = !DILocation(line: 679, column: 40, scope: !480)
!770 = !DILocation(line: 679, column: 45, scope: !480)
!771 = !DILocation(line: 679, column: 23, scope: !480)
!772 = !DILocation(line: 678, column: 23, scope: !525)
!773 = !DILocation(line: 678, column: 23, scope: !641)
!774 = !DILocation(line: 678, column: 23, scope: !643)
!775 = !DILocation(line: 677, column: 2, scope: !525)
!776 = !DILocation(line: 683, column: 19, scope: !480)
!777 = !DILocation(line: 683, column: 2, scope: !480)
!778 = !DILocation(line: 684, column: 2, scope: !480)
!779 = !DILocation(line: 684, column: 7, scope: !480)
!780 = !DILocation(line: 684, column: 21, scope: !480)
!781 = !DILocation(line: 685, column: 22, scope: !480)
!782 = !DILocation(line: 685, column: 2, scope: !480)
!783 = !DILocation(line: 686, column: 1, scope: !480)
!784 = !DILocation(line: 686, column: 1, scope: !525)
!785 = distinct !DISubprogram(name: "deferred_configure_conffile", scope: !188, file: !188, line: 375, type: !786, isLocal: true, isDefinition: true, scopeLine: 376, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !468)
!786 = !DISubroutineType(types: !787)
!787 = !{null, !245, !323}
!788 = !DILocalVariable(name: "pkg", arg: 1, scope: !785, file: !188, line: 375, type: !245)
!789 = !DILocation(line: 375, column: 45, scope: !785)
!790 = !DILocalVariable(name: "conff", arg: 2, scope: !785, file: !188, line: 375, type: !323)
!791 = !DILocation(line: 375, column: 67, scope: !785)
!792 = !DILocalVariable(name: "usenode", scope: !785, file: !188, line: 377, type: !392)
!793 = !DILocation(line: 377, column: 24, scope: !785)
!794 = !DILocalVariable(name: "currenthash", scope: !785, file: !188, line: 378, type: !795)
!795 = !DICompositeType(tag: DW_TAG_array_type, baseType: !256, size: 264, align: 8, elements: !796)
!796 = !{!797}
!797 = !DISubrange(count: 33)
!798 = !DILocation(line: 378, column: 7, scope: !785)
!799 = !DILocalVariable(name: "newdisthash", scope: !785, file: !188, line: 378, type: !795)
!800 = !DILocation(line: 378, column: 28, scope: !785)
!801 = !DILocalVariable(name: "useredited", scope: !785, file: !188, line: 379, type: !238)
!802 = !DILocation(line: 379, column: 6, scope: !785)
!803 = !DILocalVariable(name: "distedited", scope: !785, file: !188, line: 379, type: !238)
!804 = !DILocation(line: 379, column: 18, scope: !785)
!805 = !DILocalVariable(name: "what", scope: !785, file: !188, line: 380, type: !187)
!806 = !DILocation(line: 380, column: 16, scope: !785)
!807 = !DILocalVariable(name: "stab", scope: !785, file: !188, line: 381, type: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !809, line: 46, size: 1152, align: 64, elements: !810)
!809 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!810 = !{!811, !812, !813, !815, !816, !817, !818, !819, !820, !821, !823, !825, !833, !834, !835}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !808, file: !809, line: 48, baseType: !449, size: 64, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !808, file: !809, line: 53, baseType: !453, size: 64, align: 64, offset: 64)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !808, file: !809, line: 61, baseType: !814, size: 64, align: 64, offset: 128)
!814 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !415, line: 130, baseType: !450)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !808, file: !809, line: 62, baseType: !421, size: 32, align: 32, offset: 192)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !808, file: !809, line: 64, baseType: !414, size: 32, align: 32, offset: 224)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !808, file: !809, line: 65, baseType: !418, size: 32, align: 32, offset: 256)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !808, file: !809, line: 67, baseType: !238, size: 32, align: 32, offset: 288)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !808, file: !809, line: 69, baseType: !449, size: 64, align: 64, offset: 320)
!820 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !808, file: !809, line: 74, baseType: !456, size: 64, align: 64, offset: 384)
!821 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !808, file: !809, line: 78, baseType: !822, size: 64, align: 64, offset: 448)
!822 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !415, line: 153, baseType: !237)
!823 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !808, file: !809, line: 80, baseType: !824, size: 64, align: 64, offset: 512)
!824 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !415, line: 158, baseType: !237)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !808, file: !809, line: 91, baseType: !826, size: 128, align: 64, offset: 576)
!826 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !827, line: 120, size: 128, align: 64, elements: !828)
!827 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!828 = !{!829, !831}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !826, file: !827, line: 122, baseType: !830, size: 64, align: 64)
!830 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !415, line: 139, baseType: !237)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !826, file: !827, line: 123, baseType: !832, size: 64, align: 64, offset: 64)
!832 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !415, line: 175, baseType: !237)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !808, file: !809, line: 92, baseType: !826, size: 128, align: 64, offset: 704)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !808, file: !809, line: 93, baseType: !826, size: 128, align: 64, offset: 832)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !808, file: !809, line: 106, baseType: !836, size: 192, align: 64, offset: 960)
!836 = !DICompositeType(tag: DW_TAG_array_type, baseType: !832, size: 192, align: 64, elements: !837)
!837 = !{!838}
!838 = !DISubrange(count: 3)
!839 = !DILocation(line: 381, column: 14, scope: !785)
!840 = !DILocalVariable(name: "cdr", scope: !785, file: !188, line: 382, type: !460)
!841 = !DILocation(line: 382, column: 16, scope: !785)
!842 = !DILocalVariable(name: "cdr2", scope: !785, file: !188, line: 382, type: !460)
!843 = !DILocation(line: 382, column: 24, scope: !785)
!844 = !DILocation(line: 382, column: 24, scope: !845)
!845 = !DILexicalBlockFile(scope: !785, file: !188, discriminator: 1)
!846 = !DILocalVariable(name: "cdr2rest", scope: !785, file: !188, line: 383, type: !423)
!847 = !DILocation(line: 383, column: 8, scope: !785)
!848 = !DILocalVariable(name: "rc", scope: !785, file: !188, line: 384, type: !238)
!849 = !DILocation(line: 384, column: 6, scope: !785)
!850 = !DILocation(line: 386, column: 46, scope: !785)
!851 = !DILocation(line: 386, column: 53, scope: !785)
!852 = !DILocation(line: 386, column: 26, scope: !785)
!853 = !DILocation(line: 387, column: 33, scope: !785)
!854 = !DILocation(line: 387, column: 39, scope: !785)
!855 = !DILocation(line: 387, column: 44, scope: !785)
!856 = !DILocation(line: 386, column: 12, scope: !845)
!857 = !DILocation(line: 386, column: 10, scope: !785)
!858 = !DILocation(line: 389, column: 18, scope: !785)
!859 = !DILocation(line: 389, column: 29, scope: !785)
!860 = !DILocation(line: 389, column: 38, scope: !785)
!861 = !DILocation(line: 389, column: 7, scope: !785)
!862 = !DILocation(line: 389, column: 5, scope: !785)
!863 = !DILocation(line: 390, column: 6, scope: !864)
!864 = distinct !DILexicalBlock(scope: !785, file: !188, line: 390, column: 6)
!865 = !DILocation(line: 390, column: 9, scope: !864)
!866 = !DILocation(line: 390, column: 6, scope: !785)
!867 = !DILocation(line: 391, column: 3, scope: !868)
!868 = distinct !DILexicalBlock(scope: !864, file: !188, line: 390, column: 16)
!869 = !DILocation(line: 391, column: 10, scope: !868)
!870 = !DILocation(line: 391, column: 15, scope: !868)
!871 = !DILocation(line: 392, column: 3, scope: !868)
!872 = !DILocation(line: 394, column: 10, scope: !785)
!873 = !DILocation(line: 394, column: 15, scope: !785)
!874 = !DILocation(line: 394, column: 32, scope: !785)
!875 = !DILocation(line: 394, column: 2, scope: !785)
!876 = !DILocation(line: 396, column: 2, scope: !785)
!877 = !DILocation(line: 397, column: 28, scope: !785)
!878 = !DILocation(line: 397, column: 44, scope: !785)
!879 = !DILocation(line: 397, column: 33, scope: !785)
!880 = !DILocation(line: 397, column: 2, scope: !845)
!881 = !DILocation(line: 398, column: 2, scope: !785)
!882 = !DILocation(line: 400, column: 2, scope: !785)
!883 = !DILocation(line: 401, column: 18, scope: !785)
!884 = !DILocation(line: 401, column: 35, scope: !785)
!885 = !DILocation(line: 401, column: 24, scope: !785)
!886 = !DILocation(line: 401, column: 22, scope: !785)
!887 = !DILocation(line: 401, column: 11, scope: !785)
!888 = !DILocation(line: 404, column: 9, scope: !785)
!889 = !DILocation(line: 404, column: 2, scope: !785)
!890 = !DILocation(line: 406, column: 17, scope: !891)
!891 = distinct !DILexicalBlock(scope: !785, file: !188, line: 406, column: 6)
!892 = !DILocation(line: 406, column: 6, scope: !891)
!893 = !DILocation(line: 406, column: 6, scope: !785)
!894 = !DILocation(line: 407, column: 8, scope: !895)
!895 = distinct !DILexicalBlock(scope: !896, file: !188, line: 407, column: 6)
!896 = distinct !DILexicalBlock(scope: !891, file: !188, line: 406, column: 30)
!897 = !DILocation(line: 407, column: 7, scope: !895)
!898 = !DILocation(line: 407, column: 12, scope: !895)
!899 = !DILocation(line: 407, column: 6, scope: !896)
!900 = !DILocation(line: 410, column: 38, scope: !901)
!901 = distinct !DILexicalBlock(scope: !895, file: !188, line: 407, column: 23)
!902 = !DILocation(line: 410, column: 43, scope: !901)
!903 = !DILocation(line: 410, column: 4, scope: !901)
!904 = !DILocation(line: 411, column: 4, scope: !901)
!905 = !DILocation(line: 413, column: 11, scope: !896)
!906 = !DILocation(line: 414, column: 16, scope: !896)
!907 = !DILocation(line: 413, column: 3, scope: !908)
!908 = !DILexicalBlockFile(scope: !896, file: !188, discriminator: 1)
!909 = !DILocation(line: 413, column: 3, scope: !896)
!910 = !DILocation(line: 416, column: 10, scope: !785)
!911 = !DILocation(line: 416, column: 15, scope: !785)
!912 = !DILocation(line: 416, column: 33, scope: !785)
!913 = !DILocation(line: 416, column: 2, scope: !785)
!914 = !DILocation(line: 420, column: 16, scope: !915)
!915 = distinct !DILexicalBlock(scope: !785, file: !188, line: 420, column: 6)
!916 = !DILocation(line: 420, column: 7, scope: !915)
!917 = !DILocation(line: 420, column: 6, scope: !785)
!918 = !DILocation(line: 421, column: 23, scope: !915)
!919 = !DILocation(line: 421, column: 33, scope: !915)
!920 = !DILocation(line: 421, column: 3, scope: !915)
!921 = !DILocation(line: 422, column: 12, scope: !922)
!922 = distinct !DILexicalBlock(scope: !915, file: !188, line: 422, column: 10)
!923 = !DILocation(line: 422, column: 11, scope: !922)
!924 = !DILocation(line: 422, column: 16, scope: !922)
!925 = !DILocation(line: 422, column: 10, scope: !915)
!926 = !DILocation(line: 423, column: 11, scope: !922)
!927 = !DILocation(line: 424, column: 15, scope: !922)
!928 = !DILocation(line: 423, column: 3, scope: !929)
!929 = !DILexicalBlockFile(scope: !922, file: !188, discriminator: 1)
!930 = !DILocation(line: 423, column: 3, scope: !922)
!931 = !DILocation(line: 427, column: 13, scope: !932)
!932 = distinct !DILexicalBlock(scope: !785, file: !188, line: 427, column: 6)
!933 = !DILocation(line: 427, column: 26, scope: !932)
!934 = !DILocation(line: 427, column: 6, scope: !932)
!935 = !DILocation(line: 427, column: 39, scope: !932)
!936 = !DILocation(line: 427, column: 6, scope: !785)
!937 = !DILocation(line: 430, column: 14, scope: !938)
!938 = distinct !DILexicalBlock(scope: !932, file: !188, line: 427, column: 45)
!939 = !DILocation(line: 431, column: 14, scope: !938)
!940 = !DILocation(line: 432, column: 8, scope: !938)
!941 = !DILocation(line: 433, column: 2, scope: !938)
!942 = !DILocation(line: 433, column: 20, scope: !943)
!943 = !DILexicalBlockFile(scope: !944, file: !188, discriminator: 1)
!944 = distinct !DILexicalBlock(scope: !932, file: !188, line: 433, column: 13)
!945 = !DILocation(line: 433, column: 13, scope: !943)
!946 = !DILocation(line: 433, column: 48, scope: !943)
!947 = !DILocation(line: 433, column: 53, scope: !943)
!948 = !DILocation(line: 433, column: 56, scope: !949)
!949 = !DILexicalBlockFile(scope: !944, file: !188, discriminator: 2)
!950 = !DILocation(line: 433, column: 13, scope: !949)
!951 = !DILocation(line: 434, column: 10, scope: !952)
!952 = distinct !DILexicalBlock(scope: !944, file: !188, line: 433, column: 84)
!953 = !DILocation(line: 435, column: 11, scope: !952)
!954 = !DILocation(line: 438, column: 11, scope: !952)
!955 = !DILocation(line: 438, column: 20, scope: !952)
!956 = !DILocation(line: 434, column: 3, scope: !952)
!957 = !DILocation(line: 439, column: 8, scope: !952)
!958 = !DILocation(line: 440, column: 14, scope: !952)
!959 = !DILocation(line: 441, column: 14, scope: !952)
!960 = !DILocation(line: 442, column: 2, scope: !952)
!961 = !DILocation(line: 442, column: 20, scope: !962)
!962 = !DILexicalBlockFile(scope: !963, file: !188, discriminator: 1)
!963 = distinct !DILexicalBlock(scope: !944, file: !188, line: 442, column: 13)
!964 = !DILocation(line: 442, column: 27, scope: !962)
!965 = !DILocation(line: 442, column: 13, scope: !962)
!966 = !DILocation(line: 442, column: 48, scope: !962)
!967 = !DILocation(line: 443, column: 14, scope: !968)
!968 = distinct !DILexicalBlock(scope: !969, file: !188, line: 443, column: 7)
!969 = distinct !DILexicalBlock(scope: !963, file: !188, line: 442, column: 54)
!970 = !DILocation(line: 443, column: 7, scope: !968)
!971 = !DILocation(line: 443, column: 42, scope: !968)
!972 = !DILocation(line: 443, column: 7, scope: !969)
!973 = !DILocation(line: 444, column: 9, scope: !974)
!974 = distinct !DILexicalBlock(scope: !968, file: !188, line: 443, column: 48)
!975 = !DILocation(line: 445, column: 15, scope: !974)
!976 = !DILocation(line: 446, column: 15, scope: !974)
!977 = !DILocation(line: 447, column: 3, scope: !974)
!978 = !DILocation(line: 448, column: 15, scope: !979)
!979 = distinct !DILexicalBlock(scope: !968, file: !188, line: 447, column: 10)
!980 = !DILocation(line: 449, column: 15, scope: !979)
!981 = !DILocation(line: 450, column: 37, scope: !979)
!982 = !DILocation(line: 450, column: 11, scope: !979)
!983 = !DILocation(line: 450, column: 25, scope: !979)
!984 = !DILocation(line: 450, column: 49, scope: !979)
!985 = !DILocation(line: 450, column: 9, scope: !979)
!986 = !DILocation(line: 453, column: 2, scope: !969)
!987 = !DILocation(line: 454, column: 23, scope: !988)
!988 = distinct !DILexicalBlock(scope: !963, file: !188, line: 453, column: 9)
!989 = !DILocation(line: 454, column: 30, scope: !988)
!990 = !DILocation(line: 454, column: 36, scope: !988)
!991 = !DILocation(line: 454, column: 16, scope: !988)
!992 = !DILocation(line: 454, column: 49, scope: !988)
!993 = !DILocation(line: 454, column: 14, scope: !988)
!994 = !DILocation(line: 455, column: 23, scope: !988)
!995 = !DILocation(line: 455, column: 30, scope: !988)
!996 = !DILocation(line: 455, column: 36, scope: !988)
!997 = !DILocation(line: 455, column: 16, scope: !988)
!998 = !DILocation(line: 455, column: 49, scope: !988)
!999 = !DILocation(line: 455, column: 14, scope: !988)
!1000 = !DILocation(line: 457, column: 7, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !988, file: !188, line: 457, column: 7)
!1002 = !DILocation(line: 457, column: 33, scope: !1001)
!1003 = !DILocation(line: 457, column: 36, scope: !1004)
!1004 = !DILexicalBlockFile(scope: !1001, file: !188, discriminator: 1)
!1005 = !DILocation(line: 457, column: 7, scope: !1004)
!1006 = !DILocation(line: 458, column: 9, scope: !1001)
!1007 = !DILocation(line: 458, column: 4, scope: !1001)
!1008 = !DILocation(line: 460, column: 37, scope: !1001)
!1009 = !DILocation(line: 460, column: 11, scope: !1001)
!1010 = !DILocation(line: 460, column: 25, scope: !1001)
!1011 = !DILocation(line: 460, column: 9, scope: !1001)
!1012 = !DILocation(line: 462, column: 14, scope: !1013)
!1013 = distinct !DILexicalBlock(scope: !988, file: !188, line: 462, column: 7)
!1014 = !DILocation(line: 462, column: 7, scope: !1013)
!1015 = !DILocation(line: 462, column: 42, scope: !1013)
!1016 = !DILocation(line: 462, column: 7, scope: !988)
!1017 = !DILocation(line: 463, column: 9, scope: !1013)
!1018 = !DILocation(line: 463, column: 4, scope: !1013)
!1019 = !DILocation(line: 468, column: 8, scope: !785)
!1020 = !DILocation(line: 468, column: 17, scope: !785)
!1021 = !DILocation(line: 468, column: 27, scope: !785)
!1022 = !DILocation(line: 468, column: 32, scope: !785)
!1023 = !DILocation(line: 468, column: 44, scope: !785)
!1024 = !DILocation(line: 468, column: 56, scope: !785)
!1025 = !DILocation(line: 466, column: 2, scope: !785)
!1026 = !DILocation(line: 470, column: 26, scope: !785)
!1027 = !DILocation(line: 470, column: 31, scope: !785)
!1028 = !DILocation(line: 470, column: 40, scope: !785)
!1029 = !DILocation(line: 470, column: 50, scope: !785)
!1030 = !DILocation(line: 470, column: 60, scope: !785)
!1031 = !DILocation(line: 471, column: 26, scope: !785)
!1032 = !DILocation(line: 471, column: 38, scope: !785)
!1033 = !DILocation(line: 471, column: 50, scope: !785)
!1034 = !DILocation(line: 470, column: 9, scope: !785)
!1035 = !DILocation(line: 470, column: 7, scope: !785)
!1036 = !DILocation(line: 473, column: 10, scope: !785)
!1037 = !DILocation(line: 473, column: 15, scope: !785)
!1038 = !DILocation(line: 473, column: 2, scope: !785)
!1039 = !DILocation(line: 475, column: 10, scope: !1040)
!1040 = distinct !DILexicalBlock(scope: !785, file: !188, line: 473, column: 49)
!1041 = !DILocation(line: 475, column: 3, scope: !1040)
!1042 = !DILocation(line: 476, column: 19, scope: !1043)
!1043 = distinct !DILexicalBlock(scope: !1040, file: !188, line: 476, column: 7)
!1044 = !DILocation(line: 476, column: 7, scope: !1043)
!1045 = !DILocation(line: 476, column: 24, scope: !1043)
!1046 = !DILocation(line: 476, column: 28, scope: !1047)
!1047 = !DILexicalBlockFile(scope: !1043, file: !188, discriminator: 1)
!1048 = !DILocation(line: 476, column: 27, scope: !1047)
!1049 = !DILocation(line: 476, column: 32, scope: !1047)
!1050 = !DILocation(line: 476, column: 7, scope: !1047)
!1051 = !DILocation(line: 477, column: 12, scope: !1043)
!1052 = !DILocation(line: 478, column: 21, scope: !1043)
!1053 = !DILocation(line: 478, column: 12, scope: !1043)
!1054 = !DILocation(line: 478, column: 47, scope: !1043)
!1055 = !DILocation(line: 479, column: 22, scope: !1043)
!1056 = !DILocation(line: 479, column: 21, scope: !1043)
!1057 = !DILocation(line: 479, column: 12, scope: !1047)
!1058 = !DILocation(line: 477, column: 4, scope: !1047)
!1059 = !DILocation(line: 477, column: 4, scope: !1043)
!1060 = !DILocation(line: 481, column: 3, scope: !1040)
!1061 = !DILocation(line: 482, column: 3, scope: !1040)
!1062 = !DILocation(line: 483, column: 10, scope: !1040)
!1063 = !DILocation(line: 483, column: 3, scope: !1040)
!1064 = !DILocation(line: 484, column: 22, scope: !1040)
!1065 = !DILocation(line: 484, column: 31, scope: !1040)
!1066 = !DILocation(line: 484, column: 3, scope: !1040)
!1067 = !DILocation(line: 485, column: 19, scope: !1068)
!1068 = distinct !DILexicalBlock(scope: !1040, file: !188, line: 485, column: 7)
!1069 = !DILocation(line: 485, column: 28, scope: !1068)
!1070 = !DILocation(line: 485, column: 7, scope: !1068)
!1071 = !DILocation(line: 485, column: 7, scope: !1040)
!1072 = !DILocation(line: 486, column: 12, scope: !1068)
!1073 = !DILocation(line: 487, column: 21, scope: !1068)
!1074 = !DILocation(line: 487, column: 12, scope: !1068)
!1075 = !DILocation(line: 487, column: 47, scope: !1068)
!1076 = !DILocation(line: 487, column: 56, scope: !1068)
!1077 = !DILocation(line: 488, column: 22, scope: !1068)
!1078 = !DILocation(line: 488, column: 21, scope: !1068)
!1079 = !DILocation(line: 488, column: 12, scope: !1080)
!1080 = !DILexicalBlockFile(scope: !1068, file: !188, discriminator: 1)
!1081 = !DILocation(line: 486, column: 4, scope: !1080)
!1082 = !DILocation(line: 486, column: 4, scope: !1068)
!1083 = !DILocation(line: 489, column: 3, scope: !1040)
!1084 = !DILocation(line: 491, column: 10, scope: !1040)
!1085 = !DILocation(line: 491, column: 3, scope: !1040)
!1086 = !DILocation(line: 492, column: 19, scope: !1087)
!1087 = distinct !DILexicalBlock(scope: !1040, file: !188, line: 492, column: 7)
!1088 = !DILocation(line: 492, column: 7, scope: !1087)
!1089 = !DILocation(line: 492, column: 7, scope: !1040)
!1090 = !DILocation(line: 493, column: 12, scope: !1087)
!1091 = !DILocation(line: 494, column: 21, scope: !1087)
!1092 = !DILocation(line: 494, column: 12, scope: !1087)
!1093 = !DILocation(line: 494, column: 47, scope: !1087)
!1094 = !DILocation(line: 495, column: 22, scope: !1087)
!1095 = !DILocation(line: 495, column: 21, scope: !1087)
!1096 = !DILocation(line: 495, column: 12, scope: !1097)
!1097 = !DILexicalBlockFile(scope: !1087, file: !188, discriminator: 1)
!1098 = !DILocation(line: 493, column: 4, scope: !1097)
!1099 = !DILocation(line: 493, column: 4, scope: !1087)
!1100 = !DILocation(line: 496, column: 3, scope: !1040)
!1101 = !DILocation(line: 498, column: 10, scope: !1040)
!1102 = !DILocation(line: 498, column: 3, scope: !1040)
!1103 = !DILocation(line: 499, column: 19, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1040, file: !188, line: 499, column: 7)
!1105 = !DILocation(line: 499, column: 7, scope: !1104)
!1106 = !DILocation(line: 499, column: 24, scope: !1104)
!1107 = !DILocation(line: 499, column: 28, scope: !1108)
!1108 = !DILexicalBlockFile(scope: !1104, file: !188, discriminator: 1)
!1109 = !DILocation(line: 499, column: 27, scope: !1108)
!1110 = !DILocation(line: 499, column: 32, scope: !1108)
!1111 = !DILocation(line: 499, column: 7, scope: !1108)
!1112 = !DILocation(line: 500, column: 12, scope: !1104)
!1113 = !DILocation(line: 501, column: 21, scope: !1104)
!1114 = !DILocation(line: 501, column: 12, scope: !1104)
!1115 = !DILocation(line: 501, column: 47, scope: !1104)
!1116 = !DILocation(line: 502, column: 22, scope: !1104)
!1117 = !DILocation(line: 502, column: 21, scope: !1104)
!1118 = !DILocation(line: 502, column: 12, scope: !1108)
!1119 = !DILocation(line: 500, column: 4, scope: !1108)
!1120 = !DILocation(line: 500, column: 4, scope: !1104)
!1121 = !DILocation(line: 503, column: 10, scope: !1040)
!1122 = !DILocation(line: 503, column: 3, scope: !1040)
!1123 = !DILocation(line: 504, column: 19, scope: !1124)
!1124 = distinct !DILexicalBlock(scope: !1040, file: !188, line: 504, column: 7)
!1125 = !DILocation(line: 504, column: 7, scope: !1124)
!1126 = !DILocation(line: 504, column: 24, scope: !1124)
!1127 = !DILocation(line: 504, column: 28, scope: !1128)
!1128 = !DILexicalBlockFile(scope: !1124, file: !188, discriminator: 1)
!1129 = !DILocation(line: 504, column: 27, scope: !1128)
!1130 = !DILocation(line: 504, column: 32, scope: !1128)
!1131 = !DILocation(line: 504, column: 7, scope: !1128)
!1132 = !DILocation(line: 505, column: 12, scope: !1124)
!1133 = !DILocation(line: 506, column: 21, scope: !1124)
!1134 = !DILocation(line: 506, column: 12, scope: !1124)
!1135 = !DILocation(line: 506, column: 47, scope: !1124)
!1136 = !DILocation(line: 507, column: 22, scope: !1124)
!1137 = !DILocation(line: 507, column: 21, scope: !1124)
!1138 = !DILocation(line: 507, column: 12, scope: !1128)
!1139 = !DILocation(line: 505, column: 4, scope: !1128)
!1140 = !DILocation(line: 505, column: 4, scope: !1124)
!1141 = !DILocation(line: 508, column: 9, scope: !1142)
!1142 = distinct !DILexicalBlock(scope: !1040, file: !188, line: 508, column: 7)
!1143 = !DILocation(line: 508, column: 14, scope: !1142)
!1144 = !DILocation(line: 508, column: 7, scope: !1040)
!1145 = !DILocation(line: 509, column: 17, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !1142, file: !188, line: 509, column: 8)
!1147 = !DILocation(line: 509, column: 27, scope: !1146)
!1148 = !DILocation(line: 509, column: 8, scope: !1146)
!1149 = !DILocation(line: 509, column: 8, scope: !1142)
!1150 = !DILocation(line: 510, column: 13, scope: !1146)
!1151 = !DILocation(line: 511, column: 22, scope: !1146)
!1152 = !DILocation(line: 511, column: 13, scope: !1146)
!1153 = !DILocation(line: 511, column: 47, scope: !1146)
!1154 = !DILocation(line: 512, column: 18, scope: !1146)
!1155 = !DILocation(line: 512, column: 33, scope: !1146)
!1156 = !DILocation(line: 512, column: 32, scope: !1146)
!1157 = !DILocation(line: 512, column: 23, scope: !1158)
!1158 = !DILexicalBlockFile(scope: !1146, file: !188, discriminator: 1)
!1159 = !DILocation(line: 510, column: 5, scope: !1158)
!1160 = !DILocation(line: 510, column: 5, scope: !1146)
!1161 = !DILocation(line: 509, column: 30, scope: !1158)
!1162 = !DILocation(line: 508, column: 29, scope: !1163)
!1163 = !DILexicalBlockFile(scope: !1142, file: !188, discriminator: 1)
!1164 = !DILocation(line: 515, column: 10, scope: !1040)
!1165 = !DILocation(line: 516, column: 10, scope: !1040)
!1166 = !DILocation(line: 516, column: 19, scope: !1040)
!1167 = !DILocation(line: 515, column: 3, scope: !1168)
!1168 = !DILexicalBlockFile(scope: !1040, file: !188, discriminator: 1)
!1169 = !DILocation(line: 515, column: 3, scope: !1040)
!1170 = !DILocation(line: 519, column: 10, scope: !1040)
!1171 = !DILocation(line: 519, column: 3, scope: !1040)
!1172 = !DILocation(line: 520, column: 22, scope: !1040)
!1173 = !DILocation(line: 520, column: 31, scope: !1040)
!1174 = !DILocation(line: 520, column: 3, scope: !1040)
!1175 = !DILocation(line: 521, column: 19, scope: !1176)
!1176 = distinct !DILexicalBlock(scope: !1040, file: !188, line: 521, column: 7)
!1177 = !DILocation(line: 521, column: 28, scope: !1176)
!1178 = !DILocation(line: 521, column: 7, scope: !1176)
!1179 = !DILocation(line: 521, column: 7, scope: !1040)
!1180 = !DILocation(line: 522, column: 12, scope: !1176)
!1181 = !DILocation(line: 523, column: 17, scope: !1176)
!1182 = !DILocation(line: 523, column: 26, scope: !1176)
!1183 = !DILocation(line: 522, column: 4, scope: !1184)
!1184 = !DILexicalBlockFile(scope: !1176, file: !188, discriminator: 1)
!1185 = !DILocation(line: 522, column: 4, scope: !1176)
!1186 = !DILocation(line: 524, column: 3, scope: !1040)
!1187 = !DILocation(line: 526, column: 71, scope: !1040)
!1188 = !DILocation(line: 526, column: 3, scope: !1040)
!1189 = !DILocation(line: 529, column: 26, scope: !785)
!1190 = !DILocation(line: 529, column: 16, scope: !785)
!1191 = !DILocation(line: 529, column: 2, scope: !785)
!1192 = !DILocation(line: 529, column: 9, scope: !785)
!1193 = !DILocation(line: 529, column: 14, scope: !785)
!1194 = !DILocation(line: 530, column: 17, scope: !785)
!1195 = !DILocation(line: 530, column: 2, scope: !785)
!1196 = !DILocation(line: 532, column: 2, scope: !785)
!1197 = !DILocation(line: 533, column: 2, scope: !785)
!1198 = !DILocation(line: 534, column: 1, scope: !785)
!1199 = !DILocation(line: 534, column: 1, scope: !845)
!1200 = !DILocalVariable(name: "pkg", arg: 1, scope: !242, file: !188, line: 700, type: !245)
!1201 = !DILocation(line: 700, column: 28, scope: !242)
!1202 = !DILocalVariable(name: "result", arg: 2, scope: !242, file: !188, line: 700, type: !459)
!1203 = !DILocation(line: 700, column: 48, scope: !242)
!1204 = !DILocalVariable(name: "in", arg: 3, scope: !242, file: !188, line: 700, type: !254)
!1205 = !DILocation(line: 700, column: 68, scope: !242)
!1206 = !DILocalVariable(name: "stab", scope: !242, file: !188, line: 703, type: !808)
!1207 = !DILocation(line: 703, column: 14, scope: !242)
!1208 = !DILocalVariable(name: "r", scope: !242, file: !188, line: 704, type: !1209)
!1209 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !413, line: 109, baseType: !1210)
!1210 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !415, line: 172, baseType: !237)
!1211 = !DILocation(line: 704, column: 10, scope: !242)
!1212 = !DILocalVariable(name: "loopprotect", scope: !242, file: !188, line: 705, type: !238)
!1213 = !DILocation(line: 705, column: 6, scope: !242)
!1214 = !DILocation(line: 707, column: 15, scope: !242)
!1215 = !DILocation(line: 707, column: 2, scope: !242)
!1216 = !DILocation(line: 708, column: 17, scope: !242)
!1217 = !DILocation(line: 708, column: 25, scope: !242)
!1218 = !DILocation(line: 708, column: 41, scope: !242)
!1219 = !DILocation(line: 708, column: 34, scope: !242)
!1220 = !DILocation(line: 708, column: 2, scope: !1221)
!1221 = !DILexicalBlockFile(scope: !242, file: !188, discriminator: 1)
!1222 = !DILocation(line: 709, column: 17, scope: !242)
!1223 = !DILocation(line: 709, column: 25, scope: !242)
!1224 = !DILocation(line: 709, column: 36, scope: !242)
!1225 = !DILocation(line: 709, column: 29, scope: !242)
!1226 = !DILocation(line: 709, column: 2, scope: !1221)
!1227 = !DILocation(line: 710, column: 17, scope: !242)
!1228 = !DILocation(line: 710, column: 2, scope: !242)
!1229 = !DILocation(line: 712, column: 14, scope: !242)
!1230 = !DILocation(line: 714, column: 2, scope: !242)
!1231 = !DILocation(line: 716, column: 9, scope: !1232)
!1232 = distinct !DILexicalBlock(scope: !1233, file: !188, line: 714, column: 11)
!1233 = distinct !DILexicalBlock(scope: !1234, file: !188, line: 714, column: 2)
!1234 = distinct !DILexicalBlock(scope: !242, file: !188, line: 714, column: 2)
!1235 = !DILocation(line: 716, column: 13, scope: !1232)
!1236 = !DILocation(line: 716, column: 21, scope: !1232)
!1237 = !DILocation(line: 715, column: 3, scope: !1232)
!1238 = !DILocation(line: 717, column: 13, scope: !1239)
!1239 = distinct !DILexicalBlock(scope: !1232, file: !188, line: 717, column: 7)
!1240 = !DILocation(line: 717, column: 21, scope: !1239)
!1241 = !DILocation(line: 717, column: 7, scope: !1239)
!1242 = !DILocation(line: 717, column: 7, scope: !1232)
!1243 = !DILocation(line: 718, column: 9, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !1245, file: !188, line: 718, column: 7)
!1245 = distinct !DILexicalBlock(scope: !1239, file: !188, line: 717, column: 34)
!1246 = !DILocation(line: 718, column: 8, scope: !1244)
!1247 = !DILocation(line: 718, column: 13, scope: !1244)
!1248 = !DILocation(line: 718, column: 7, scope: !1245)
!1249 = !DILocation(line: 719, column: 13, scope: !1244)
!1250 = !DILocation(line: 721, column: 22, scope: !1244)
!1251 = !DILocation(line: 721, column: 13, scope: !1244)
!1252 = !DILocation(line: 721, column: 43, scope: !1244)
!1253 = !DILocation(line: 722, column: 13, scope: !1244)
!1254 = !DILocation(line: 722, column: 21, scope: !1244)
!1255 = !DILocation(line: 722, column: 36, scope: !1244)
!1256 = !DILocation(line: 722, column: 35, scope: !1244)
!1257 = !DILocation(line: 722, column: 26, scope: !1258)
!1258 = !DILexicalBlockFile(scope: !1244, file: !188, discriminator: 1)
!1259 = !DILocation(line: 719, column: 5, scope: !1258)
!1260 = !DILocation(line: 719, column: 5, scope: !1244)
!1261 = !DILocation(line: 723, column: 4, scope: !1245)
!1262 = !DILocation(line: 724, column: 4, scope: !1245)
!1263 = !DILocation(line: 725, column: 18, scope: !1264)
!1264 = distinct !DILexicalBlock(scope: !1239, file: !188, line: 725, column: 13)
!1265 = !DILocation(line: 725, column: 16, scope: !1264)
!1266 = !DILocation(line: 725, column: 27, scope: !1264)
!1267 = !DILocation(line: 725, column: 13, scope: !1239)
!1268 = !DILocation(line: 727, column: 10, scope: !1269)
!1269 = distinct !DILexicalBlock(scope: !1264, file: !188, line: 725, column: 36)
!1270 = !DILocation(line: 727, column: 14, scope: !1269)
!1271 = !DILocation(line: 727, column: 22, scope: !1269)
!1272 = !DILocation(line: 726, column: 4, scope: !1269)
!1273 = !DILocation(line: 728, column: 4, scope: !1269)
!1274 = !DILocation(line: 729, column: 18, scope: !1275)
!1275 = distinct !DILexicalBlock(scope: !1264, file: !188, line: 729, column: 13)
!1276 = !DILocation(line: 729, column: 16, scope: !1275)
!1277 = !DILocation(line: 729, column: 27, scope: !1275)
!1278 = !DILocation(line: 729, column: 13, scope: !1264)
!1279 = !DILocation(line: 731, column: 10, scope: !1280)
!1280 = distinct !DILexicalBlock(scope: !1275, file: !188, line: 729, column: 36)
!1281 = !DILocation(line: 730, column: 4, scope: !1280)
!1282 = !DILocation(line: 732, column: 19, scope: !1283)
!1283 = distinct !DILexicalBlock(scope: !1280, file: !188, line: 732, column: 8)
!1284 = !DILocation(line: 732, column: 22, scope: !1283)
!1285 = !DILocation(line: 732, column: 8, scope: !1280)
!1286 = !DILocation(line: 733, column: 13, scope: !1287)
!1287 = distinct !DILexicalBlock(scope: !1283, file: !188, line: 732, column: 29)
!1288 = !DILocation(line: 735, column: 22, scope: !1287)
!1289 = !DILocation(line: 735, column: 13, scope: !1287)
!1290 = !DILocation(line: 735, column: 43, scope: !1287)
!1291 = !DILocation(line: 736, column: 13, scope: !1287)
!1292 = !DILocation(line: 736, column: 21, scope: !1287)
!1293 = !DILocation(line: 733, column: 5, scope: !1294)
!1294 = !DILexicalBlockFile(scope: !1287, file: !188, discriminator: 1)
!1295 = !DILocation(line: 737, column: 5, scope: !1287)
!1296 = !DILocation(line: 740, column: 4, scope: !1280)
!1297 = !DILocation(line: 741, column: 30, scope: !1280)
!1298 = !DILocation(line: 741, column: 38, scope: !1280)
!1299 = !DILocation(line: 741, column: 4, scope: !1280)
!1300 = !DILocation(line: 742, column: 17, scope: !1280)
!1301 = !DILocation(line: 742, column: 25, scope: !1280)
!1302 = !DILocation(line: 742, column: 37, scope: !1280)
!1303 = !DILocation(line: 742, column: 49, scope: !1280)
!1304 = !DILocation(line: 742, column: 8, scope: !1280)
!1305 = !DILocation(line: 742, column: 6, scope: !1280)
!1306 = !DILocation(line: 743, column: 8, scope: !1307)
!1307 = distinct !DILexicalBlock(scope: !1280, file: !188, line: 743, column: 8)
!1308 = !DILocation(line: 743, column: 10, scope: !1307)
!1309 = !DILocation(line: 743, column: 8, scope: !1280)
!1310 = !DILocation(line: 744, column: 13, scope: !1311)
!1311 = distinct !DILexicalBlock(scope: !1307, file: !188, line: 743, column: 15)
!1312 = !DILocation(line: 746, column: 22, scope: !1311)
!1313 = !DILocation(line: 746, column: 13, scope: !1311)
!1314 = !DILocation(line: 746, column: 43, scope: !1311)
!1315 = !DILocation(line: 747, column: 13, scope: !1311)
!1316 = !DILocation(line: 747, column: 21, scope: !1311)
!1317 = !DILocation(line: 747, column: 36, scope: !1311)
!1318 = !DILocation(line: 747, column: 35, scope: !1311)
!1319 = !DILocation(line: 747, column: 26, scope: !1320)
!1320 = !DILexicalBlockFile(scope: !1311, file: !188, discriminator: 1)
!1321 = !DILocation(line: 744, column: 5, scope: !1320)
!1322 = !DILocation(line: 748, column: 5, scope: !1311)
!1323 = !DILocation(line: 749, column: 15, scope: !1324)
!1324 = distinct !DILexicalBlock(scope: !1307, file: !188, line: 749, column: 15)
!1325 = !DILocation(line: 749, column: 25, scope: !1324)
!1326 = !DILocation(line: 749, column: 17, scope: !1324)
!1327 = !DILocation(line: 749, column: 15, scope: !1307)
!1328 = !DILocation(line: 750, column: 13, scope: !1329)
!1329 = distinct !DILexicalBlock(scope: !1324, file: !188, line: 749, column: 34)
!1330 = !DILocation(line: 752, column: 13, scope: !1329)
!1331 = !DILocation(line: 752, column: 21, scope: !1329)
!1332 = !DILocation(line: 752, column: 41, scope: !1329)
!1333 = !DILocation(line: 752, column: 50, scope: !1329)
!1334 = !DILocation(line: 750, column: 5, scope: !1335)
!1335 = !DILexicalBlockFile(scope: !1329, file: !188, discriminator: 1)
!1336 = !DILocation(line: 755, column: 9, scope: !1337)
!1337 = distinct !DILexicalBlock(scope: !1329, file: !188, line: 755, column: 9)
!1338 = !DILocation(line: 755, column: 18, scope: !1337)
!1339 = !DILocation(line: 755, column: 11, scope: !1337)
!1340 = !DILocation(line: 755, column: 9, scope: !1329)
!1341 = !DILocation(line: 756, column: 6, scope: !1337)
!1342 = !DILocation(line: 757, column: 4, scope: !1329)
!1343 = !DILocation(line: 758, column: 26, scope: !1280)
!1344 = !DILocation(line: 758, column: 4, scope: !1280)
!1345 = !DILocation(line: 759, column: 4, scope: !1280)
!1346 = !DILocation(line: 763, column: 10, scope: !1280)
!1347 = !DILocation(line: 763, column: 20, scope: !1280)
!1348 = !DILocation(line: 761, column: 4, scope: !1280)
!1349 = !DILocation(line: 765, column: 15, scope: !1350)
!1350 = distinct !DILexicalBlock(scope: !1280, file: !188, line: 765, column: 8)
!1351 = !DILocation(line: 765, column: 8, scope: !1350)
!1352 = !DILocation(line: 765, column: 22, scope: !1350)
!1353 = !DILocation(line: 765, column: 8, scope: !1280)
!1354 = !DILocation(line: 766, column: 18, scope: !1355)
!1355 = distinct !DILexicalBlock(scope: !1350, file: !188, line: 765, column: 30)
!1356 = !DILocation(line: 766, column: 5, scope: !1355)
!1357 = !DILocation(line: 767, column: 20, scope: !1355)
!1358 = !DILocation(line: 767, column: 28, scope: !1355)
!1359 = !DILocation(line: 767, column: 44, scope: !1355)
!1360 = !DILocation(line: 767, column: 37, scope: !1355)
!1361 = !DILocation(line: 767, column: 5, scope: !1362)
!1362 = !DILexicalBlockFile(scope: !1355, file: !188, discriminator: 1)
!1363 = !DILocation(line: 768, column: 5, scope: !1355)
!1364 = !DILocation(line: 770, column: 4, scope: !1355)
!1365 = !DILocation(line: 771, column: 14, scope: !1366)
!1366 = distinct !DILexicalBlock(scope: !1367, file: !188, line: 771, column: 5)
!1367 = distinct !DILexicalBlock(scope: !1350, file: !188, line: 770, column: 11)
!1368 = !DILocation(line: 771, column: 22, scope: !1366)
!1369 = !DILocation(line: 771, column: 27, scope: !1366)
!1370 = !DILocation(line: 771, column: 12, scope: !1366)
!1371 = !DILocation(line: 771, column: 10, scope: !1366)
!1372 = !DILocation(line: 771, column: 32, scope: !1373)
!1373 = !DILexicalBlockFile(scope: !1374, file: !188, discriminator: 1)
!1374 = distinct !DILexicalBlock(scope: !1366, file: !188, line: 771, column: 5)
!1375 = !DILocation(line: 771, column: 34, scope: !1373)
!1376 = !DILocation(line: 771, column: 38, scope: !1373)
!1377 = !DILocation(line: 771, column: 53, scope: !1378)
!1378 = !DILexicalBlockFile(scope: !1374, file: !188, discriminator: 2)
!1379 = !DILocation(line: 771, column: 41, scope: !1378)
!1380 = !DILocation(line: 771, column: 49, scope: !1378)
!1381 = !DILocation(line: 771, column: 56, scope: !1378)
!1382 = !DILocation(line: 771, column: 5, scope: !1383)
!1383 = !DILexicalBlockFile(scope: !1366, file: !188, discriminator: 3)
!1384 = !DILocation(line: 771, column: 5, scope: !1385)
!1385 = !DILexicalBlockFile(scope: !1366, file: !188, discriminator: 4)
!1386 = !DILocation(line: 771, column: 65, scope: !1387)
!1387 = !DILexicalBlockFile(scope: !1374, file: !188, discriminator: 5)
!1388 = !DILocation(line: 771, column: 5, scope: !1387)
!1389 = distinct !{!1389, !1390}
!1390 = !DILocation(line: 771, column: 5, scope: !1367)
!1391 = !DILocation(line: 773, column: 9, scope: !1392)
!1392 = distinct !DILexicalBlock(scope: !1367, file: !188, line: 773, column: 9)
!1393 = !DILocation(line: 773, column: 11, scope: !1392)
!1394 = !DILocation(line: 773, column: 9, scope: !1367)
!1395 = !DILocation(line: 774, column: 14, scope: !1396)
!1396 = distinct !DILexicalBlock(scope: !1392, file: !188, line: 773, column: 16)
!1397 = !DILocation(line: 776, column: 23, scope: !1396)
!1398 = !DILocation(line: 776, column: 14, scope: !1396)
!1399 = !DILocation(line: 777, column: 14, scope: !1396)
!1400 = !DILocation(line: 777, column: 18, scope: !1396)
!1401 = !DILocation(line: 777, column: 26, scope: !1396)
!1402 = !DILocation(line: 777, column: 38, scope: !1396)
!1403 = !DILocation(line: 774, column: 6, scope: !1404)
!1404 = !DILexicalBlockFile(scope: !1396, file: !188, discriminator: 1)
!1405 = !DILocation(line: 778, column: 6, scope: !1396)
!1406 = !DILocation(line: 780, column: 21, scope: !1407)
!1407 = distinct !DILexicalBlock(scope: !1367, file: !188, line: 780, column: 9)
!1408 = !DILocation(line: 780, column: 9, scope: !1407)
!1409 = !DILocation(line: 780, column: 17, scope: !1407)
!1410 = !DILocation(line: 780, column: 24, scope: !1407)
!1411 = !DILocation(line: 780, column: 9, scope: !1367)
!1412 = !DILocation(line: 781, column: 7, scope: !1407)
!1413 = !DILocation(line: 781, column: 6, scope: !1407)
!1414 = !DILocation(line: 782, column: 18, scope: !1367)
!1415 = !DILocation(line: 782, column: 26, scope: !1367)
!1416 = !DILocation(line: 782, column: 5, scope: !1367)
!1417 = !DILocation(line: 785, column: 16, scope: !1367)
!1418 = !DILocation(line: 785, column: 24, scope: !1367)
!1419 = !DILocation(line: 785, column: 11, scope: !1367)
!1420 = !DILocation(line: 785, column: 30, scope: !1367)
!1421 = !DILocation(line: 785, column: 38, scope: !1367)
!1422 = !DILocation(line: 783, column: 5, scope: !1367)
!1423 = !DILocation(line: 787, column: 19, scope: !1280)
!1424 = !DILocation(line: 787, column: 34, scope: !1280)
!1425 = !DILocation(line: 787, column: 46, scope: !1280)
!1426 = !DILocation(line: 787, column: 4, scope: !1280)
!1427 = !DILocation(line: 788, column: 19, scope: !1280)
!1428 = !DILocation(line: 788, column: 4, scope: !1280)
!1429 = !DILocation(line: 789, column: 3, scope: !1280)
!1430 = !DILocation(line: 790, column: 12, scope: !1431)
!1431 = distinct !DILexicalBlock(scope: !1275, file: !188, line: 789, column: 10)
!1432 = !DILocation(line: 791, column: 21, scope: !1431)
!1433 = !DILocation(line: 791, column: 12, scope: !1431)
!1434 = !DILocation(line: 791, column: 42, scope: !1431)
!1435 = !DILocation(line: 791, column: 46, scope: !1431)
!1436 = !DILocation(line: 791, column: 54, scope: !1431)
!1437 = !DILocation(line: 790, column: 4, scope: !1438)
!1438 = !DILexicalBlockFile(scope: !1431, file: !188, discriminator: 1)
!1439 = !DILocation(line: 792, column: 4, scope: !1431)
!1440 = !DILocation(line: 714, column: 2, scope: !1441)
!1441 = !DILexicalBlockFile(scope: !1233, file: !188, discriminator: 1)
!1442 = distinct !{!1442, !1230}
!1443 = !DILocation(line: 795, column: 1, scope: !242)
!1444 = !DILocalVariable(name: "pkg", arg: 1, scope: !470, file: !188, line: 808, type: !245)
!1445 = !DILocation(line: 808, column: 25, scope: !470)
!1446 = !DILocalVariable(name: "hashbuf", arg: 2, scope: !470, file: !188, line: 808, type: !423)
!1447 = !DILocation(line: 808, column: 36, scope: !470)
!1448 = !DILocalVariable(name: "fn", arg: 3, scope: !470, file: !188, line: 808, type: !254)
!1449 = !DILocation(line: 808, column: 57, scope: !470)
!1450 = !DILocalVariable(name: "err", scope: !470, file: !188, line: 810, type: !1451)
!1451 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dpkg_error", file: !176, line: 42, size: 128, align: 64, elements: !1452)
!1452 = !{!1453, !1454, !1455}
!1453 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !1451, file: !176, line: 43, baseType: !175, size: 32, align: 32)
!1454 = !DIDerivedType(tag: DW_TAG_member, name: "syserrno", scope: !1451, file: !176, line: 45, baseType: !238, size: 32, align: 32, offset: 32)
!1455 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !1451, file: !176, line: 46, baseType: !423, size: 64, align: 64, offset: 64)
!1456 = !DILocation(line: 810, column: 20, scope: !470)
!1457 = !DILocation(line: 813, column: 12, scope: !470)
!1458 = !DILocation(line: 813, column: 7, scope: !470)
!1459 = !DILocation(line: 813, column: 5, scope: !470)
!1460 = !DILocation(line: 815, column: 6, scope: !1461)
!1461 = distinct !DILexicalBlock(scope: !470, file: !188, line: 815, column: 6)
!1462 = !DILocation(line: 815, column: 9, scope: !1461)
!1463 = !DILocation(line: 815, column: 6, scope: !470)
!1464 = !DILocation(line: 816, column: 3, scope: !1465)
!1465 = distinct !DILexicalBlock(scope: !1461, file: !188, line: 815, column: 15)
!1466 = !DILocation(line: 817, column: 26, scope: !1467)
!1467 = distinct !DILexicalBlock(scope: !1465, file: !188, line: 817, column: 7)
!1468 = !DILocation(line: 817, column: 33, scope: !1467)
!1469 = !DILocation(line: 817, column: 7, scope: !1467)
!1470 = !DILocation(line: 817, column: 21, scope: !1467)
!1471 = !DILocation(line: 817, column: 7, scope: !1465)
!1472 = !DILocation(line: 818, column: 11, scope: !1467)
!1473 = !DILocation(line: 819, column: 11, scope: !1467)
!1474 = !DILocation(line: 819, column: 19, scope: !1467)
!1475 = !DILocation(line: 818, column: 4, scope: !1476)
!1476 = !DILexicalBlockFile(scope: !1467, file: !188, discriminator: 1)
!1477 = !DILocation(line: 818, column: 4, scope: !1467)
!1478 = !DILocation(line: 820, column: 3, scope: !1465)
!1479 = !DILocation(line: 821, column: 9, scope: !1465)
!1480 = !DILocation(line: 821, column: 3, scope: !1465)
!1481 = !DILocation(line: 822, column: 2, scope: !1465)
!1482 = !DILocation(line: 822, column: 14, scope: !1483)
!1483 = !DILexicalBlockFile(scope: !1484, file: !188, discriminator: 1)
!1484 = distinct !DILexicalBlock(scope: !1461, file: !188, line: 822, column: 12)
!1485 = !DILocation(line: 822, column: 13, scope: !1483)
!1486 = !DILocation(line: 822, column: 18, scope: !1483)
!1487 = !DILocation(line: 822, column: 12, scope: !1483)
!1488 = !DILocation(line: 823, column: 10, scope: !1489)
!1489 = distinct !DILexicalBlock(scope: !1484, file: !188, line: 822, column: 29)
!1490 = !DILocation(line: 823, column: 3, scope: !1489)
!1491 = !DILocation(line: 824, column: 2, scope: !1489)
!1492 = !DILocation(line: 825, column: 11, scope: !1493)
!1493 = distinct !DILexicalBlock(scope: !1484, file: !188, line: 824, column: 9)
!1494 = !DILocation(line: 826, column: 20, scope: !1493)
!1495 = !DILocation(line: 826, column: 11, scope: !1493)
!1496 = !DILocation(line: 826, column: 41, scope: !1493)
!1497 = !DILocation(line: 826, column: 55, scope: !1498)
!1498 = !DILexicalBlockFile(scope: !1493, file: !188, discriminator: 1)
!1499 = !DILocation(line: 826, column: 54, scope: !1493)
!1500 = !DILocation(line: 826, column: 45, scope: !1501)
!1501 = !DILexicalBlockFile(scope: !1493, file: !188, discriminator: 2)
!1502 = !DILocation(line: 825, column: 3, scope: !1498)
!1503 = !DILocation(line: 827, column: 10, scope: !1493)
!1504 = !DILocation(line: 827, column: 3, scope: !1493)
!1505 = !DILocation(line: 829, column: 1, scope: !470)
!1506 = distinct !DISubprogram(name: "deferred_configure_ghost_conffile", scope: !188, file: !188, line: 346, type: !786, isLocal: true, isDefinition: true, scopeLine: 347, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !468)
!1507 = !DILocalVariable(name: "pkg", arg: 1, scope: !1506, file: !188, line: 346, type: !245)
!1508 = !DILocation(line: 346, column: 51, scope: !1506)
!1509 = !DILocalVariable(name: "conff", arg: 2, scope: !1506, file: !188, line: 346, type: !323)
!1510 = !DILocation(line: 346, column: 73, scope: !1506)
!1511 = !DILocalVariable(name: "otherpkg", scope: !1506, file: !188, line: 348, type: !245)
!1512 = !DILocation(line: 348, column: 18, scope: !1506)
!1513 = !DILocalVariable(name: "otherconff", scope: !1506, file: !188, line: 349, type: !323)
!1514 = !DILocation(line: 349, column: 19, scope: !1506)
!1515 = !DILocation(line: 351, column: 19, scope: !1516)
!1516 = distinct !DILexicalBlock(scope: !1506, file: !188, line: 351, column: 2)
!1517 = !DILocation(line: 351, column: 24, scope: !1516)
!1518 = !DILocation(line: 351, column: 29, scope: !1516)
!1519 = !DILocation(line: 351, column: 16, scope: !1516)
!1520 = !DILocation(line: 351, column: 7, scope: !1516)
!1521 = !DILocation(line: 351, column: 34, scope: !1522)
!1522 = !DILexicalBlockFile(scope: !1523, file: !188, discriminator: 1)
!1523 = distinct !DILexicalBlock(scope: !1516, file: !188, line: 351, column: 2)
!1524 = !DILocation(line: 351, column: 2, scope: !1522)
!1525 = !DILocation(line: 352, column: 7, scope: !1526)
!1526 = distinct !DILexicalBlock(scope: !1527, file: !188, line: 352, column: 7)
!1527 = distinct !DILexicalBlock(scope: !1523, file: !188, line: 351, column: 76)
!1528 = !DILocation(line: 352, column: 19, scope: !1526)
!1529 = !DILocation(line: 352, column: 16, scope: !1526)
!1530 = !DILocation(line: 352, column: 7, scope: !1527)
!1531 = !DILocation(line: 353, column: 4, scope: !1526)
!1532 = !DILocation(line: 354, column: 7, scope: !1533)
!1533 = distinct !DILexicalBlock(scope: !1527, file: !188, line: 354, column: 7)
!1534 = !DILocation(line: 354, column: 17, scope: !1533)
!1535 = !DILocation(line: 354, column: 24, scope: !1533)
!1536 = !DILocation(line: 354, column: 7, scope: !1527)
!1537 = !DILocation(line: 355, column: 4, scope: !1533)
!1538 = !DILocation(line: 357, column: 21, scope: !1539)
!1539 = distinct !DILexicalBlock(scope: !1527, file: !188, line: 357, column: 3)
!1540 = !DILocation(line: 357, column: 31, scope: !1539)
!1541 = !DILocation(line: 357, column: 41, scope: !1539)
!1542 = !DILocation(line: 357, column: 19, scope: !1539)
!1543 = !DILocation(line: 357, column: 8, scope: !1539)
!1544 = !DILocation(line: 357, column: 52, scope: !1545)
