; ModuleID = './[inter]src--filters.o.i'
source_filename = "./[inter]src--filters.o.i"
target datalayout = "e-m:e-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.filter_node = type { %struct.filter_node*, i8*, i8 }
%struct.tar_entry = type { i32, i32, i8*, i8*, i64, i64, i64, %struct.file_stat }
%struct.file_stat = type { i32, i32, i32, i8*, i8* }

@.str = private unnamed_addr constant [26 x i8] c"adding %s filter for '%s'\00", align 1
@.str.1 = private unnamed_addr constant [8 x i8] c"include\00", align 1
@.str.2 = private unnamed_addr constant [8 x i8] c"exclude\00", align 1
@filter_tail = internal global %struct.filter_node** @filter_head, align 8
@filter_head = internal global %struct.filter_node* null, align 8
@.str.3 = private unnamed_addr constant [31 x i8] c"filter comparing '%s' and '%s'\00", align 1
@.str.4 = private unnamed_addr constant [20 x i8] c"filter including %s\00", align 1
@.str.5 = private unnamed_addr constant [19 x i8] c"filter removing %s\00", align 1
@.str.6 = private unnamed_addr constant [45 x i8] c"filter seeing if '%s' needs to be reincluded\00", align 1
@.str.7 = private unnamed_addr constant [5 x i8] c"*?[\5C\00", align 1
@.str.8 = private unnamed_addr constant [25 x i8] c"filter subpattern '%.*s'\00", align 1
@.str.9 = private unnamed_addr constant [22 x i8] c"filter reincluding %s\00", align 1

; Function Attrs: nounwind uwtable
define void @filter_add(i8*, i1 zeroext) #0 !dbg !67 {
  %3 = alloca i8*, align 8

!0 = distinct !DICompileUnit(language: DW_LANG_C99, file: !1, producer: "clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !48, globals: !50)
!1 = !DIFile(filename: "[inter]src--filters.o.i", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!2 = !{!3, !19, !27}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "debugflags", file: !4, line: 41, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "../lib/dpkg/debug.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!5 = !{!6, !7, !8, !9, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!6 = !DIEnumerator(name: "dbg_general", value: 1)
!7 = !DIEnumerator(name: "dbg_scripts", value: 2)
!8 = !DIEnumerator(name: "dbg_eachfile", value: 8)
!9 = !DIEnumerator(name: "dbg_eachfiledetail", value: 64)
!10 = !DIEnumerator(name: "dbg_conff", value: 16)
!11 = !DIEnumerator(name: "dbg_conffdetail", value: 128)
!12 = !DIEnumerator(name: "dbg_depcon", value: 32)
!13 = !DIEnumerator(name: "dbg_depcondetail", value: 256)
!14 = !DIEnumerator(name: "dbg_veryverbose", value: 512)
!15 = !DIEnumerator(name: "dbg_stupidlyverbose", value: 1024)
!16 = !DIEnumerator(name: "dbg_triggers", value: 4096)
!17 = !DIEnumerator(name: "dbg_triggersdetail", value: 8192)
!18 = !DIEnumerator(name: "dbg_triggersstupid", value: 16384)
!19 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tar_format", file: !20, line: 40, size: 32, align: 32, elements: !21)
!20 = !DIFile(filename: "../lib/dpkg/tarfn.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!21 = !{!22, !23, !24, !25, !26}
!22 = !DIEnumerator(name: "TAR_FORMAT_UNKNOWN", value: 0)
!23 = !DIEnumerator(name: "TAR_FORMAT_OLD", value: 1)
!24 = !DIEnumerator(name: "TAR_FORMAT_GNU", value: 2)
!25 = !DIEnumerator(name: "TAR_FORMAT_USTAR", value: 3)
!26 = !DIEnumerator(name: "TAR_FORMAT_PAX", value: 4)
!27 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "tar_filetype", file: !20, line: 48, size: 32, align: 32, elements: !28)
!28 = !{!29, !30, !31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47}
!29 = !DIEnumerator(name: "TAR_FILETYPE_FILE0", value: 0)
!30 = !DIEnumerator(name: "TAR_FILETYPE_FILE", value: 48)
!31 = !DIEnumerator(name: "TAR_FILETYPE_HARDLINK", value: 49)
!32 = !DIEnumerator(name: "TAR_FILETYPE_SYMLINK", value: 50)
!33 = !DIEnumerator(name: "TAR_FILETYPE_CHARDEV", value: 51)
!34 = !DIEnumerator(name: "TAR_FILETYPE_BLOCKDEV", value: 52)
!35 = !DIEnumerator(name: "TAR_FILETYPE_DIR", value: 53)
!36 = !DIEnumerator(name: "TAR_FILETYPE_FIFO", value: 54)
!37 = !DIEnumerator(name: "TAR_FILETYPE_CONTIG", value: 55)
!38 = !DIEnumerator(name: "TAR_FILETYPE_GNU_LONGLINK", value: 75)
!39 = !DIEnumerator(name: "TAR_FILETYPE_GNU_LONGNAME", value: 76)
!40 = !DIEnumerator(name: "TAR_FILETYPE_GNU_VOLUME", value: 86)
!41 = !DIEnumerator(name: "TAR_FILETYPE_GNU_MULTIVOL", value: 77)
!42 = !DIEnumerator(name: "TAR_FILETYPE_GNU_DUMPDIR", value: 68)
!43 = !DIEnumerator(name: "TAR_FILETYPE_GNU_SPARSE", value: 83)
!44 = !DIEnumerator(name: "TAR_FILETYPE_PAX_GLOBAL", value: 103)
!45 = !DIEnumerator(name: "TAR_FILETYPE_PAX_EXTENDED", value: 120)
!46 = !DIEnumerator(name: "TAR_FILETYPE_SOLARIS_EXTENDED", value: 88)
!47 = !DIEnumerator(name: "TAR_FILETYPE_SOLARIS_ACL", value: 65)
!48 = !{!49}
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64, align: 64)
!50 = !{!51, !63}
!51 = distinct !DIGlobalVariable(name: "filter_tail", scope: !0, file: !52, line: 44, type: !53, isLocal: true, isDefinition: true, variable: %struct.filter_node*** @filter_tail)
!52 = !DIFile(filename: "filters.c", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!53 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !54, size: 64, align: 64)
!54 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !55, size: 64, align: 64)
!55 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "filter_node", file: !52, line: 37, size: 192, align: 64, elements: !56)
!56 = !{!57, !58, !61}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !55, file: !52, line: 38, baseType: !54, size: 64, align: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "pattern", scope: !55, file: !52, line: 39, baseType: !59, size: 64, align: 64, offset: 64)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !60, size: 64, align: 64)
!60 = !DIBasicType(name: "char", size: 8, align: 8, encoding: DW_ATE_signed_char)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "include", scope: !55, file: !52, line: 40, baseType: !62, size: 8, align: 8, offset: 128)
!62 = !DIBasicType(name: "_Bool", size: 8, align: 8, encoding: DW_ATE_boolean)
!63 = distinct !DIGlobalVariable(name: "filter_head", scope: !0, file: !52, line: 43, type: !54, isLocal: true, isDefinition: true, variable: %struct.filter_node** @filter_head)
!64 = !{i32 2, !"Dwarf Version", i32 4}
!65 = !{i32 2, !"Debug Info Version", i32 3}
!66 = !{!"clang version 3.9.1-4ubuntu3~16.04.2 (tags/RELEASE_391/rc2)"}
!67 = distinct !DISubprogram(name: "filter_add", scope: !52, file: !52, line: 47, type: !68, isLocal: false, isDefinition: true, scopeLine: 48, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !72)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !70, !62}
!70 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !71, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !60)
!72 = !{}
!73 = !DILocalVariable(name: "pattern", arg: 1, scope: !67, file: !52, line: 47, type: !70)
!74 = !DIExpression()
!75 = !DILocation(line: 47, column: 24, scope: !67)
!76 = !DILocalVariable(name: "include", arg: 2, scope: !67, file: !52, line: 47, type: !62)
!77 = !DILocation(line: 47, column: 37, scope: !67)
!78 = !DILocalVariable(name: "filter", scope: !67, file: !52, line: 49, type: !54)
!79 = !DILocation(line: 49, column: 22, scope: !67)
!80 = !DILocation(line: 52, column: 8, scope: !67)
!81 = !DILocation(line: 52, column: 41, scope: !67)
!82 = !DILocation(line: 51, column: 2, scope: !67)
!83 = !DILocation(line: 54, column: 11, scope: !67)
!84 = !DILocation(line: 54, column: 9, scope: !67)
!85 = !DILocation(line: 55, column: 29, scope: !67)
!86 = !DILocation(line: 55, column: 20, scope: !67)
!87 = !DILocation(line: 55, column: 2, scope: !67)
!88 = !DILocation(line: 55, column: 10, scope: !67)
!89 = !DILocation(line: 55, column: 18, scope: !67)
!90 = !DILocation(line: 56, column: 20, scope: !67)
!91 = !DILocation(line: 56, column: 2, scope: !67)
!92 = !DILocation(line: 56, column: 10, scope: !67)
!93 = !DILocation(line: 56, column: 18, scope: !67)
!94 = !DILocation(line: 57, column: 2, scope: !67)
!95 = !DILocation(line: 57, column: 10, scope: !67)
!96 = !DILocation(line: 57, column: 15, scope: !67)
!97 = !DILocation(line: 59, column: 17, scope: !67)
!98 = !DILocation(line: 59, column: 3, scope: !67)
!99 = !DILocation(line: 59, column: 15, scope: !67)
!100 = !DILocation(line: 60, column: 17, scope: !67)
!101 = !DILocation(line: 60, column: 25, scope: !67)
!102 = !DILocation(line: 60, column: 14, scope: !67)
!103 = !DILocation(line: 61, column: 1, scope: !67)
!104 = distinct !DISubprogram(name: "filter_should_skip", scope: !52, file: !52, line: 64, type: !105, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false, unit: !0, variables: !72)
!105 = !DISubroutineType(types: !106)
!106 = !{!62, !107}
!107 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !108, size: 64, align: 64)
!108 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "tar_entry", file: !20, line: 71, size: 640, align: 64, elements: !109)
!109 = !{!110, !111, !112, !113, !114, !120, !124, !128}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "format", scope: !108, file: !20, line: 73, baseType: !19, size: 32, align: 32)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !108, file: !20, line: 75, baseType: !27, size: 32, align: 32, offset: 32)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !108, file: !20, line: 77, baseType: !59, size: 64, align: 64, offset: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "linkname", scope: !108, file: !20, line: 79, baseType: !59, size: 64, align: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !108, file: !20, line: 81, baseType: !115, size: 64, align: 64, offset: 192)
!115 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !116, line: 86, baseType: !117)
!116 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!117 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !118, line: 131, baseType: !119)
!118 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!119 = !DIBasicType(name: "long int", size: 64, align: 64, encoding: DW_ATE_signed)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "mtime", scope: !108, file: !20, line: 83, baseType: !121, size: 64, align: 64, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !122, line: 75, baseType: !123)
!122 = !DIFile(filename: "/usr/include/time.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!123 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !118, line: 139, baseType: !119)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "dev", scope: !108, file: !20, line: 85, baseType: !125, size: 64, align: 64, offset: 320)
!125 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !116, line: 60, baseType: !126)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !118, line: 124, baseType: !127)
!127 = !DIBasicType(name: "long unsigned int", size: 64, align: 64, encoding: DW_ATE_unsigned)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !108, file: !20, line: 87, baseType: !129, size: 256, align: 64, offset: 384)
!129 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "file_stat", file: !130, line: 40, size: 256, align: 64, elements: !131)
!130 = !DIFile(filename: "../lib/dpkg/file.h", directory: "/home/lichi/Desktop/dpkg/[task]src--dpkg")
!131 = !{!132, !136, !139, !142, !143}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !129, file: !130, line: 41, baseType: !133, size: 32, align: 32)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !116, line: 80, baseType: !134)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !118, line: 125, baseType: !135)
!135 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !129, file: !130, line: 42, baseType: !137, size: 32, align: 32, offset: 32)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !116, line: 65, baseType: !138)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !118, line: 126, baseType: !135)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "mode", scope: !129, file: !130, line: 43, baseType: !140, size: 32, align: 32, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !116, line: 70, baseType: !141)
!141 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !118, line: 129, baseType: !135)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "uname", scope: !129, file: !130, line: 47, baseType: !59, size: 64, align: 64, offset: 128)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "gname", scope: !129, file: !130, line: 48, baseType: !59, size: 64, align: 64, offset: 192)
!144 = !DILocalVariable(name: "ti", arg: 1, scope: !104, file: !52, line: 64, type: !107)
!145 = !DILocation(line: 64, column: 38, scope: !104)
!146 = !DILocalVariable(name: "f", scope: !104, file: !52, line: 66, type: !54)
!147 = !DILocation(line: 66, column: 22, scope: !104)
!148 = !DILocalVariable(name: "skip", scope: !104, file: !52, line: 67, type: !62)
!149 = !DILocation(line: 67, column: 6, scope: !104)
!150 = !DILocation(line: 69, column: 7, scope: !151)
!151 = distinct !DILexicalBlock(scope: !104, file: !52, line: 69, column: 6)
!152 = !DILocation(line: 69, column: 6, scope: !104)
!153 = !DILocation(line: 70, column: 3, scope: !151)
!154 = !DILocation(line: 73, column: 11, scope: !155)
!155 = distinct !DILexicalBlock(scope: !104, file: !52, line: 73, column: 2)
!156 = !DILocation(line: 73, column: 9, scope: !155)
!157 = !DILocation(line: 73, column: 7, scope: !155)
!158 = !DILocation(line: 73, column: 24, scope: !159)
!159 = !DILexicalBlockFile(scope: !160, file: !52, discriminator: 1)
!160 = distinct !DILexicalBlock(scope: !155, file: !52, line: 73, column: 2)
!161 = !DILocation(line: 73, column: 26, scope: !159)
!162 = !DILocation(line: 73, column: 2, scope: !159)
!163 = !DILocation(line: 75, column: 10, scope: !164)
!164 = distinct !DILexicalBlock(scope: !160, file: !52, line: 73, column: 47)
!165 = !DILocation(line: 75, column: 14, scope: !164)
!166 = !DILocation(line: 75, column: 23, scope: !164)
!167 = !DILocation(line: 75, column: 26, scope: !164)
!168 = !DILocation(line: 74, column: 3, scope: !164)
!169 = !DILocation(line: 77, column: 15, scope: !170)
!170 = distinct !DILexicalBlock(scope: !164, file: !52, line: 77, column: 7)
!171 = !DILocation(line: 77, column: 18, scope: !170)
!172 = !DILocation(line: 77, column: 28, scope: !170)
!173 = !DILocation(line: 77, column: 32, scope: !170)
!174 = !DILocation(line: 77, column: 7, scope: !170)
!175 = !DILocation(line: 77, column: 44, scope: !170)
!176 = !DILocation(line: 77, column: 7, scope: !164)
!177 = !DILocation(line: 78, column: 8, scope: !178)
!178 = distinct !DILexicalBlock(scope: !179, file: !52, line: 78, column: 8)
!179 = distinct !DILexicalBlock(scope: !170, file: !52, line: 77, column: 50)
!180 = !DILocation(line: 78, column: 11, scope: !178)
!181 = !DILocation(line: 78, column: 8, scope: !179)
!182 = !DILocation(line: 79, column: 10, scope: !183)
!183 = distinct !DILexicalBlock(scope: !178, file: !52, line: 78, column: 20)
!184 = !DILocation(line: 81, column: 11, scope: !183)
!185 = !DILocation(line: 81, column: 15, scope: !183)
!186 = !DILocation(line: 80, column: 5, scope: !183)
!187 = !DILocation(line: 82, column: 4, scope: !183)
!188 = !DILocation(line: 83, column: 10, scope: !189)
!189 = distinct !DILexicalBlock(scope: !178, file: !52, line: 82, column: 11)
!190 = !DILocation(line: 85, column: 11, scope: !189)
!191 = !DILocation(line: 85, column: 15, scope: !189)
!192 = !DILocation(line: 84, column: 5, scope: !189)
!193 = !DILocation(line: 87, column: 3, scope: !179)
!194 = !DILocation(line: 88, column: 2, scope: !164)
!195 = !DILocation(line: 73, column: 38, scope: !196)
!196 = !DILexicalBlockFile(scope: !160, file: !52, discriminator: 2)
!197 = !DILocation(line: 73, column: 41, scope: !196)
!198 = !DILocation(line: 73, column: 36, scope: !196)
!199 = !DILocation(line: 73, column: 2, scope: !196)
!200 = distinct !{!200, !201}
!201 = !DILocation(line: 73, column: 2, scope: !104)
!202 = !DILocation(line: 96, column: 6, scope: !203)
!203 = distinct !DILexicalBlock(scope: !104, file: !52, line: 96, column: 6)
!204 = !DILocation(line: 96, column: 11, scope: !203)
!205 = !DILocation(line: 96, column: 15, scope: !206)
!206 = !DILexicalBlockFile(scope: !203, file: !52, discriminator: 1)
!207 = !DILocation(line: 96, column: 19, scope: !206)
!208 = !DILocation(line: 96, column: 24, scope: !206)
